{"name":"19. Prostration","hadiths":[{"id":173,"text":"The Prophet recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.","by":"Narrated by 'Abdullah bin Masud "},{"id":174,"text":"On Fridays the Prophet used to recite Alf Lam Mim Tanzil-As-Sajda (in the first Raka) and Hal ata'alal-lnsani i.e. Suratad-Dahr (LXXVI) (in the second Raka), in the Fajr prayer.","by":"Narrated by Abu Huraira"},{"id":175,"text":"The prostration of Sad is not a compulsory one but I saw the Prophet prostrating while reciting it.","by":"Narrated by Ibn Abbas"},{"id":176,"text":"The Prophet recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me. Later on I saw him killed as a Nobel ever. \"","by":"Narrated by 'Abdullah bin Masud"},{"id":177,"text":"The Prophet I prostrated while reciting An-Najm and with him prostrated the Muslims, the pagans, the jinns, and all human beings.","by":"Narrated by Ibn Abbas"},{"id":178,"text":"I asked Zaid bin Thabit about prostration on which he said that he had recited An-Najm before the Prophet, yet he (the Prophet) had not performed a prostration.","by":"Narrated by 'Ata' bin Yasar"},{"id":179,"text":"I recited An-Najm before the Prophet, yet he did not perform a prostration. ","by":"Narrated by Zaid bin Thabit"},{"id":180,"text":"I saw Abu Huraira reciting Idha-Sama' un-Shaqqat and he prostrated during its recitation. I asked Abu Huraira, \"Didn't I see you prostrating?\" Abu Huraira said, \"Had I not seen the Prophet prostrating, I would not have prostrated.\"","by":"Narrated by Abu Salma"},{"id":181,"text":"When the Prophet recited a Sura that contained the prostration he would prostrate and we would do the same and some of us (because of the heavy rush) could not find a place for prostration.","by":"Narrated by Ibn 'Umar"},{"id":182,"text":"When the Prophet recited Surat As-Sajda and we were with him, he would prostrate and we also would prostrate with him and some of us (because of the heavy rush) would not find a place (for our foreheads) to prostrate on.","by":"Narrated by Ibn 'Umar"},{"id":183,"text":"'Umar bin Al-Khattab recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse of Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday 'Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O people! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right thing, yet it is no sin for the one who does not prostrate.\" And 'Umar did not prostrate (that day). Added Ibn 'Umar \"Allah has not made the prostration of recitation compulsory but if we wish we can do it.\"","by":"Narrated by Rabi'a"},{"id":184,"text":"I offered the 'Isha' prayer behind Abu Huraira and he recited Idhas-Sama' Un-Shaqqat, and prostrated. I said, \"What is this?\" Abu Huraira said, \"I prostrated behind Abu-l-Qasim and I will do the same till I meet him.\"","by":"Narrated by Abu Rafi"},{"id":185,"text":"Whenever the Prophet recited the Sura which contained the prostration of recitation he used to prostrate and then, we, too, would prostrate and some of us did not find a place for prostration.","by":"Narrated by Ibn 'Umar"}]}