{"name":"26. Pilgrimmage (Hajj)","hadiths":[{"id":589,"text":"Al-Fadl (his brother) was riding behind Allah's Apostle and a woman from the tribe of Khath'am came and Al-Fadl started looking at her and she started looking at him. The Prophet turned Al-Fadl's face to the other side. The woman said, \"O Allah's Apostle! The obligation of Hajj enjoined by Allah on His devotees has become due on my father and he is old and weak, and he cannot sit firm on the Mount; may I perform Hajj on his behalf?\" The Prophet replied, \"Yes, you may.\" That happened during the Hajj-al-Wida (of the Prophet ).","by":"Narrated by 'Abdullah bin Abbas "},{"id":590,"text":"I saw that Allah's Apostle used to ride on his Mount at Dhul Hulaifa and used to start saying, \"Labbaik\" when the Mount stood upright.","by":"Narrated by Ibn 'Umar"},{"id":591,"text":"That Allah's Apostle started saying, \"Labbaik\" from Dhul-Hulaifa when his Mount stood upright carrying him .","by":"Narrated by Jabir bin 'Abdullah "},{"id":592,"text":"Anas performed the Hajj on a pack-saddle and he was not a miser. Anas said, \"Allah's Apostle \r\n\r\nperformed Hajj on a pack-saddle and the same Mount was carrying his baggage too.\"","by":"Narrated by Thumama bin 'Abdullah bin Anas"},{"id":593,"text":"'Aisha said, \"O Allah's Apostle! You performed 'Umra but I did not.\" He said, \"O 'Abdur-Rahman! Go along with your sister and let her perform 'Umra from Tan'im.\" 'Abdur-Rahman made her ride over the pack-saddle of a she-camel and she performed 'Umra.","by":"Narrated by Al-Qasim bin Muhammad"},{"id":594,"text":"The Prophet was asked, \"Which is the best deed?\" He said, \"To believe in Allah and His Apostle.\" He was then asked, \"Which is the next (in goodness)?\" He said, \"To participate in Jihad in Allah's Cause.\" He was then asked, \"Which is the next?\" He said, \"To perform Hajj-Mabrur. \"","by":"Narrated by Abu Huraira"},{"id":595,"text":"(the mother of the faithful believers) I said, \"O Allah's Apostle! We consider Jihad as the best deed.\" The Prophet said, \"The best Jihad (for women) is Hajj Mabrur. \"","by":"Narrated by 'Aisha"},{"id":596,"text":"The Prophet (p.b.u.h) said, \"Whoever performs Hajj for Allah's pleasure and does not have sexual relations with his wife, and does not do evil or sins then he will return (after Hajj free from all sins) as if he were born anew.\"","by":"Narrated by Abu Huraira"},{"id":597,"text":"I went to visit 'Abdullah bin 'Umar at his house which contained many tents made of cotton cloth and these were encircled with Suradik (part of the tent). I asked him from where, should one assume Ihram for Umra. He said, \"Allah's Apostle had fixed as Miqat (singular of Mawaqit) Qarn for the people of Najd, Dhul-Hulaifa for the people of Medina, and Al-Juhfa for the people of Sham.\" ","by":"Narrated by Zaid bin Jubair"},{"id":598,"text":"The people of Yemen used to come for Hajj and used not to bring enough provisions with them and used to say that they depend on Allah. On their arrival in Medina they used to beg the people, and so Allah revealed, \"And take a provision (with you) for the journey, but the best provision is the fear of Allah.\" (2.197).","by":"Narrated by Ibn Abbas"},{"id":599,"text":"Allah's Apostle (p.b.u.h) made Dhul-Huiaifa as the Miqat for the people of Medina; Al-Juhfa for the people of Sham; Qarn-al-Manazil for the people of Najd; and Yalamlam for the people of Yemen; and these Mawaqit are for the people at those very places, and besides them for those who come thorough those places with the intention of performing Hajj and 'Umra; and whoever is living within these boundaries can assume lhram from the place he starts, and the people of Mecca can assume Ihram from Mecca.","by":"Narrated by Ibn Abbas"},{"id":600,"text":"'Abdullah bin 'Umar said, \"Allah's Apostle said, 'The people of Medina should assume lhram from Dhul-Hulaifa; the people of Sham from Al-Juhfa; and the people of Najd from Qarn.\" And 'Abdullah added, \"I was informed that Allah's Apostle had said, 'The people of Yemen should assume Ihram from Yalamlam.' \"","by":"Narrated by Nafi'"},{"id":601,"text":"Allah's Apostle had fixed Dhul Hulaifa as the Mlqat for the people of Medina; Al-Juhfa for the people of Sham; and Qarn Ul-Manazil for the people of Najd; and Yalamlam for the people of Yemen. So, these (above mentioned) are the Mawaqit for all those living at those places, and besides them for those who come through those places with the intention of performing Hajj and 'Umra and whoever lives within these places should assume Ihram from his dwelling place, and similarly the people of Mecca can assume lhram from Mecca.","by":"Narrated by Ibn Abbas "},{"id":602,"text":"\"The Prophet had fixed the Mawaqit as follows: (No. 603) ","by":"Narrated by Salim from his father who said,"},{"id":603,"text":"I heard Allah's Apostle saying, \"The Miqat for the people of Medina is Dhul-Hulaifa; for the people of Sham is Mahita; (i.e. Al-Juhfa); and for the people of Najd is Qarn. And said Ibn 'Umar, \"They claim, but I did not hear personally, that the Prophet said, \"The Miqat for the people of Yemen is Yalamlam.\" ","by":"Narrated by Salim bin 'Abdullah from his father"},{"id":604,"text":"The Prophet fixed Dhul-Hulaifa as the Miqat for the people of Medina, Al-Juhfa, for the people of Sham, Yalamlam for the people of Yemen, and Qarn for the people of Najd. And these Mawaqlt are for those living at those very places, and besides them for those who come through those places with the intention of performing Hajj and Umra; and whoever is living inside these places can assume lhram from his own dwelling place, and the people of Mecca can assume lhram from Mecca.","by":"Narrated by Ibn Abbas"},{"id":605,"text":"The Prophet (p.b.u.h) fixed Dhul-Hulaifa as the Miqat for the people of Medina, Al-Juhfa for the people of Sham, Qarn-ul-Manazil for the people of Najd, and Yalamlam for the people of Yemen; and these Mawaqit are for those living at those very places, and besides them for those whom come through them with the intention of performing Hajj and Umra; and whoever is living within these Mawaqit should assume lhram from where he starts, and the people of Mecca can assume Ihram from Mecca.","by":"Narrated by Ibn Abbas"},{"id":606,"text":"When these two towns (Basra and Kufa) were captured, the people went to 'Umar and said, \"O the Chief of the faithful believers! The Prophet fixed Qarn as the Miqat for the people of Najd, it is beyond our way and it is difficult for us to pass through it.\" He said, \"Take as your Miqat a place situated opposite to Qarn on your usual way. So, he fixed Dhatu-Irq (as their Miqat).\"","by":"Narrated by Ibn Umar"},{"id":607,"text":"'Abdullah bin 'Umar' said, \"Allah's Apostle made his camel sit (i.e. he dismounted) at Al-Batha' in Dhul-Hulaifa and offered the prayer.\" 'Abdullah bin 'Umar used to do the same.","by":"Narrated by Nafi "},{"id":608,"text":"Allah's Apostle used to go (for Hajj) via Ash-Shajara way and return via Muarras way; and no doubt, whenever Allah's Apostle went to Mecca, he used to offer the prayer in the Mosque of Ash-Shajara; and on his return, he used to offer the prayer at Dhul-Hulaifa in the middle of the valley, and pass the night there till morning.","by":"Narrated by Ibn 'Umar "},{"id":609,"text":"In the valley of Al-'Aqiq I heard Allah's Apostle saying, \"To night a messenger came to me from my Lord and asked me to pray in this blessed valley and to assume Ihram for Hajj and 'Umra together. \"","by":"Narrated by 'Umar"},{"id":610,"text":"Salim bin 'Abdullah's father said, \"The Prophet said that while resting in the bottom of the valley at Mu'arras in Dhul-Hulaifa, he had been addressed in a dream: 'You are verily in a blessed valley.' \" Salim made us to dismount from our camels at the place where 'Abdullah used to dismount, aiming at the place where Allah's Apostle had rested and it was below the Mosque situated in the middle of the valley in between them (the residence) and the road.","by":"Narrated by Musa bin 'Uqba"},{"id":611,"text":"Ibn 'Umar used to oil his hair. I told that to Ibrahim who said, \"What do you think about this statement: Narrated Aswad from 'Aisha: As if I were now observing the glitter of the scent in the parting of the hair of the Prophet while he was Muhrim?\"","by":"Narrated by Said bin Jubair"},{"id":612,"text":"(the wife of the Prophet (p.b.u.h) I used to scent Allah's Apostle when he wanted to assume Ihram and also on finishing Ihram before the Tawaf round the Ka'ba (Tawaf-al-ifada).","by":"Narrated by 'Aisha"},{"id":613,"text":"I heard that Allah's Apostle assumed Ihram with his hair matted together.","by":"Narrated by Salim from his father"},{"id":614,"text":"I heard my father saying, \"Never did Allah's Apostle assume Ihram except at the Mosque, that is, at the Mosque of Dhul-Hulaifa.","by":"Narrated by Salim bin 'Abdullah "},{"id":615,"text":"A man asked, \"O Allah's Apostle! What kind of clothes should a Muhrim wear?\" Allah's Apostle replied, \"He should not wear a shirt, a turban, trousers, a headcloak or leather socks except if he can find no slippers, he then may wear leather socks after cutting off what might cover the ankles. And he should not wear clothes which are scented with saffron or Wars (kinds of Perfumes) . \"","by":"Narrated by 'Abdullah bin 'Umar"},{"id":616,"text":"Ibn Abbas' said, \"Usama rode behind Allah's Apostle from 'Arafat to Al-Muzdalifa; and then Al-Fadl rode behind Allah's Apostle from Al-Muzdalifa to Mina.\" Ibn Abbas added, \"Both of them said, 'The Prophet kept on reciting Talbiya till he did the Rami of Jamrat-al-'Aqaba.' \"","by":"Narrated by 'Ubaidullah bin 'Abdullah"},{"id":617,"text":"The Prophet with his companions started from Medina after combing and oiling his hair and putting on two sheets of lhram (upper body cover and waist cover). He did not forbid anyone to wear any kind of sheets except the ones colored with saffron because they may leave the scent on the skin. And so in the early morning, the Prophet mounted his Mount while in Dhul-Hulaifa and set out till they reached Baida', where he and his companions recited Talbiya, and then they did the ceremony of Taqlid (which means to put the colored garlands around the necks of the Budn (camels for sacrifice). And all that happened on the 25th of Dhul-Qa'da. And when he reached Mecca on the 4th of Dhul-Hijja he performed the Tawaf round the Ka'ba and performed the Tawaf between Safa and Marwa. And as he had a Badana and had garlanded it, he did not finish his Ihram. He proceeded towards the highest places of Mecca near Al-Hujun and he was assuming the Ihram for Hajj and did not go near the Ka'ba after he performed Tawaf (round it) till he returned from 'Arafat. Then he ordered his companions to perform the Tawaf round the Ka'ba and then the Tawaf of Safa and Marwa, and to cut short the hair of their heads and to finish their Ihram. And that was only for those people who had not garlanded Budn. Those who had their wives with them were permitted to contact them (have sexual intercourse), and similarly perfume and (ordinary) clothes were permissible for them.","by":"Narrated by 'Abdullah bin Abbas"},{"id":618,"text":"The Prophet offered four Rakat in Medina and then two Rakat at DhulI lulaifa and then passed the night at Dhul-Hulaifa till it was morning and when he mounted his Mount and it stood up, he started to recite Talbiya.","by":"Narrated by Anas bin Malik"},{"id":619,"text":"Anas bin Malik said, \"The Prophet offered four Rakat of the Zuhr prayer in Medina and two Rakat of 'Asr prayer at Dhul-Hulaifa.\" I think that the Prophet passed the night there till morning.","by":"Narrated by Abu Qilaba"},{"id":620,"text":"The Prophet offered four Rakat of the Zuhr prayer in Medina and two Rakat of the 'Asr prayer in Dhul-Hulaifa and I heard them (the companions of the Prophet) reciting Talbiya together loudly to the extent of shouting.","by":"Narrated by Anas"},{"id":621,"text":"The Talbiya of Allah's Apostle was : 'Labbaika Allahumma labbaik, Labbaika la sharika Laka labbaik, Inna-l-hamda wan-ni'mata Laka walmu Lk, La sharika Laka' (I respond to Your call O Allah, I respond to Your call, and I am obedient to Your orders, You have no partner, I respond to Your call All the praises and blessings are for You, All the sovereignty is for You, And You have no partners with you.","by":"Narrated by 'Abdullah bin 'Umar "},{"id":622,"text":"I know how the Prophet used to say (Talbiya) and it was: 'Labbaika Allahumma Labbaik, Labbaika la sharika Laka labbaik, Inna-l-hamda wan-ni'mata Laka walmu Lk, La sharika Laka'. ","by":"Narrated by 'Aisha"},{"id":623,"text":"Allah's Apostle offered four Rakat of Zuhr prayer at Medina and we were in his company, and two Rakat of the Asr prayer at Dhul-Hulaifa and then passed the night there till it was dawn; then he rode, and when he reached Al-Baida', he praised and glorified Allah and said Takbir (i.e. Alhamdu-lillah and Subhanallah(1) and Allahu-Akbar). Then he and the people along with him recited Talbiya with the intention of performing Hajj and Umra. When we reached (Mecca) he ordered us to finish the lhram (after performing the Umra) (only those who had no Hadi (animal for sacrifice) with them were asked to do so) till the day of Tarwiya that is 8th Dhul-Hijja when they assumed Ihram for Hajj. The Prophet sacrificed many camels (slaughtering them) with his own hands while standing. While Allah's Apostle was in Medina he sacrificed two horned rams black and white in color in the Name of Allah.\"","by":"Narrated by Anas bin Malik"},{"id":624,"text":"The Prophet (p.b.u.h) recited Talbiya when he had mounted his Mount and was ready to set out.","by":"Narrated by Ibn Umar"},{"id":625,"text":"Whenever Ibn 'Umar intended to go to Mecca he used to oil himself with a sort of oil that had no pleasant smell, then he would go to the Mosque of Al-Hulaita and offer the prayer, and then ride. When he mounted well on his Mount and the Mount stood up straight, he would proclaim the intention of assuming Ihram, and he used to say that he had seen the Prophet doing the same. ","by":"Narrated by Nafi'"},{"id":626,"text":"I was in the company of Ibn Abbas and the people talked about Ad-Dajjal and said, \"Ad-Dajjal will come with the word Kafir (non-believer) written in between his eyes.\" On that Ibn Abbas said, \"I have not heard this from the Prophet but I heard him saying, 'As if I saw Moses just now entering the valley reciting Talbyia. ' \"","by":"Narrated by Mujahid"},{"id":627,"text":"(the wife of the Prophet (p.b.u.h) We set out with the Prophet in his last Hajj and we assumed Ihram for Umra. The Prophet then said, \"Whoever has the Hadi with him should assume Ihram for Hajj along with 'Umra and should not finish the Ihram till he finishes both.\" I was menstruating when I reached Mecca, and so I neither did Tawaf round the Ka'ba nor Tawaf between Safa and Marwa. I complained about that to the Prophet on which he replied, \"Undo and comb your head hair, and assume Ihram for Hajj (only) and leave the Umra.\" So, I did so. When we had performed the Hajj, the Prophet sent me with my brother 'Abdur-Rahman bin Abu Bakr to Tan'im. So I performed the 'Umra. The Prophet said to me, \"This 'Umra is instead of your missed one.\" Those who had assumed Ihram for 'Umra (Hajj-atTamattu) performed Tawaf round the Ka'ba and between Safa and Marwa and then finished their Ihram. After returning from Mina, they performed another Tawaf (between Safa and Marwa). Those who had assumed Ihram for Hajj and 'Umra together (Hajj-al-Qiran) performed only one Tawaf (between Safa and Marwa).","by":"Narrated by Aisha"},{"id":628,"text":"Jabir said, \"The Prophet ordered Ali to keep on assuming his Ihram.\" The narrator then informed about the narration of Suraqa.","by":"Narrated by Ata"},{"id":629,"text":"Ali came to the Prophet (p.b.u.h) from Yemen (to Mecca). The Prophet asked Ali, \"With what intention have you assumed Ihram?\" Ali replied, \"I have assumed Ihram with the same intention as that of the Prophet.\" The Prophet said, \"If I had not the Hadi with me I would have finished the Ihram.\" Muhammad bin Bakr narrated extra from Ibn Juraij, \"The Prophet said to Ali, \"With what intention have you assumed the Ihram, O Ali?\" He replied, \"With the same (intention) as that of the Prophet.\" The Prophet said, \"Have a Hadi and keep your Ihram as it is.\"","by":"Narrated by Anas bin Malik"},{"id":630,"text":"The Prophet sent me to some people in Yemen and when I returned, I found him at Al-Batha. He asked me, \"With what intention have you assumed Ihram (i.e. for Hajj or for Umra or for both?\") I replied, \"I have assumed Ihram with an intention like that of the Prophet.\" He asked, \"Have you a Hadi with you?\" I replied in the negative. He ordered me to perform Tawaf round the Ka'ba and between Safa and Marwa and then to finish my Ihram. I did so and went to a woman from my tribe who combed my hair or washed my head. Then, when Umar came (i.e. became Caliph) he said, \"If we follow Allah's Book, it orders us to complete Hajj and Umra; as Allah says: \"Perform the Hajj and Umra for Allah.\" (2.196). And if we follow the tradition of the Prophet who did not finish his Ihram till he sacrificed his Hadi.\"","by":"Narrated by Abu Musa"},{"id":631,"text":"'Aisha said, \"We set out with Allah's Apostles in the months of Hajj, and (in) the nights of Hajj, and at the time and places of Hajj and in a state of Hajj. We dismounted at Sarif (a village six miles from Mecca). The Prophet then addressed his companions and said, \"Anyone who has not got the Hadi and likes to do Umra instead of Hajj may do so (i.e. Hajj-al-Tamattu) and anyone who has got the Hadi should not finish the Ihram after performing ' Umra). (i.e. Hajj-al-Qiran). Aisha added, \"The companions of the Prophet obeyed the above (order) and some of them (i.e. who did not have Hadi) finished their Ihram after Umra.\" Allah's Apostle and some of his companions were resourceful and had the Hadi with them, they could not perform Umra (alone) (but had to perform both Hajj and Umra with one Ihram). Aisha added, \"Allah's Apostle came to me and saw me weeping and said, \"What makes you weep, O Hantah?\" I replied, \"I have heard your conversation with your companions and I cannot perform the Umra.\" He asked, \"What is wrong with you?' I replied, ' I do not offer the prayers (i.e. I have my menses).' He said, ' It will not harm you for you are one of the daughters of Adam, and Allah has written for you (this state) as He has written it for them. Keep on with your intentions for Hajj and Allah may reward you that.\" Aisha further added, \"Then we proceeded for Hajj till we reached Mina and I became clean from my menses. Then I went out from Mina and performed Tawaf round the Ka'ba.\" Aisha added, \"I went along with the Prophet in his final departure (from Hajj) till he dismounted at Al-Muhassab (a valley outside Mecca), and we too, dismounted with him.\" He called ' Abdur-Rahman bin Abu Bakr and said to him, ' Take your sister outside the sanctuary of Mecca and let her assume Ihram for ' Umra, and when you had finished ' Umra, return to this place and I will wait for you both till you both return to me.' \" ' Aisha added, ' ' So we went out of the sanctuary of Mecca and after finishing from the ' Umra and the Tawaf we returned to the Prophet at dawn. He said, 'Have you performed the ' Umra?' We replied in the affirmative. So he announced the departure amongst his companions and the people set out for the journey, and the Prophet: too left for Medina.''","by":"Narrated by Al-Qasim bin Muhammad"},{"id":632,"text":"'Aisha said, We went out with the Prophet (from Medina) with the intention of performing Hajj only and when we reached Mecca we performed Tawaf round the Kaba and then the Prophet ordered those who had not driven the Hadi along with them to finish their Ihram. So the people who had not driven the Hadi along with them finished their Ihram. The Prophet's wives, too, had not driven the Hadi with them, so they too, finished their Ihram.\" 'Aisha added, \"I got my menses and could not perform Tawaf round the Ka'ba.\" So when it was the night of Hasba (i.e. when we stopped at Al-Muhassab), I said, 'O Allah's Apostle! Everyone is returning after performing Hajj and 'Umra but I am returning after performing Hajj only.' He said, 'Didn't you perform Tawaf round the Ka'ba the night we reached Mecca?' I replied in the negative. He said, 'Go with your brother to Tan'im and assume the Ihram for'Umra, (and after performing it) come back to such and such a place.' On that Safiya said, 'I feel that I will detain you all.' The Prophet said, 'O 'Aqra Halqa! Didn't you perform Tawaf of the Ka'ba on the day of sacrifice? (i.e. Tawaf-al-ifada) Safiya replied in the affirmative. He said, (to Safiya). 'There is no harm for you to proceed on with us.' \" 'Aisha added, \"(after returning from 'Umra), the Prophet met me while he was ascending (from Mecca) and I was descending to it, or I was ascending and he was descending.\"","by":"Narrated by Al-Aswad"},{"id":633,"text":"We set out with Allah's Apostles (to Mecca) in the year of the Prophet's Last Hajj. Some of us had assumed Ihram for 'Umra only, some for both Hajj and 'Umra, and others for Hajj only. Allah's Apostle assumed Ihram for Hajj. So whoever had assumed Ihram for Hajj or for both Hajj and 'Umra did not finish the Ihram till the day of sacrifice. (See Hadith No. 631, 636, and 639).","by":"Narrated by 'Aisha"},{"id":634,"text":"I saw 'Uthman and 'Ali. 'Uthman used to forbid people to perform Hajj-at-Tamattu' and Hajj-al-Qiran (Hajj and 'Umra together), and when 'Ali saw (this act of 'Uthman), he assumed Ihram for Hajj and 'Umra together saying, \"Lubbaik for 'Umra and Hajj,\" and said, \"I will not leave the tradition of the Prophet on the saying of somebody.\"","by":"Narrated by Marwan bin Al-Hakam"},{"id":635,"text":"The people (of the Pre-lslamic Period) used to think that to perform 'Umra during the months of Hajj was one of the major sins on earth. And also used to consider the month of Safar as a forbidden (i.e. sacred) month and they used to say, \"When the wounds of the camel's back heal up (after they return from Hajj) and the signs of those wounds vanish and the month of Safar passes away then (at that time) 'Umra is permissible for the one who wishes to perform it.\" In the morning of the 4th of Dhul-Hijja, the Prophet and his companions reached Mecca, assuming Ihram for Hajj and he ordered his companions to make their intentions of the Ihram for'Umra only (instead of Hajj) so they considered his order as something great and were puzzled, and said, \"O Allah's Apostle! What kind (of finishing) of Ihram is allowed?\" The Prophet replied, \"Finish the Ihram completely like a non-Muhrim (you are allowed everything).\"","by":"Narrated by Ibn Abbas"},{"id":636,"text":"I came to the Prophet (from Yemen and was assuming Ihram for Hajj) and he ordered me to finish the Ihram (after performing the 'Umra).","by":"Narrated by Abu Musa"},{"id":637,"text":"Hafsa the wife of the Prophet said, \"O Allah's Apostle! Why have the people finished their Ihram after performing 'Umra but you have not finished your Ihram after performing 'Umra?\" He replied, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram till I have slaughtered (my Hadi). \"","by":"Narrated by Ibn 'Umar"},{"id":638,"text":"Abu Jamra Nasr bin 'Imran Ad-Duba'i said, \"I intended to perform Hajj-at-Tamattu' and the people advised me not to do so. I asked Ibn Abbas regarding it and he ordered me to perform Hajj-at-Tammatu'. Later I saw in a dream someone saying to me, 'Hajj-Mabrur (Hajj performed in accordance with the Prophet's tradition without committing sins and accepted by Allah) and an accepted 'Umra.' So I told that dream to Ibn Abbas. He said, 'This is the tradition of Abu-l-Qasim.' Then he said to me, 'Stay with me and I shall give you a portion of my property.' \" I (Shu'ba) asked, \"Why (did he invite you)?\" He (Abu Jamra) said, \"Because of the dream which I had seen.\"","by":"Narrated by Shu'ba"},{"id":639,"text":"I left for Mecca for Hajj-at-Tamattu' assuming Ihram for 'Umra. I reached Mecca three days before the day of Tarwiya (8th Dhul-Hijja). Some people of Mecca said to me, \"Your Hajj will be like the Hajj performed by the people of Mecca (i.e. you will lose the superiority of assuming Ihram from the Miqat). So I went to 'Ata' asking him his view about it. He said, \"Jabir bin 'Abdullah narrated to me, 'I performed Hajj with Allah's Apostle on the day when he drove camels with him. The people had assumed Ihram for Hajj-al-Ifrad. The Prophet ordered them to finish their Ihram after Tawaf round the Ka'ba, and between Safa and Marwa and to cut short their hair and then to stay there (in Mecca) as non-Muhrims till the day of Tarwiya (i.e. 8th of Dhul-Hijja) when they would assume Ihram for Hajj and they were ordered to make the Ihram with which they had come as for 'Umra only. They asked, 'How can we make it 'Umra (Tamattu') as we have intended to perform Hajj?' The Prophet said, 'Do what I have ordered you. Had I not brought the Hadi with me, I would have done the same, but I cannot finish my Ihram till the Hadi reaches its destination (i.e. is slaughtered).' So, they did (what he ordered them to do).\"","by":"Narrated by Abu Shihab"},{"id":640,"text":"'Ali and 'Uthman differed regarding Hajj-at-Tamattu' while they were at 'Usfan (a familiar place near Mecca). 'Ali said, \"I see you want to forbid people to do a thing that the Prophet did?\" When 'Ali saw that, he assumed Ihram for both Hajj and 'Umra.","by":"Narrated by Said bin Al-Musaiyab"},{"id":641,"text":"We came with Allah's Apostle (to Mecca) and we were saying: 'Labbaika Allahumma Labbaik' for Hajj. Allah's Apostle ordered us to perform 'Umra with that Ihram (instead of Hajj).","by":"Narrated by Jabir bin 'Abdullah "},{"id":642,"text":"We performed Hajj-at-Tamattu' in the lifetime of Allah's Apostle and then the Quran was revealed (regarding Hajj-at-Tamattu') and somebody said what he wished (regarding Hajj-at-Tamattu') according his own opinion.","by":"Narrated by 'Imran"},{"id":643,"text":"On reaching the sanctuary of Mecca, Ibn 'Umar used to stop, reciting Talbiya and then he would pass the night at Dhi-Tuwa and then offer the Fajr prayer and take a bath. He used to say that the Prophet used to do the same.","by":"Narrated by Nafi"},{"id":644,"text":"' Ibn 'Umar said, \"The Prophet passed the night at Dhi-Tuwa till it was dawn and then he entered Mecca.\" Ibn 'Umar used to do the same.","by":"Narrated by Nafi"},{"id":645,"text":"Allah's Apostle used to enter Mecca from the high Thaniya and used to leave Mecca from the low Thaniya.","by":"Narrated by Ibn 'Umar"},{"id":646,"text":"Allah's Apostle entered Mecca from Kada' from the highest Thaniya which is at Al-Batha' and used to leave Mecca from the low Thaniya.","by":"Narrated by Ibn 'Umar"},{"id":647,"text":"When the Prophet came to Mecca he entered from its higher side and left from its lower side. ","by":"Narrated by 'Aisha"},{"id":648,"text":"In the year of the conquest of Mecca, the Prophet entered Mecca from Kada' and left Mecca from Kuda, from the higher part of Mecca. ","by":"Narrated by 'Aisha'"},{"id":649,"text":"In the year of the conquest of Mecca, the Prophet entered Mecca from Kada' at the higher place of Mecca. (Hisham, a sub-narrator said, \" 'Urwa used to enter (Mecca) from both Kada' and Kuda and he often entered through Kada' which was nearer to his dwelling place.)\"","by":"Narrated by 'Aisha"},{"id":650,"text":"'Urwa said, \"The Prophet entered Mecca in the year of the conquest of Mecca from the side of Kada' which is at the higher part of Mecca.\" 'Urwa often entered from Kada' which was nearer of the two to his dwelling place.","by":"Narrated by Hisham"},{"id":651,"text":"In the year of the conquest of Mecca, the Prophet entered Mecca from the side of Kada. Urwa used to enter through both places and he often entered through Kada' which was nearer of the two to his dwelling place.","by":"Narrated by Hisham from his father "},{"id":652,"text":"When the Ka'ba was built, the Prophet and Abbas went to bring stones (for its construction). Al Abbas said to the Prophet, \"Take off your waist sheet and put it on your neck.\" (When the Prophet took it off) he fell on the ground with his eyes open towards the sky and said, \"Give me my waist sheet.\" And he covered himself with it.","by":"Narrated by Jabir bin 'Abdullah"},{"id":653,"text":"(the wife of the Prophet) that Allah's Apostle said to her, \"Do you know that when your people (Quraish) rebuilt the Ka'ba, they decreased it from its original foundation laid by Abraham?\" I said, \"O Allah's Apostle! Why don't you rebuild it on its original foundation laid by Abraham?\" He replied, \"Were it not for the fact that your people are close to the pre-lslamic Period of ignorance (i.e. they have recently become Muslims) I would have done so.\" The sub-narrator, 'Abdullah (bin 'Umar ) stated: 'Aisha 'must have heard this from Allah's Apostle for in my opinion Allah's Apostle had not placed his hand over the two corners of the Ka'ba opposite Al-Hijr only because the Ka'ba was not rebuilt on its original foundations laid by Abraham.","by":"Narrated by 'Aisha"},{"id":654,"text":"I asked the Prophet whether the round wall (near Ka'ba) was part of the Ka'ba. The Prophet replied in the affirmative. I further said, \"What is wrong with them, why have they not included it in the building of the Ka'ba?\" He said, \"Don't you see that your people (Quraish) ran short of money (so they could not include it inside the building of Ka'ba)?\" I asked, \"What about its gate? Why is it so high?\" He replied, \"Your people did this so as to admit into it whomever they liked and prevent whomever they liked. Were your people not close to the Pre-lslamic Period of ignorance (i.e. they have recently embraced Islam) and were I not afraid that they would dislike it, surely I would have included the (area of the) wall inside the building of the Ka'ba and I would have lowered its gate to the level of the ground.\"","by":"Narrated by 'Aisha"},{"id":655,"text":"Allah's Apostle said to me, \"Were your people not close to the Pre-lslamic period of ignorance, I would have demolished the Ka'ba and would have rebuilt it on its original foundations laid by Abraham (for Quraish had curtailed its building), and I would have built a back door (too).\"","by":"Narrated by 'Aisha"},{"id":656,"text":"'Aisha said that the Prophet said to her, \"O Aisha! Were your nation not close to the Pre-lslamic Period of Ignorance, I would have had the Ka'ba demolished and would have included in it the portion which had been left, and would have made it at a level with the ground and would have made two doors for it, one towards the east and the other towards the west, and then by doing this it would have been built on the foundations laid by Abraham.\" That was what urged Ibn-Az-Zubair to demolish the Ka'ba. Jazz said, \"I saw Ibn-Az-Zubair when he demolished and rebuilt the Ka'ba and included in it a portion of Al-Hijr (the unroofed portion of Ka'ba which is at present in the form of a compound towards the north-west of the Ka'ba). I saw the original foundations of Abraham which were of stones resembling the humps of camels.\" So Jarir asked Yazid, \"Where was the place of those stones?\" Jazz said, \"I will just now show it to you.\" So Jarir accompanied Yazid and entered Al-Hijr, and Jazz pointed to a place and said, \"Here it is.\" Jarir said, \"It appeared to me about six cubits from Al-Hijr or so.\"","by":"Narrated by Yazid bin Ruman from 'Urwa"},{"id":657,"text":"On the Day of the Conquest of Mecca, Allah's Apostle said, \"Allah has made this town a sanctuary. Its thorny bushes should not be cut, its game should not be chased, and its fallen things should not be picked up except by one who would announce it publicly.\"","by":"Narrated by Ibn Abbas"},{"id":658,"text":"I asked, \"O Allah's Apostle! Where will you stay in Mecca? Will you stay in your house in Mecca?\" He replied, \"Has 'Aqil left any property or house?\" Aqil along with Talib had inherited the property of Abu Talib. Jafar and Ali did not inherit anything as they were Muslims and the other two were non-believers. 'Umar bin Al-Khattab used to say, \"A believer cannot inherit (anything from an) infidel.\" Ibn Shihab, (a sub-narrator) said, \"They (Umar and others) derived the above verdict from Allah's Statement: \"Verily! those who believed and Emigrated and strove with their life And property in Allah's Cause, And those who helped (the emigrants) And gave them their places to live in, These are (all) allies to one another.\" (8.72)","by":"Narrated by 'Usama bin Zaid"},{"id":659,"text":"When Allah's Apostle intended to enter Mecca he said, \"Our destination tomorrow, if Allah wished, will be Khaif Bani Kinana where (the pagans) had taken the oath of Kufr.\" (Against the Prophet i.e. to be loyal to heathenism by boycotting Bani Ha shim, the Prophets folk) (See Hadith No. 221 Vol. 5)","by":"Narrated by Abu Huraira"},{"id":660,"text":"On the Day of Nahr at Mina, the Prophet said, \"Tomorrow we shall stay at Khaif Bani Kinana where the pagans had taken the oath of Kufr (heathenism).\" He meant (by that place) Al-Muhassab where the Quraish tribe and Bani Kinana concluded a contract against Bani Hashim and Bani 'Abdul-Muttalib or Bani Al-Muttalib that they would not intermarry with them or deal with them in business until they handed over the Prophet to them.","by":"Narrated by Abu Huraira"},{"id":661,"text":"The Prophet;; said, \"Dhus-Suwaiqa-tain (literally: One with two lean legs) from Ethiopia will demolish the Ka'ba.\"","by":"Narrated by Abu Huraira"},{"id":662,"text":"The people used to fast on 'Ashura (the tenth day of the month of Muharram) before the fasting of Ramadan was made obligatory. And on that day the Ka'ba used to be covered with a cover. When Allah made the fasting of the month of Ramadan compulsory, Allah's Apostle said, \"Whoever wishes to fast (on the day of 'Ashura') may do so; and whoever wishes to leave it can do so.\"","by":"Narrated by 'Aisha"},{"id":663,"text":"The Prophet said \"The people will continue performing the Hajj and 'Umra to the Ka'ba even after the appearance of Gog and Magog.\" \r\n\r\nNarrated Shu'ba extra: \r\n\r\nThe Hour (Day of Judgment) will not be established till the Hajj (to the Ka'ba) is abandoned. ","by":"Narrated by Abu Said Al-Khudri"},{"id":664,"text":"(One day) I sat along with Shaiba on the chair inside the Ka'ba. He (Shaiba) said, \"No doubt, Umar sat at this place and said, 'I intended not to leave any yellow (i.e. gold) or white (i.e. silver) (inside the Ka'ba) undistributed.' I said (to 'Umar), 'But your two companions (i.e. The Prophet and Abu Bakr) did not do so.' 'Umar said, They are the two persons whom I always follow.' \"","by":"Narrated by Abu Wail"},{"id":665,"text":"The Prophet said, \"As if I were looking at him, a black person with thin legs plucking the stones of the Ka'ba one after another. \"","by":"Narrated by Ibn Abbas"},{"id":666,"text":"Allah's Apostle said, \"DhusSuwaiqatain (the thin legged man) from Ethiopia will demolish the Ka'ba.\" ","by":"Narrated by Abu Huraira"},{"id":667,"text":"'Umar came near the Black Stone and kissed it and said \"No doubt, I know that you are a stone and can neither benefit anyone nor harm anyone. Had I not seen Allah's Apostle kissing you I would not have kissed you.\"","by":"Narrated by 'Abis bin Rabia"},{"id":668,"text":"\"Allah's Apostle, Usama bin Zaid, Bilal, and 'Uthman bin abu Talha entered the Ka'ba and then closed its door. When they opened the door I was the first person to enter (the Ka'ba). I met Bilal and asked him, \"Did Allah's Apostle offer a prayer inside (the Ka'ba)?\" Bilal replied in the affirmative and said, \"(The Prophet offered the prayer) in between the two right pillars.\"","by":"Narrated by Salim that his father said"},{"id":669,"text":"Whenever Ibn 'Umar entered the Ka'ba he used to walk straight keeping the door at his back on entering, and used to proceed on till about three cubits from the wall in front of him, and then he would offer the prayer there aiming at the place where Allah's Apostle prayed, as Bilal had told him. There is no harm for any person to offer the prayer at any place inside the Ka'ba.","by":"Narrated by Nafi'"},{"id":670,"text":"'Abdullah bin Abu Aufa said, \"Allah's Apostle performed the 'Umra. He performed Tawaf of the Ka'ba and offered two Rakat behind the Maqam (Abraham's place) and was accompanied by those who were screening him from the people.\" Somebody asked 'Abdullah, \"Did Allah's Apostle enter the Ka'ba?\" 'Abdullah replied in the negative.","by":"Narrated by Isma'li bin Abu Khalid"},{"id":671,"text":"When Allah's Apostle came to Mecca, he refused to enter the Ka'ba with idols in it. He ordered (idols to be taken out). So they were taken out. The people took out the pictures of Abraham and Ishmael holding Azlams in their hands. Allah's Apostle said, \"May Allah curse these people. By Allah, both Abraham and Ishmael never did the game of chance with Azlams.\" Then he entered the Ka'ba and said Takbir at its corners but did not offer the prayer in it.","by":"Narrated by Ibn Abbas"},{"id":672,"text":"When Allah's Apostle and his companions came to Mecca, the pagans circulated the news that a group of people were coming to them and they had been weakened by the Fever of Yathrib (Medina). So the Prophet ordered his companions to do Ramal in the first three rounds of Tawaf of the Ka'ba and to walk between the two corners (The Black Stone and Yemenite corner). The Prophet did not order them to do Ramal in all the rounds of Tawaf out of pity for them.","by":"Narrated by Ibn Abbas"},{"id":673,"text":"I saw Allah's Apostle arriving at Mecca; he kissed the Black Stone Corner first while doing Tawaf and did ramal in the first three rounds of the seven rounds (of Tawaf).","by":"Narrated by Salim that his father said"},{"id":674,"text":"The Prophet did Ramal in (first) three rounds (of Tawaf), and walked in the remaining four, in Hajj and Umra.","by":"Narrated by Abdullah bin Umar "},{"id":675,"text":"\"Umar bin Al-Khattab addressed the Corner (Black Stone) saying, 'By Allah! I know that you are a stone and can neither benefit nor harm. Had I not seen the Prophet touching (and kissing) you, I would never have touched (and kissed) you.' Then he kissed it and said, 'There is no reason for us to do Ramal (in Tawaf) except that we wanted to show off before the pagans, and now Allah has destroyed them.' 'Umar added, '(Nevertheless), the Prophet did that and we do not want to leave it (i.e. Ramal).'","by":"Narrated by Zaid bin Aslam from his father who said:"},{"id":676,"text":"Ibn 'Umar. said, \"I have never missed the touching of these two stones of Ka'ba (the Black Stone and the Yemenite Corner) both in the presence and the absence of crowds, since I saw the Prophet touching them.\" I asked Nafi': \"Did Ibn 'Umar use to walk between the two Corners?\" Nafi' replied, \"He used to walk in order that it might be easy for him to touch it (the Corner Stone).\"","by":"Narrated by Nafi'"},{"id":677,"text":"In his Last Hajj the Prophet performed Tawaf of the Ka'ba riding a camel and pointed a bent-headed stick towards the Corner (Black Stone).","by":"Narrated by Ibn Abbas"},{"id":678,"text":"\"I have not seen the Prophet touching except the two Yemenite Corners (i.e. the ones facing Yemen).\" ","by":"Narrated by Salim bin 'Abdullah that his father said"},{"id":679,"text":"\"I saw 'Umar bin Al-Khattab kissing the Black Stone and he then said, (to it) 'Had I not seen Allah's Apostle kissing you, (stone) I would not have kissed you.' \"","by":"Narrated by Zaid bin Aslam that his father said"},{"id":680,"text":"A man asked Ibn 'Umar about the touching of the Black Stone. Ibn 'Umar said, \"I saw Allah's Apostle touching and kissing it.\" The questioner said, \"But if there were a throng (much rush) round the Ka'ba and the people overpowered me, (what would I do?)\" He replied angrily, \"Stay in Yemen (as that man was from Yemen). I saw Allah's Apostle touching and kissing it.\"","by":"Narrated by Az-Zubair bin 'Arabi"},{"id":681,"text":"The Prophet performed Tawaf of the Ka'ba while riding a camel, and whenever he came in front of the Corner, he pointed towards it (with something).","by":"Narrated by Ibn Abbas"},{"id":682,"text":"The Prophet performed Tawaf of the Ka'ba riding a camel, and every time he came in front of the Corner (having the Black Stone), he pointed towards it with something he had with him and said Takbir.","by":"Narrated by Ibn Abbas"},{"id":683,"text":"'Aisha said, \"The first thing the Prophet did on reaching Mecca, was the ablution and then he performed Tawaf of the Ka'ba and that was not 'Umra (alone), (but Hajj-al-Qiran). 'Urwa added: Later Abu Bakr and 'Umar did the same in their Hajj.\" And I performed the Hajj with my father Az-Zubair, and the first thing he did was Tawaf of the Ka'ba. Later I saw the Muhajirin (Emigrants) and the Ansar doing the same. My mother (Asma') told me that she, her sister ('Aisha), Az-Zubair and such and such persons assumed Ihram for 'Umra, and after they passed their hands over the Black Stone Corner (of the Ka'ba) they finished the Ihram. (i.e. After doing Tawaf of the Ka'ba and Sa'i between Safa-Marwa.","by":"Narrated by 'Urwa"},{"id":684,"text":"When Allah's Apostle performed Tawaf of the Ka'ba for Hajj or 'Umra, he used to do Ramal during the first three rounds, and in the last four rounds he used to walk; then after the Tawaf he used to offer two Rakat and then performed Tawaf between Safa and Marwa.","by":"Narrated by 'Abdullah bin 'Umar "},{"id":685,"text":"When the Prophet performed the Tawaf of the Ka'ba, he did Ramal during the first three rounds and in the last four rounds he used to walk and while doing Tawaf between Safa and Marwa, he used to run in the midst of the rain water passage. ","by":"Narrated by Ibn 'Umar"},{"id":686,"text":"(the wife of the Prophet) I informed Allah's Apostle that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet was praying beside the Ka'ba and reciting Surat-at-Tur.","by":"Narrated by Um Salama"},{"id":687,"text":"While the Prophet was performing Tawaf of the Kaba, he passed by a person who had tied his hands to another person with a rope or string or something like that. The Prophet cut it with his own hands and said, \"Lead him by the hand.\"","by":"Narrated by Ibn Abbas"},{"id":688,"text":"The Prophet saw a man performing Tawaf of the Kaba tied with a string or something else. So the Prophet cut that string.","by":"Narrated by Ibn Abbas"},{"id":689,"text":"In the year prior to the last Hajj of the Prophet when Allahs Apostle made Abu Bakr the leader of the pilgrims, the latter (Abu Bakr) sent me in the company of a group of people to make a public announcement: 'No pagan is allowed to perform Hajj after this year, and no naked person is allowed to perform Tawaf of the Kaba.' (See Hadith No. 365 Vol. 1)","by":"Narrated by Abu Huraira"},{"id":690,"text":"We asked Ibn Umar: \"May a man have sexual relations with his wife during the Umra before performing Tawaf between Safa and Marwa?\" He said, \"Allah's Apostle arrived (in Mecca) and circumambulated the Kaba seven times, then offered two Rakat behind Maqam Ibrahim (the station of Abraham), then performed Tawaf between Safa and Marwa.\" Ibn Umar added, \"Verily! In Allah's Apostle you have a good example.\" And I asked Jabir bin Abdullah (the same question), and he replied, \"You should not go near your wives (have sexual relations) till you have finished Tawaf between Safa and Marwa. \"","by":"Narrated by Amr"},{"id":691,"text":"The Prophet arrived at Mecca and performed Tawaf of the Kaba and Sa'i between Safa and Marwa, but he did not go near the Kaba after his Tawaf till he returned from Arafat.","by":"Narrated by Ibn Abbas"},{"id":692,"text":"(the wife of the Prophet) I informed Allah's Apostle (about my illness). (Through other sub-narrators, Um Salama narrated that when Allah's Apostle was at Mecca and had just decided to leave (Mecca) while she had not yet done Tawaf of the Kaba (and after listening to her). The Prophet said, \"When the morning prayer is established, perform the Tawaf on your camel while the people are in prayer.\" So she did the same and did not offer the two Rakat of Tawaf until she came out of the Mosque.","by":"Narrated by Um Salama"},{"id":693,"text":"The Prophet reached Mecca, circumambulated the Kaba seven times and then offered a two Rakat prayer behind Maqam ibrahim. Then he went towards the Safa. Allah has said, \"Verily, in Allah's Apostle you have a good example.\" ","by":"Narrated by Ibn Umar"},{"id":694,"text":"Some people performed Tawaf (of the Kaba) after the morning prayer and then sat to listen to a preacher till sunrise, and then they stood up for the prayer. Then Aisha commented, \"Those people kept on sitting till it was the time in which the prayer is disliked and after that they stood up for the prayer.\"","by":"Narrated by Urwa from Aisha"},{"id":695,"text":"Heard the Prophet forbidding the offering of prayers at the time of sunrise and sunset.","by":"Narrated by Abdullah"},{"id":696,"text":"Abdul, Aziz bin Rufai Said, \"I saw Abdullah bin Az-Zubair performing Tawaf of the Kaba after the morning prayer then offering the two Rakat prayer.\" Abdul Aziz added, \"I saw Abdullah bin Az-Zubair offering a two Rakat prayer after the Asr prayer.\" He informed me that Aisha told him that the Prophet used to offer those two Rakat whenever he entered her house.\"","by":"Narrated by Abida bin Humaid"},{"id":697,"text":"Allah's Apostle performed Tawaf (of the Kaba) ending a camel (at that time the Prophet had foot injury). Whenever he came to the Corner (having the Black Stone) he would point out towards it with a thing in his hand and say, \"Allahu-Akbar.\"","by":"Narrated by Ibn Abbas"},{"id":698,"text":"I informed Allah's Apostle that I was sick. He said, \"Perform Tawaf (of the Kaba) while riding behind the people.\" So, I performed the Tawaf while Allah's Apostle was offering the prayer beside the Kaba and was reciting Surat-at-Tur.","by":"Narrated by Um Salama"},{"id":699,"text":"Al Abbas bin Abdul-Muttalib asked the permission of Allahs Apostle to let him stay in Mecca during the nights of Mina in order to provide the pilgrims with water to drink, so the Prophet permitted him. ","by":"Narrated by Ibn Umar"},{"id":700,"text":"Allah's Apostle came to the drinking place and asked for water. Al-Abbas said, \"O Fadl! Go to your mother and bring water from her for Allah's Apostle .\" Allah's Apostle said, \"Give me water to drink.\" Al-Abbas said, \"O Allahs Apostle! The people put their hands in it.\" Allah's Apostle again said, 'Give me water to drink. So, he drank from that water and then went to the Zam-zam (well) and there the people were offering water to the others and working at it (drawing water from the well). The Prophet then said to them, \"Carry on! You are doing a good deed.\" Then he said, \"Were I not afraid that other people would compete with you (in drawing water from Zam-zam), I would certainly take the rope and put it over this (i.e. his shoulder) (to draw water).\" On saying that the Prophet pointed to his shoulder.","by":"Narrated by Ibn Abbas"},{"id":701,"text":"I gave Zam-zam water to Allah's Apostle and he drank it while standing. 'Asia (a sub-narrator) said that 'Ikrima took the oath that on that day the Prophet had not been standing but riding a camel.","by":"Narrated by Ibn Abbas"},{"id":702,"text":"We set out with Allah's Apostle in the year of his Last Hajj and we mended (the Ihram) for 'Umra. Then the Prophet said, \"Whoever has a Hadi with him should assume Ihram for both Hajj and 'Umra, and should not finish it till he performs both of the them (Hajj and 'Umra).\" When we reached Mecca, I had my menses. When we had performed our Hajj, the Prophet sent me with 'Abdur-Rahman to Tan'im and I performed the 'Umra. The Prophet said, \"This is in lieu of your missed 'Umra.\" Those who had assumed Ihram for 'Umra performed Tawaf (between Safa and Marwa) and then finished their Ihram. And then they performed another Tawaf (between Safa and Marwa) after returning from Mina. And those who had assumed lhram for Hajj and 'Umra to get her ( Hajj-Qiran ) performed only one Tawaf (between Safa and Marwa).","by":"Narrated by 'Aisha"},{"id":703,"text":"'Abdullah bin 'Abdullah bin 'Umar and his riding animal entered the house of Ibn 'Umar. He (the son of Ibn 'Umar) said, \"I fear that this year a battle might take place between the people and you might be prevented from going to the Ka'ba. I suggest that you should stay here.\" Ibn Umar said, \"Once Allah's Apostle set out for the pilgrimage, and the pagans of Quraish intervened between him and the Ka'ba. So, if the people intervened between me and the Ka'ba, I would do the same as Allah's Apostle had done . . . \"Verily, in Allah's Apostle you have a good example.\" Then he added, \"I make you a witness that I have intended to perform Hajj along with 'Umra.\" After arriving at Mecca, Ibn 'Umar performed one Tawaf only (between Safa and Marwa).","by":"Narrated by Nafi'"},{"id":704,"text":"Ibn 'Umar intended to perform Hajj in the year when Al-Hajjaj attacked Ibn Az-Zubair. Somebody said to Ibn 'Umar, \"There is a danger of an impending war between them.\" Ibn 'Umar said, \"Verily, in Allah's Apostle you have a good example. (And if it happened as you say) then I would do the same as Allah's Apostle had done. I make you witness that I have decided to perform 'Umra.\" Then he set out and when he reached Al-Baida', he said, \"The ceremonies of both Hajj and 'Umra are similar. I make you witness that I have made Hajj compulsory for me along with 'Umra.\" He drove (to Mecca) a Hadi which he had bought from (a place called) Qudaid and did not do more than that. He did not slaughter the Hadi or finish his Ihram, or shave or cut short his hair till the day of slaughtering the sacrifices (10th Dhul-Hijja). Then he slaughtered his Hadi and shaved his head and considered the first Tawaf (of Safa and Marwa) as sufficient for Hajj and 'Umra. Ibn 'Umar said, \"Allah's Apostle did the same.\"","by":"Narrated by Nafi'"},{"id":705,"text":"I asked 'Urwa bin Az-Zubair (regarding the Hajj of the Prophet ). 'Urwa replied, \"Aisha narrated, 'When the Prophet reached Mecca, the first thing he started with was the ablution, then he performed Tawaf of the Ka'ba and his intention was not 'Umra alone (but Hajj and 'Umra together).' \" Later Abu Bakr I performed the Hajj and the first thing he started with was Tawaf of the Ka'ba and it was not 'Umra alone (but Hajj and 'Umra together). And then 'Umar did the same. Then 'Uthman performed the Hajj and the first thing he started with was Tawaf of the Ka'ba and it was not 'Umra alone. And then Muawiya and 'Abdullah bin 'Umar did the same. I performed Hajj with Ibn Az-Zubair and the first thing he started with was Tawaf of the Ka'ba and it was not 'Umra alone, (but Hajj and 'Umra together). Then I saw the Muhajirin (Emigrants) and Ansar doing the same and it was not 'Umra alone. And the last person I saw doing the same was Ibn 'Umar, and he did not do another 'Umra after finishing the first. Now here is Ibn 'Umar present amongst the people! They neither ask him nor anyone of the previous ones. And all these people, on entering Mecca, would not start with anything unless they had performed Tawaf of the Ka'ba, and would not finish their Ihram. And no doubt, I saw my mother and my aunt, on entering Mecca doing nothing before performing Tawaf of the Ka'ba, and they would not finish their lhram. And my mother informed me that she, her sister, Az-Zubair and such and such persons had assumed lhram for 'Umra and after passing their hands over the Corner (the Black Stone) (i.e. finishing their Umra) they finished their Ihram.\"","by":"Narrated by Muhammad bin 'AbdurRahman bin Nawfal Al-Qurashi"},{"id":706,"text":"I asked 'Aisha : \"How do you interpret the statement of Allah,. : Verily! (the mountains) As-Safa and Al-Marwa are among the symbols of Allah, and whoever performs the Hajj to the Ka'ba or performs 'Umra, it is not harmful for him to perform Tawaf between them (Safa and Marwa.) (2.158). By Allah! (it is evident from this revelation) there is no harm if one does not perform Tawaf between Safa and Marwa.\" 'Aisha said, \"O, my nephew! Your interpretation is not true. Had this interpretation of yours been correct, the statement of Allah should have been, 'It is not harmful for him if he does not perform Tawaf between them.' But in fact, this divine inspiration was revealed concerning the Ansar who used to assume lhram for worship ping an idol called \"Manat\" which they used to worship at a place called Al-Mushallal before they embraced Islam, and whoever assumed Ihram (for the idol), would consider it not right to perform Tawaf between Safa and Marwa. \r\n\r\nWhen they embraced Islam, they asked Allah's Apostle (p.b.u.h) regarding it, saying, \"O Allah's Apostle! We used to refrain from Tawaf between Safa and Marwa.\" So Allah revealed: 'Verily; (the mountains) As-Safa and Al-Marwa are among the symbols of Allah.' \" Aisha added, \"Surely, Allah's Apostle set the tradition of Tawaf between Safa and Marwa, so nobody is allowed to omit the Tawaf between them.\" Later on I ('Urwa) told Abu Bakr bin 'Abdur-Rahman (of 'Aisha's narration) and he said, 'i have not heard of such information, but I heard learned men saying that all the people, except those whom 'Aisha mentioned and who used to assume lhram for the sake of Manat, used to perform Tawaf between Safa and Marwa. \r\n\r\nWhen Allah referred to the Tawaf of the Ka'ba and did not mention Safa and Marwa in the Quran, the people asked, 'O Allah's Apostle! We used to perform Tawaf between Safa and Marwa and Allah has revealed (the verses concerning) Tawaf of the Ka'ba and has not mentioned Safa and Marwa. Is there any harm if we perform Tawaf between Safa and Marwa?' So Allah revealed: \"Verily As-Safa and Al-Marwa are among the symbols of Allah.\" Abu Bakr said, \"It seems that this verse was revealed concerning the two groups, those who used to refrain from Tawaf between Safa and Marwa in the Pre-lslamic Period of ignorance and those who used to perform the Tawaf then, and after embracing Islam they refrained from the Tawaf between them as Allah had enjoined Tawaf of the Ka'ba and did not mention Tawaf (of Safa and Marwa) till later after mentioning the Tawaf of the Ka'ba.'","by":"Narrated by 'Urwa"},{"id":707,"text":"Ibn 'Umar said, \"When Allah's Apostle performed the first Tawaf he did Ramal in the first three rounds and then walked in the remaining four rounds (of Tawaf of the Ka'ba), where as in performing Tawaf between Safa and Marwa he used to run in the midst of the rain-water passage,\" I asked Nafi', \"Did 'Abdullah (bin 'Umar) use to walk steadily on reaching the Yemenite Corner?\" He replied, \"No, unless people were crowded at the Corner; otherwise he would not leave it without touching it.\"","by":"Narrated by Nafi'"},{"id":708,"text":"We asked Ibn 'Umar whether a man who, while performing 'Umra, had performed Tawaf of the Ka'ba; and had not yet performed Tawaf between Safa and Marwa, could have sexual relation with his wife, Ibn 'Umar replied \"The Prophet (p.b.u.h) reached Mecca and performed the seven rounds (of Tawaf) of the Ka'ba and then offered a two-Rakat prayer behind Maqam ibrahim and then performed the seven rounds (of Tawaf) between Safa and Marwa.\" He added, \"Verily! In Allah's Apostle (p.b.u.h) you have a good example.\" We asked Jabir bin 'Abdullah (the same question) and he said, \"He (that man) should not come near (his wife) till he has completed Tawaf between Safa and Marwa.\" ","by":"Narrated by 'Amr bin Dinar"},{"id":709,"text":"I heard Ibn 'Umar saying, \"The Prophet arrived at Mecca and performed Tawaf of the Ka'ba and then offered a two-Rakat prayer and then performed Tawaf between Safa and Marwa.\" Ibn 'Umar then recited (the verse): \"Verily! In Allah's Apostle (p.b.u.h) you have a good example. \"","by":"Narrated by 'Amr bin Dinar"},{"id":710,"text":"I asked Anas bin Malik: \"Did you use to dislike to perform Tawaf between Safa and Marwa?\" He said, \"Yes, as it was of the ceremonies of the days of the Pre-lslamic period of ignorance, till Allah revealed: 'Verily! (The two mountains) As-Safa and Al-Marwa are among the symbols of Allah. It is therefore no sin for him who performs the pilgrimage to the Ka'ba, or performs 'Umra, to perform Tawaf between them.' \" (2.158) ","by":"Narrated by 'Asim"},{"id":711,"text":"Allah's Apostle performed Tawaf of the Ka'ba and the Sa'i of Safa and Marwa so as to show his strength to the pagans.","by":"Narrated by Ibn Abbas"},{"id":712,"text":"I was menstruating when I reached Mecca. So, I neither performed Tawaf of the Ka'ba, nor the Tawaf between Safa and Marwa. Then I informed Allah's Apostle about it. He replied, \"Perform all the ceremonies of Hajj like the other pilgrims, but do not perform Tawaf of the Ka'ba till you get clean (from your menses).\" ","by":"Narrated by 'Aisha"},{"id":713,"text":"The Prophet and his companions assumed Ihram for Hajj and none except the Prophet (p.b.u.h) and Talha had the Hadi (sacrifice) with them. 'Ali arrived from Yemen and had a Hadi with him. 'Ali said, \"I have assumed Ihram for what the Prophet has done.\" The Prophet ordered his companions to perform the 'Umra with the lhram which they had assumed, and after finishing Tawaf (of Ka'ba, Safa and Marwa) to cut short their hair, and to finish their lhram except those who had Hadi with them. They (the people) said, \"How can we proceed to Mina (for Hajj) after having sexual relations with our wives?\" When that news reached the Prophet he said, \"If I had formerly known what I came to know lately, I would not have brought the Hadi with me. Had there been no Hadi with me, I would have finished the state of lhram.\" 'Aisha got her menses, so she performed all the ceremonies of Hajj except Tawaf of the Ka'ba, and when she got clean (from her menses), she performed Tawaf of the Ka'ba. She said, \"O Allah's Apostle! (All of you) are returning with the Hajj and 'Umra, but I am returning after performing Hajj only.\" So the Prophet ordered 'Abdur-Rahman bin Abu Bakr to accompany her to Tan'im and thus she performed the 'Umra after the Hajj.","by":"Narrated by Jabir bin 'Abdullah"},{"id":714,"text":"(On 'Id) We used to forbid our virgins to go out (for 'Id prayer). A lady came and stayed at the Palace of Bani Khalaf. She mentioned that her sister was married to one of the companions of Allah's Apostle who participated in twelve Ghazawats along with Allah's Apostle and her sister was with him in six of them. She said, \"We used to dress the wounded and look after the patients.\" She (her sister) asked Allah's Apostle , \"Is there any harm for a woman to stay at home if she doesn't have a veil?\" He said, \"She should cover herself with the veil of her companion and she should take part in the good deeds and in the religious gatherings of the believers.\" When Um 'Atiyya came, I asked her. \"Did you hear anything about that?\" Um 'Atiyya said, \"Bi Abi\" and she never mentioned the name of Allah's Apostle without saying \"Bi Abi\" (i.e. 'Let my father be sacrificed for you'). We asked her, \"Have you heard Allah's Apostle saying so and so (about women)?\" She replied in the affirmative and said, \"Let my father be sacrificed for him. He told us that unmarried mature virgins who stay often screened or unmarried young virgins and mature girls who stay often screened should come out and take part in the good deeds and in the religious gatherings of the believers. But the menstruating women should keep away from the Musalla (praying place).\" I asked her, \"The menstruating women?\" She replied, \"Don't they present themselves at 'Arafat and at such and such places?\"","by":"Narrated by Hafsa"},{"id":715,"text":"I asked Anas bin Malik, \"Tell me what you remember from Allah's Apostle (regarding these questions): Where did he offer the Zuhr and 'Asr prayers on the day of Tarwiya (8th day of Dhul-Hajja)?\" He relied, \"(He offered these prayers) at Mina.\" I asked, \"Where did he offer the 'Asr prayer on the day of Nafr (i.e. departure from Mina on the 12th or 13th of Dhul-Hijja)?\" He replied, \"At Al-Abtah,\" and then added, \"You should do as your chiefs do.\"","by":"Narrated by 'Abdul 'Aziz bin Rufai"},{"id":716,"text":"I went out to Mina on the day of Tarwiya and met Anas going on a donkey. I asked him, \"Where did the Prophet offer the Zuhr prayer on this day?\" Anas replied, \"See where your chiefs pray and pray similarly.\" ","by":"Narrated by 'Abdul 'Aziz"},{"id":717,"text":"Allah's Apostle offered a two-Rakat prayer at Mina. Abu Bakr, 'Umar and 'Uthman, (during the early years of his caliphate) followed the same practice.","by":"Narrated by 'Abdullah bin 'Umar "},{"id":718,"text":"The Prophet led us in a two-Rakat prayer at Mina although our number was more than ever and we were in better security than ever. ","by":"Narrated by Haritha bin Wahab Al-Khuza'i"},{"id":719,"text":"I offered (only a) two Rakat prayer with the Prophet (at Mina), and similarly with Abu Bakr and with 'Umar, and then you d offered in opinions. Wish that I would be lucky enough to have two of the four Rakat accepted (by Allah).","by":"Narrated by 'Abdullah bin Masud"},{"id":720,"text":"The people doubted whether the Prophet was observing the fast on the Day of 'Arafat, so I sent something for him to drink and he drank it.","by":"Narrated by Um Al-Fadl"},{"id":721,"text":"I asked Anas bin Malik while we were proceeding from Mina to 'Arafat, \"What do you use to do on this day when you were with Allah's Apostle ?\" Anas said, \"Some of us used to recite Talbiya and nobody objected to that, and others used to recite Takbir and nobody objected to that.\" ","by":"Narrated by Muhammad bin Abu Bakr Al-Thaqafi"},{"id":722,"text":"'Abdul Malik wrote to Al-Hajjaj that he should not differ from Ibn 'Umar during Hajj. On the Day of 'Arafat, when the sun declined at midday, Ibn 'Umar came along with me and shouted near Al-Hajjaj's cotton (cloth) tent. Al-Hajjaj came Out, wrapping himself with a waist-sheet dyed with safflower, and said, \"O Abu Abdur-Rahman! What is the matter?\" He said, If you want to follow the Sunna (the tradition of the Prophet (p.b.u.h) ) then proceed (to 'Arafat).\" Al-Hajjaj asked, \"At this very hour?\" Ibn 'Umar said, \"Yes.\" He replied, \"Please wait for me till I pour some water over my head (i.e. take a bath) and come out.\" Then Ibn 'Umar dismounted and waited till Al-Hajjaj came out. So, he (Al-Hajjaj) walked in between me and my father (Ibn 'Umar). I said to him, \"If you want to follow the Sunna then deliver a brief sermon and hurry up for the stay at 'Arafat.\" He started looking at 'Abdullah (Ibn 'Umar) (inquiringly), and when 'Abdullah noticed that, he said that he had told the truth.","by":"Narrated by Salim"},{"id":723,"text":"On the day of 'Arafat, some people who were with me, differed about the fasting of the Prophet (p.b.u.h) some said that he was fasting while others said that he was not fasting. So I sent a bowl full of milk to him while he was riding his camel, and he drank that milk. ","by":"Narrated by Um Al-Fadl bint Al Harith"},{"id":724,"text":"'Abdul-Malik bin Marwan wrote to Al-Hajjaj that he should follow 'Abdullah bin 'Umar in all the ceremonies of Hajj. So when it was the Day of 'Arafat (9th of Dhul-Hajja), and after the sun has deviated or has declined from the middle of the sky, I and Ibn 'Umar came and he shouted near the cotton (cloth) tent of Al-Hajjaj, \"Where is he?\" Al-Hajjaj came out. Ibn 'Umar said, \"Let us proceed (to 'Arafat).\" Al-Hajjaj asked, \"Just now?\" Ibn 'Umar replied, \"Yes.\" Al-Hajjaj said, \"Wait for me till I pour water on me (i.e. take a bath).\" So, Ibn 'Umar dismounted (and waited) till Al-Hajjaj came out. He was walking between me and my father. I informed Al-Hajjaj, \"If you want to follow the Sunna today, then you should shorten the sermon and then hurry up for the stay (at 'Arafat).\" Ibn 'Umar said, \"He (Salim) has spoken the truth.\"","by":"Narrated by Salim bin 'Abdullah bin 'Umar"},{"id":725,"text":"My father said, \"(Before Islam) I was looking for my camel ..\" The same narration is told by a different sub-narrator. Jubair bin Mut'im said, \"My camel was lost and I went out in search of it on the day of 'Arafat, and I saw the Prophet standing in 'Arafat. I said to myself: By Allah he is from the Hums (literally: strictly religious, Quraish were called so, as they used to say, 'We are the people of Allah we shall not go out of the sanctuary). What has brought him here?\"","by":"Narrated by Muhammad bin Jubair bin Mut'im"},{"id":726,"text":"During the pre-lslamic period of Ignorance, the people used to perform Tawaf of the Ka'ba naked except the Hums; and the Hums were Quraish and their offspring. The Hums used to give clothes to the men who would perform the Tawaf wearing them; and women (of the Hums) used to give clothes to the women who would perform the Tawaf wearing them. Those to whom the Hums did not give clothes would perform Tawaf round the Ka'ba naked. Most of the people used to go away (disperse) directly from 'Arafat but they (Hums) used to depart after staying at Al-Muzdalifa. 'Urwa added, \"My father narrated that 'Aisha had said, 'The following verses were revealed about the Hums: Then depart from the place whence all the people depart--(2.199) 'Urwa added, \"They (the Hums) used to stay at Al-Muzdalifa and used to depart from there (to Mina) and so they were sent to 'Arafat (by Allah's order).\"","by":"Narrated by 'Urwa"},{"id":727,"text":"Usama was asked in my presence, \"How was the speed of (the camel of) Allah's Apostle while departing from 'Arafat during the Hajjatul Wada?\" Usama replied, \"The Prophet proceeded on with a modest pace, and when there was enough space he would (make his camel) go very fast.\" ","by":"Narrated by 'Urwa"},{"id":728,"text":"As soon as the Prophet departed from 'Arafat, he went towards the mountain pass, and there he answered the call of) the prayer is ahead of you (i.e. at asked, \"O Allah's Apostle! Will you offer the prayer here?\" He replied, \"(The place of) the prayer is ahead of you (i.e. at Al-Muzdalifa).\"","by":"Narrated by Usama bin Zaid"},{"id":729,"text":"'Abdullah bin 'Umar used to offer the Maghrib and 'Isha' prayers together at Jam' (Al-Muzdalifa). But he used to pass by that mountain pass where Allah's Apostle went, and he would enter it and answer the call of nature and perform ablution, and would not offer any prayer till he had prayed at Jam.'","by":"Narrated by Nafi'"},{"id":730,"text":"Rode behind Allah's Apostle from 'Arafat and when Allah's Apostle reached the mountain pass on the left side which is before Al-Muzdalifa he made his camel kneel and then urinated, and then I poured water for his ablution. He performed light ablution and then I said to him: (Is it the time for) the prayer, O Allah's Apostle!\" He replied, \"The (place of) prayer is ahead of you (i.e. at Al-Muzdalifa).\" So Allah's Apostle rode till he reached Al-Muzdalifa and then he offered the prayer (there) . Then in the morning (10th Dhul-Hijja) Al-Faql (bin Abbas) rode behind Allah's Apostle. Kuraib, (a sub-narrator) said that 'Abdullah bin Abbas narrated from Al-Fadl, \"Allah's Apostle (p.b.u.h) kept on reciting Talbiya (during the journey) till he reached the Jamra.\" (Jamrat-al-Aqaba)","by":"Narrated by Usama bin Zaid"},{"id":731,"text":"I proceeded along with the Prophet on the day of 'Arafat (9th Dhul-Hijja). The Prophet heard a great hue and cry and the beating of camels behind him. So he beckoned to the people with his lash, \"O people! Be quiet. Hastening is not a sign of righteousness.\"","by":"Narrated by Ibn Abbas. "},{"id":732,"text":"Allah's Apostle proceeded from 'Arafat and dismounted at the mountainous pass and then urinated and performed a light ablution. I said to him, \"(Shall we offer) the prayer?\" He replied, \"The prayer is ahead of you (i.e. at Al-Muzdalifa).\" When he came to Al-Muzdalifa, he performed a perfect ablution. Then Iqama for the prayer was pronounced and he offended the Maghrib prayer and then every person made his camel kneel at his place; and then Iqama for the prayer was pronounced and he offered the ('Isha') prayer and he did not offer any prayer in between them (i.e. Maghrib and 'Isha' prayers).","by":"Narrated by Usama bin Zaid"},{"id":733,"text":"The Prophet offered the Maghrib and 'Isha' prayers together at Jam' (i.e. Al-Muzdalifa) with a separate Iqama for each of them and did not offer any optional prayer in between them or after each of them.","by":"Narrated by Ibn 'Umar"},{"id":734,"text":"Allah's Apostle coffered the Maghrib and 'Isha' prayers together at Al-Muzdalifa.","by":"Narrated by Abu Aiyub Al-Ansari "},{"id":735,"text":"'Abdullah;- performed the Hajj and we reached Al-Muzdalifa at or about the time of the 'Isha' prayer. He ordered a man to pronounce the Adhan and Iqama and then he offered the Maghrib prayer and offered two Rakat after it. Then he asked for his supper and took it, and then, I think, he ordered a man to pronounce the Adhan and Iqama (for the 'isha' prayer). ('Amr, a sub-narrator said: The intervening statement 'I think', was said by the sub-narrator Zuhair) (i.e. not by 'Abdu-Rahman). Then 'Abdullah offered two Rakat of 'Isha' prayer. When the day dawned, 'Abdullah said, \"The Prophet never offered any prayer at this hour except this prayer at this time and at this place and on this day.\" 'Abdullah added, \"These two prayers are shifted from their actual times -- the Maghrib prayer (is offered) when the people reached Al-Muzdalifa and the Fajr (morning) prayer at the early dawn.\" 'Abdullah added, \"I saw the Prophet doing that.\"","by":"Narrated by 'Abdur-Rahman bin Yazid"},{"id":736,"text":"'Abdullah bin 'Umar used to send the weak among his family early to Mina. So they used to depart from Al-Mash'ar Al-Haram (that is Al-Muzdalifa) at night (when the moon had set) and invoke Allah as much as they could, and then they would return (to Mina) before the Imam had started from Al-Muzdalifa to Mina. So some of them would reach Mina at the time of the Fajr prayer and some of them would come later. When they reached Mina they would throw pebbles on the Jamra (Jamrat-al-Aqaba) Ibn 'Umar used to say, \"Allah's Apostle gave the permission to them (weak people) to do so.\"","by":"Narrated by Salim"},{"id":737,"text":"Allah's Apostle had sent me from Jam' (i.e. Al-Muzdalifa) at night. ","by":"Narrated by Ibn Abbas "},{"id":738,"text":"I as among those whom the Prophet sent on the night of Al-Muzdalifa early being among the weak members of his family.","by":"Narrated by Ibn Abbas"},{"id":739,"text":"(the slave of Asma') During the night of Jam', Asma' got down at Al-Muzdalifa and stood up for (offering) the prayer and offered the prayer for some time and then asked, \"O my son! Has the moon set?\" I replied in the negative and she again prayed for another period and then asked, \"Has the moon set?\" I replied, \"Yes.\" So she said that we should set out (for Mina), and we departed and went on till she threw pebbles at the Jamra (Jamrat-al-Aqaba) and then she returned to her dwelling place and offered the morning prayer. I asked her, \"O you! I think we have come (to Mina) early in the night.\" She replied, \"O my son! Allah's Apostle gave permission to the women to do so.\"","by":"Narrated by 'Abdullah"},{"id":740,"text":"Sauda asked the permission of the Prophet to leave earlier at the night of Jam', and she was a fat and very slow woman. The Prophet gave her permission.","by":"Narrated by 'Aisha "},{"id":741,"text":"We got down at Al-Muzdalifa and Sauda asked the permission of the Prophet to leave (early) before the rush of the people. She was a slow woman and he gave her permission, so she departed (from Al-Muzdalifa) before the rush of the people. We kept on staying at Al-Muzdalifa till dawn, and set out with the Prophet but (I suffered so much that) I wished I had taken the permission of Allah's Apostle as Sauda had done, and that would have been dearer to me than any other happiness.","by":"Narrated by 'Aisha"},{"id":742,"text":"I never saw the Prophet offering any prayer not at its stated time except two; he prayed the Maghrib and the 'Isha' together and he offered the morning prayer before its usual time.","by":"Narrated by Abdullah"},{"id":743,"text":"I went out with 'Abdullah , to Mecca and when we proceeded to am' he offered the two prayers (the Maghrib and the 'Isha') together, making the Adhan and Iqama separately for each prayer. He took his supper in between the two prayers. He offered the Fajr prayer as soon as the day dawned. Some people said, \"The day had dawned (at the time of the prayer),\" and others said, \"The day had not dawned.\" 'Abdullah then said, \"Allah's Apostle said, 'These two prayers have been shifted from their stated times at this place only (at Al-Muzdalifa); first: The Maghrib and the 'Isha'. So the people should not arrive at Al-Muzdalifa till the time of the 'Isha' prayer has become due. The second prayer is the morning prayer which is offered at this hour.' \" Then 'Abdullah stayed there till it became a bit brighter. He then said, \"If the chief of the believers hastened onwards to Mina just now, then he had indeed followed the Sunna.\" I do not know which proceeded the other, his ('Abdullah's) statement or the departure of 'Uthman . Abdullah was reciting Talbiya till he threw pebbles at the Jamrat-al-'Aqaba on the Day of Nahr (slaughtering) (that is the 10th of Dhul-Hijja).","by":"Narrated by 'Abdur-Rahman bin Yazid"},{"id":744,"text":"I saw 'Umar, offering the Fajr (morning) prayer at Jam'; then he got up and said, \"The pagans did not use to depart (from Jam') till the sun had risen, and they used to say, 'Let the sun shine on Thabir (a mountain).' But the Prophet contradicted them and departed from Jam' before sunrise.\"","by":"Narrated by 'Amr bin Maimun"},{"id":745,"text":"The Prophet made Al-Faql ride behind him, and Al-Fadl informed that he (the Prophet ) kept on reciting Talbiya till he did the Rami of the Jamra. (Jamrat-al-Aqaba.)","by":"Narrated by Ibn Abbas"},{"id":746,"text":"Ibn Abbas said, \"Usama bin Zaid rode behind the Prophet from 'Arafat to Al-Muzdalifa; and then from Al-Muzdalifa to Mina, Al-Fadl rode behind him.\" He added, \"Both of them (Usama and Al-Fadl) said, 'The Prophet was constantly reciting Talbiya till he did Rami of the Jamarat-al-'Aqaba.\"","by":"Narrated by 'Ubaidullah bin 'Abdullah"},{"id":747,"text":"I asked Ibn Abbas about Hajj-at-Tamattu'. He ordered me to perform it. I asked him about the Hadi (sacrifice). He said, \"You have to slaughter a camel, a cow or a sheep, or you may share the Hadi with the others.\" It seemed that some people disliked it (Hajj-at-Tamattu). I slept and dreamt as if a person was announcing: \"Hajj Mabrur and accepted Mut'ah (Hajj-At-Tamattu')\" I went to Ibn Abbas and narrated it to him. He said, \"Allah is Greater. (That was) the tradition of Abu Al-Qasim (i.e. Prophet). Narrated Shu'ba that the call in the dream was. \"An accepted 'Umra and Hajj-Mabrur. \"","by":"Narrated by Abu Jamra"},{"id":748,"text":"Allah's Apostle (p.b.u.h) saw a man driving his Badana (sacrificial camel). He said, \"Ride on it.\" The man said, \"It is a Badana.\" The Prophet said, \"Ride on it.\" He (the man) said, \"It is a Badana.\" The Prophet said, \"Ride on it.\" And on the second or the third time he (the Prophet ) added, \"Woe to you.\"","by":"Narrated by Abu Huraira' "},{"id":749,"text":"The Prophet saw a man driving a Badana. He said, \"Ride on it.\" The man replied, \"It is a Badana.\" The Prophet said (again), \"Ride on it.\" He (the man) said, \"It is a Badana.\" The Prophet said thrice, \"Ride on it.\"","by":"Narrated by Anas"},{"id":750,"text":"During the last Hajj (Hajj-al-Wada') of Allah's Apostle he performed 'Umra and Hajj. He drove a Hadi along with him from Dhul-Hulaifa. Allah's Apostle started by assuming Ihram for'Umra and Hajj. And the people, too, performed the 'Umra and Hajj along with the Prophet. Some of them brought the Hadi and drove it along with them, while the others did not. So, when the Prophet arrived at Mecca. he said to the people, \"Whoever among you has driven the Hadi, should not finish his Ihram till he completes his Hajj. And whoever among you has not (driven) the Hadi with him, should perform Tawaf of the Ka'ba and the Tawaf between Safa and Marwa, then cut short his hair and finish his Ihram, and should later assume Ihram for Hajj; but he must offer a Hadi (sacrifice); and if anyone cannot afford a Hadi, he should fast for three days during the Hajj and seven days when he returns home. The Prophet performed Tawaf of the Ka'ba on his arrival (at Mecca); he touched the (Black Stone) corner first of all and then did Ramal (fast walking with moving of the shoulders) during the first three rounds round the Ka'ba, and during the last four rounds he walked. After finishing Tawaf of the Ka'ba, he offered a two Rakat prayer at Maqam Ibrahim, and after finishing the prayer he went to Safa and Marwa and performed seven rounds of Tawaf between them and did not do any deed forbidden because of Ihram, till he finished all the ceremonies of his Hajj and sacrificed his Hadi on the day of Nahr (10th day of Dhul-Hijja). He then hastened onwards (to Mecca) and performed Tawaf of the Ka'ba and then everything that was forbidden because of Ihram became permissible. Those who took and drove the Hadi with them did the same as Allah's Apostle did.","by":"Narrated by Ibn 'Umar"},{"id":751,"text":"'Abdullah (bin 'Abdullah) bin 'Umar said to his father, \"Stay here, for I am afraid that it (affliction between Ibn Zubair and Al-Hajjaj) might prevent you from reaching the Ka'ba.\" Ibn 'Umar said, \"(In this case) I would do the same as Allah's Apostle did, and Allah has said, 'Verily, in Allah's Apostle, you have a good example (to follow).' So, I make you, people, witness that I have made 'Umra compulsory for me.\" So he assumed lhram for'Umra. Then he went out and when he reached Al-Baida', he assumed Ihram for Hajj and 'Umra (together) and said, \"The conditions (requisites) of Hajj and 'Umra are the same.\" He, then brought a Hadi from Qudaid. Then he arrived (at Mecca) and performed Tawaf (between Safa and Marwa) once for both Hajj and 'Umra and did not finish the lhram till he had finished both Hajj and 'Umra.","by":"Narrated by Nafi'"},{"id":752,"text":"The Prophet set out from Medina with over one thousand of his companions (at the time of the Treaty of Hudaibiya) and when they reached Dhul-Hulaifa, the Prophet garlanded his Hadi and marked it and assumed Ihram for'Umra.","by":"Narrated by Al-Miswar bin Makhrama and Marwan"},{"id":753,"text":"I twisted with my own hands the garlands for the Budn of the Prophet who garlanded and marked them, and then made them proceed to Mecca; Yet no permissible thing was regarded as illegal for him then.","by":"Narrated by 'Aisha"},{"id":754,"text":"I said, \"O Allah's Apostle! What is wrong with the people, they have finished their Ihram but you have not?\" He said, \"I matted my hair and I have garlanded my Hadi, so I will not finish my Ihram till I finished my Hajj .\"","by":"Narrated by Hafsa"},{"id":755,"text":"Allah's Apostle used to send the Hadi from Medina and I used to twist the garlands for his Hadi and he did not keep away from any of these things which a Muhrim keeps away from.","by":"Narrated by 'Aisha"},{"id":756,"text":"I twisted the garlands for the Hadis of the Prophet and then he marked and garlanded them (or I garlanded them) and then made them proceed to the Ka'ba but he remained in Medina and no permissible thing was regarded as illegal for him then.","by":"Narrated by 'Aisha"},{"id":757,"text":"That 'Amra bint 'Abdur-Rahman had told him, \"Zaid bin Abu Sufyan wrote to 'Aisha that 'Abdullah bin Abbas had stated, 'Whoever sends his Hadi (to the Ka'ba), all the things which are illegal for a (pilgrim) become illegal for that person till he slaughters it (i.e. till the 10th of Dhul-Hijja).' \" 'Amra added, 'Aisha said, 'It is not like what Ibn Abbas had said: I twisted the garlands of the Hadis of Allah's Apostle with my own hands. Then Allah's Apostle put them round their necks with his own hands, sending them with my father; Yet nothing permitted by Allah was considered illegal for Allah's Apostle till he slaughtered the Hadis.' \"","by":"Narrated by 'Abdullah bin Abu Bakr bin 'Amr bin Hazm"},{"id":758,"text":"Once the Prophet sent sheep as Hadi.","by":"Narrated by 'Aisha"},{"id":759,"text":"I used to make the garlands for (the Hadis of) the Prophet and he would garland the sheep (with them) and would stay with his family as a non-Muhrim.","by":"Narrated by 'Aisha"},{"id":760,"text":"I used to twist the garlands for the sheep of the Prophet and he would send them (to the Ka'ba), and stay as a non-Muhrim.","by":"Narrated by Aisha"},{"id":761,"text":"I twisted (the garlands) for the Hadis of the Prophet before he assumed Ihram.","by":"Narrated by 'Aisha"},{"id":762,"text":"I twisted the garlands of the Hadis from the wool which was with me.","by":"Narrated by 'Aisha"},{"id":763,"text":"Abu Huraira said, \"The Prophet saw a man driving a Badana (sacrificial camel). The Prophet (p.b.u.h) said (to him), 'Ride on it.' He replied, 'It is a Badana.' The Prophet again said, 'Ride on it!' Abu Huraira added, 'Then I saw that man riding it, showing obedience to the Prophet (p.b.u.h), and a shoe was (hanging) from its neck.' \"","by":"Narrated by 'Ikrima"},{"id":764,"text":"From the Prophet: (as above).","by":"Narrated by Abu Huraira"},{"id":765,"text":"Allah's Apostle ordered me to give in charity the skin and the coverings of the Budn which I had slaughtered.","by":"Narrated by 'Ali"},{"id":766,"text":"Ibn 'Umar intended to perform Hajj in the year of the Hajj of Al-Harawriya during the rule of Ibn Az-Zubair. Some people said to him, \"It is very likely that there will be a fight among the people, and we are afraid that they might prevent you (from performing Hajj).\" He replied, \"Verily, in Allah's Apostle there is a good example for you (to follow). In this case I would do the same as he had done. I make you witness that I have intended to perform 'Umra.\" When he reached Al-Baida', he said, \"The conditions for both Hajj and 'Umra are the same. I make you witness that I have intended to perform Hajj along with 'Umra.\" After that he took a garlanded Hadi (to Mecca) which he bought (on the way). When he reached (Mecca), he performed Tawaf of the Ka'ba and of Safa (and Marwa) and did not do more than that. He did not make legal for himself the things which were illegal for a Muhrim till it was the Day of Nahr (sacrifice), when he had his head shaved and slaughtered (the sacrifice) and considered sufficient his first Tawaf (between Safa and Marwa), as a (Sa'i) for his Hajj and 'Umra both. He then said, \"The Prophet used to do like that.\"","by":"Narrated by Nafi'"},{"id":767,"text":"I heard 'Aisha saying, \"Five days before the end of Dhul-Qa'ada we set out from Medina in the company of Allah's Apostle with the intention of performing Hajj only. When we approached Mecca, Allah's Apostle ordered those who had no Hadi with them to finish their lhram after performing Tawaf of the Ka'ba and (Sa'i) and between Safa and Marwa.\" 'Aisha added, \"On the day of Nahr (slaughtering of sacrifice) beef was brought to us. I asked, 'What is this?' The reply was, 'Allah's Apostle (p.b.u.h) has slaughtered (sacrifices) on behalf of his wives.' \"","by":"Narrated by 'Amra bint 'AbdurRahman"},{"id":768,"text":"'Abdullah (bin 'Umar), used to slaughter (his sacrifice) at the Manhar. ('Ubaidullah, a sub-narrator said, \"The Manhar of Allah's Apostle.\")","by":"Narrated by Nafi'"},{"id":769,"text":"Ibn 'Umar used to send his Hadi from Jam' (to Mina) in the last third of the night with the pilgrims amongst whom there were free men and slaves, till it was taken into the Manhar (slaughtering place) of the Prophet.","by":"Narrated by Nafi'"},{"id":770,"text":"The narration of Anas abridged, saying, \"The Prophet slaughtered seven Budn (camels) while standing, with his own hands. On the day of 'Id-ul-Adha he slaughtered (sacrificed) two horned rams, black and white in color. ","by":"Narrated by Sahl bin Bakkar"},{"id":771,"text":"I saw Ibn 'Umar passing by a man who had made his Badana sit to slaughter it. Ibn 'Umar said, \"Slaughter it while it is standing with one leg tied up as is the tradition of Muhammad.\"","by":"Narrated by Zaid bin Jubair"},{"id":772,"text":"The Prophet offered four Rakat of Zuhr prayer at Medina; and two Rakat of 'Asr prayer at Dhul-hulaifa and spent the night there and when (the day) dawned, he mounted his Mount and started saying, \"None has the right to be worshipped but Allah, and Glorified be Allah.\" When he reached Al-Baida' he recited Talbiya for both Hajj and 'Umra. And when he arrived at Mecca, he ordered them (his companions) to finish their Ihram. The Prophet slaughtered seven Budn (camel) with his own hands while the camels were standing He also sacrificed two horned rams (black and white in color) at Medina. ","by":"Narrated by Anas "},{"id":773,"text":"The Prophet (p.b.u.h) offered four Rakat of Zuhr prayer at Medina and two Rakat of 'Asr prayer at Dhul-Hulaifa. Narrated Aiyub: \"A man said: Anas said, \"Then he (the Prophet passed the night there till dawn and then he offered the morning (Fajr) prayer, and mounted his Mount and when it arrived at Al-Baida' he assumed Ihram for both 'Umra and Hajj.\"","by":"Narrated by Anas bin Malik"},{"id":774,"text":"The Prophet sent me to supervise the (slaughtering of) Budn (Hadi camels) and ordered me to distribute their meat, and then he ordered me to distribute their covering sheets and skins. 'All added, \"The Prophet ordered me to supervise the slaughtering (of the Budn) and not to give anything (of their bodies) to the butcher as wages for slaughtering.\"","by":"Narrated by 'Ali"},{"id":775,"text":"The Prophet ordered me to supervise the (slaughtering) of Budn (Hadi camel) and to distribute their meat, skins and covering sheets in charity and not to give anything (of their bodies) to the butcher as wages for slaughtering.","by":"Narrated by 'Ali"},{"id":776,"text":"The Prophet offered one hundred Budn as Hadi and ordered me to distribute their meat (in charity) and I did so. Then he ordered me to distribute their covering sheets in charity and I did so. Then he ordered me to distribute their skins in charity and I did so.","by":"Narrated by 'Ali"},{"id":777,"text":"'Ata' said, \"I heard Jabir bin 'Abdullah saying, 'We never ate the meat of the Budn for more than three days of Mina. Later, the Prophet gave us permission by saying: 'Eat and take (meat) with you. So we ate (some) and took (some) with us.' \" I asked 'Ata', \"Did Jabir say (that they went on eating the meat) till they reached Medina?\" 'Ata' replied, \"No.\"","by":"Narrated by Ibn Juraij"},{"id":778,"text":"I heard 'Aisha saying, \"We set out (from Medina) along with Allah's Apostle five days before the end of Dhul-Qa'da with the intention of performing Hajj only. When we approached Mecca, Allah's Apostle ordered those who had no Hadi along with them to finish the lhram after performing Tawaf of the Ka'ba, (Safa and Marwa). 'Aisha added, \"Beef was brought to us on the Day of Nahr and I said, 'What is this?' Somebody said, 'The Prophet has slaughtered (cows) on behalf of his wives.' \"","by":"Narrated by 'Amra"},{"id":779,"text":"The Prophet was asked about a person who had his head shaved before slaughtering (his Hadi) (or other similar ceremonies of Hajj). He replied, \"There is no harm, there is no harm.\"","by":"Narrated by Ibn Abbas"},{"id":780,"text":"A man said to the Prophet \"I performed the Tawaf-al-Ifada before the Rami (throwing pebbles at the Jamra).\" The Prophet replied, \"There is no harm.\" The man said, \"I had my head shaved before slaughtering.\" The Prophet replied, \"There is no harm.\" He said, \"I have slaughtered the Hadi before the Rami.\" The Prophet replied, \"There is no harm.\" ","by":"Narrated by Ibn Abbas"},{"id":781,"text":"The Prophet was asked by a man who said, \"I have done the Rami in the evening.\" The Prophet replied, \"There is no harm in it.\" Another man asked, \"I had my head shaved before the slaughtering.\" The Prophet replied, \"There is no harm in it.\"","by":"Narrated by Ibn Abbas"},{"id":782,"text":"I came upon Allah's Apostle when he was at Al-Bat-ha. He asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked, \"For what have you assumed lhram?\" I replied,\" I have assumed Ihram with the same intention as that of the Prophet .\" The Prophet said, \"You have done well! Go and perform Tawaf round the Ka'ba and between Safa and Marwa.\" Then I went to one of the women of Bani Qais and she took out lice from my head. Later, I assumed the Ihram for Hajj. So, I used to give this verdict to the people till the caliphate of 'Umar. When I told him about it, he said, \"If we take (follow) the Holy Book, then it orders us to complete Hajj and 'Umra (Hajj-at-Tamattu') and if we follow the tradition of Allah's Apostle then Allah's Apostle did not finish his lhram till the Hadi had reached its destination (had been slaughtered). (i.e. Hajj-al-Qiran). (See Hadith No. 630)","by":"Narrated by Abu Musa"},{"id":783,"text":"Hafsa said, \"O Allah's Apostle! What is wrong with the people; they finished their Ihram after performing 'Umra, but you have not finished it after your 'Umra?\" He replied, \"I matted my hair and have garlanded my Hadi. So, I cannot finish my Ihram till I slaughter (my Hadi). \" ","by":"Narrated by Ibn 'Umar"},{"id":784,"text":"Allah's Apostle (p.b.u.h) (got) his head shaved after performing his Hajj. ","by":"Narrated by Ibn 'Umar"},{"id":785,"text":"Allah's Apostle said, \"O Allah! Be merciful to those who have their head shaved.\" The people said, \"O Allah's Apostle! And (invoke Allah for) those who get their hair cut short.\" The Prophet said, \"O Allah! Be merciful to those who have their head shaved.\" The people said, \"O Allah's Apostle! And those who get their hair cut short.\" The Prophet said (the third time), \"And to those who get their hair cut short.\" Nafi' said that the Prophet had said once or twice, \"O Allah! Be merciful to those who get their head shaved,\" and on the fourth time he added, \"And to those who have their hair cut short.\"","by":"Narrated by Abdullah bin Umar"},{"id":786,"text":"Allah's Apostle said, \"O Allah! Forgive those who get their heads shaved.\" The people asked. \"Also those who get their hair cut short?\" The Prophet said, \"O Allah! Forgive those who have their heads shaved.\" The people said, \"Also those who get their hair cut short?\" The Prophet (invoke Allah for those who have their heads shaved and) at the third time said, \"also (forgive) those who get their hair cut short.\"","by":"Narrated by Abu Huraira"},{"id":787,"text":"The Prophet and some of his companions got their heads shaved and some others got their hair cut short. Narrated Muawiya: I cut short the hair of Allah's Apostle with a long blade.","by":"Narrated by 'Abdullah"},{"id":788,"text":"When the Prophet came to Mecca, he ordered his Companions to perform Tawaf round the Ka'ba and between Safa and Marwa, to finish their Ihram and get their hair shaved off or cut short.","by":"Narrated by Ibn Abbas"},{"id":789,"text":"We performed Hajj with the Prophet and performed Tawaf-al-ifada on the Day of Nahr (slaughtering). Safiya got her menses and the Prophets desired from her what a husband desires from his wife. I said to him, \"O Allah's Apostle! She is having her menses.\" He said, \"Is she going to detain us?\" We informed him that she had performed Tawaf-al-Ifada on the Day of Nahr. He said, \"(Then you can) depart.\"","by":"Narrated by 'Aisha"},{"id":790,"text":"The Prophet was asked about the slaughtering, shaving (of the head), and the doing of Rami before or after the due times. He said, \"There is no harm in that.\"","by":"Narrated by Ibn Abbas"},{"id":791,"text":"The Prophet was asked (as regards the ceremonies of Hajj) at Mina on the Day of Nahr and he replied that there was no harm. Then a man said to him, \"I got my head shaved before slaughtering.\" He replied, \"Slaughter (now) and there is no harm in it.\" (Another) man said, \"I did the Rami (of the Jimar) after midday.\" The Prophet replied, \"There was no harm in it.\"","by":"Narrated by Ibn Abbas"},{"id":792,"text":"Allah's Apostle stopped (for a while near the Jimar at Mina) during his last Hajj and the people started asking him questions. A man said, \"Ignorantly I got my head shaved before slaughtering.\" The Prophet replied, \"Slaughter (now) and there is no harm in it.\" Another man said, \"Unknowingly I slaughtered the Hadi before doing the Rami.\" The Prophet said, \"Do Rami now and there is no harm in it.\" So, on that day, when the Prophet was asked about anything (about the ceremonies of Hajj) done before or after (its stated time) his reply was, \"Do it (now) and there is no harm.\"","by":"Narrated by 'Abdullah bin 'Amr "},{"id":793,"text":"I witnessed the Prophet when he was delivering the sermon on the Day of Nahr. A man stood up and said, \"I thought that such and such was to be done before such and such. I got my hair shaved before slaughtering.\" (Another said), \"I slaughtered the Hadi before doing the Rami.\" So, the people asked about many similar things. The Prophet said, \"Do it (now) and there is no harm in all these cases.\" Whenever the Prophet was asked about anything on that day, he replied, \"Do it (now) and there is no harm in it.\"","by":"Narrated by 'Abdullah bin 'Amr bin Al-'As"},{"id":794,"text":"Allah's Apostle stopped while on his she-camel (the subnarrator then narrated the Hadith as above, i.e. 793).","by":"Narrated by 'Abdullah bin 'Amr bin Al-'As"},{"id":795,"text":"Ibn Abbas said: \"Allah's Apostle delivered a sermon on the Day of Nahr, and said, 'O people! (Tell me) what is the day today?' The people replied, 'It is the forbidden (sacred) day.' He asked again, 'What town is this?' They replied, 'It is the forbidden (Sacred) town.' He asked, 'Which month is this?' They replied, 'It is the forbidden (Sacred) month.' He said, 'No doubt! Your blood, your properties, and your honor are sacred to one another like the sanctity of this day of yours, in this (sacred) town (Mecca) of yours, in this month of yours.' The Prophet repeated his statement again and again. After that he raised his head and said, 'O Allah! Haven't conveyed (Your Message) to them'. Haven't I conveyed Your Message to them?' \" Ibn Abbas added, \"By Him in Whose Hand my soul is, the following was his will (Prophet's will) to his followers:--It is incumbent upon those who are present to convey this information to those who are absent Beware don't renegade (as) disbelievers (turn into infidels) after me, Striking the necks (cutting the throats) of one another.' \"","by":"Narrated by 'Ikrima"},{"id":796,"text":"I heard the Prophet delivering a sermon at 'Arafat. ","by":"Narrated by Ibn Abbas"},{"id":797,"text":"The Prophet delivered to us a sermon on the Day of Nahr. He said, \"Do you know what is the day today?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give that day another name. He said, \"Isn't it the Day of Nahr?\" We said, \"It is.\" He further asked, \"Which month is this?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the month of Dhul-Hijja?\" We replied: \"Yes! It is.\" He further asked, \"What town is this?\" We replied, \"Allah and His Apostle know it better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the forbidden (Sacred) town (of Mecca)?\" We said, \"Yes. It is.\" He said, \"No doubt, your blood and your properties are sacred to one another like the sanctity of this day of yours, in this month of yours, in this town of yours, till the day you meet your Lord. No doubt! Haven't I conveyed Allah's message to you? They said, \"Yes.\" He said, \"O Allah! Be witness. So it is incumbent upon those who are present to convey it (this information) to those who are absent because the informed one might comprehend it (what I have said) better than the present audience, who will convey it to him. Beware! Do not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\"","by":"Narrated by Abu Bakra"},{"id":798,"text":"At Mina, the Prophet (p.b.u.h) said, \"Do you know what is the day today?\" The people replied, \"Allah and His Apostle know it better.\" He said, \"It is the forbidden (sacred) day. And do you know what town is this?\" They replied, \"Allah and His Apostle know it better.\" He said, \"This is the forbidden (Sacred) town (Mecca). And do you know which month is this?\" The people replied, \"Allah and His Apostle know it better.\" He said, \"This is the forbidden (sacred) month.\" The Prophet added, \"No doubt, Allah made your blood, your properties, and your honor sacred to one another like the sanctity of this day of yours in this month of yours in this town of yours.\" Narrated Ibn 'Umar: On the Day of Nahr (10th of Dhul-Hijja), the Prophet stood in between the Jamrat during his Hajj which he performed (as in the previous Hadith) and said, \"This is the greatest Day (i.e. 10th of Dhul-Hijjah).\" The Prophet started saying repeatedly, \"O Allah! Be Witness (I have conveyed Your Message).\" He then bade the people farewell. The people said, \"This is Hajjat-al-Wada).\" ","by":"Narrated by Ibn 'Umar"},{"id":799,"text":"The Prophet permitted (them). ","by":"Narrated by Ibn 'Umar"},{"id":800,"text":"That the Prophet allowed (as above).","by":"Narrated by Ibn 'Umar"},{"id":801,"text":"Al-Abbas asked the permission from the Prophet to stay at Mecca during the nights of Mina in order to provide water to the people, so the Prophet allowed him.","by":"Narrated by Ibn 'Umar"},{"id":802,"text":"I asked Ibn 'Umar, \"When should I do the Rami of the Jimar?\" He replied, \"When your leader does that.\" I asked him again the same question. He replied, \"We used to wait till the sun declined and then we would do the Rami (i.e. on the 11th and 12th of Dhul-Hijja).\"","by":"Narrated by Wabra"},{"id":803,"text":"'Abdullah, did the Rami from the middle of the valley. So, I said, \"O, Abu 'Abdur-Rahman! Some people do the Rami (of the Jamra) from above it (i.e. from the top of the valley).\" He said, \"By Him except whom none has the right to be worshipped, this is the place from where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Apostle) did the Rami.\"","by":"Narrated by 'Abdur-Rahman bin Yazid"},{"id":804,"text":"When 'Abdullah, reached the big Jamra (i.e. Jamrat-ul-Aqaba) he kept the Ka'ba on the left side and Mina on his right side and threw seven pebbles (at the Jamra) and said, \"The one on whom Surat-al-Baqara was revealed (i.e. the Prophet) had done the Rami similarly.\"","by":"Narrated by 'Abdur-Rahman bin Yazid"},{"id":805,"text":"I performed Hajj with Ibn Masud , and saw him doing Rami of the big Jamra (Jamrat-ul-Aqaba) with seven small pebbles, keeping the Ka'ba on his left side and Mina on his right. He then said, \"This is the place where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Apostle ) stood.\"","by":"Narrated by 'Abdur-Rahman bin Yazid"},{"id":806,"text":"I heard Al-Hajjaj saying on the pulpit, \"The Sura in which Al-Baqara (the cow) is mentioned and the Sura in which the family of 'Imran is mentioned and the Sura in which the women (An-Nisa) is mentioned.\" I mentioned this to Ibrahim, and he said, 'Abdur-Rahman bin Yazid told me, 'I was with Ibn Masud, when he did the Rami of the Jamrat-ul-Aqaba. He went down the middle of the valley, and when he came near the tree (which was near the Jamra) he stood opposite to it and threw seven small pebbles and said: 'Allahu-Akbar' on throwing every pebble.' Then he said, 'By Him, except Whom none has the right to be worshipped, here (at this place) stood the one on whom Surat-al-Baqra was revealed (i.e. Allah's Apostle).' \"","by":"Narrated by Al-Amash"},{"id":807,"text":"Ibn 'Umar used to do Rami of the Jamrat-ud-Dunya (the Jamra near to the Khaif mosque) with seven small stones and used to recite Takbir on throwing every pebble. He then would go ahead till he reached the level ground where he would stand facing the Qibla for a long time to invoke (Allah) while raising his hands (while invoking). Then he would do Rami of the Jamrat-ul-Wusta (middle Jamra) and then he would go to the left towards the middle ground, where he would stand facing the Qibla. He would remain standing there for a long period to invoke (Allah) while raising his hands, and would stand there for a long period. Then he would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it, and then he would leave and say, \"I saw the Prophet doing like this.\"","by":"Narrated by Salim"},{"id":808,"text":"'Abdullah bin 'Umar used to do Rami of the Jamrat-ud-Dunya with seven small pebbles and used to recite Takbir on throwing each stone. He, then, would proceed further till he reached the level ground, where he would stay for a long time, facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Wusta similarly and would go to the left towards the level ground, where he would stand for a long time facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-'Aqaba from the middle of the valley, but he would not stay by it. Ibn 'Umar used to say, \"I saw Allah's Apostle doing like that.\" ","by":"Narrated by Salim bin Abdullah"},{"id":809,"text":"I heard my father who was the best man of his age, saying, \"I heard 'Aisha saying, 'I perfumed Allah's Apostle with my own hands before finishing his Ihram while yet he has not performed Tawaf-al-Ifada.' She spread her hands (while saying so.)\"","by":"Narrated by 'Abdur-Rahman bin Al-Qasim"},{"id":810,"text":"The people were ordered to perform the Tawaf of the Ka'ba (Tawaf-al-Wada') as the lastly thing, before leaving (Mecca), except the menstruating women who were excused. ","by":"Narrated by Ibn Abbas"},{"id":811,"text":"The Prophet offered the Zuhr, 'Asr, Maghrib and the 'Isha' prayers and slept for a while at a place called Al-Mahassab and then rode to the Ka'ba and performed Tawaf round it .","by":"Narrated by Anas bin Malik"},{"id":812,"text":"Safiya bint Huyay, the wife of the Prophet got her menses, and Allah's Apostle was informed of that. He said, \"Would she delay us?\" The people said, \"She has already performed Tawaf-al-Ifada.\" He said, \"Therefore she will not (delay us).\"","by":"Narrated by 'Aisha"},{"id":813,"text":"The people of Medina asked Ibn Abbas about a woman who got her menses after performing Tawaf-al-Ifada. He said, \"She could depart (from Mecca).\" They said, \"We will not act on your verdict and ignore the verdict of Zaid.\" Ibn Abbas said, \"When you reach Medina, inquire about it.\" So, when they reached Medina they asked (about that). One of those whom they asked was Um Sulaim. She told them the narration of Safiya (812).","by":"Narrated by 'Ikrima"},{"id":814,"text":"A menstruating woman was allowed to leave Mecca if she had done Tawaf-al-Ifada. Tawus (a sub-narrator) said from his father, \"I heard Ibn 'Umar saying that she would not depart. Then later I heard him saying that the Prophet had allowed them (menstruating women) to depart.\"","by":"Narrated by Ibn Abbas"},{"id":815,"text":"We set out with the Prophet with the intention of performing Hajj only. The Prophet reached Mecca and performed Tawaf of the Ka'ba and between Safa and Marwa and did not finish the Ihram, because he had the Hadi with him. His companions and his wives performed Tawaf (of the Ka'ba and between Safa and Marwa), and those who had no Hadi with them finished their Ihram. I got the menses and performed all the ceremonies of Hajj. So, when the Night of Hasba (night of departure) came, I said, \"O Allah's Apostle! All your companions are returning with Hajj and 'Umra except me.\" He asked me, \"Didn't you perform Tawaf of the Ka'ba (Umra) when you reached Mecca?\" I said, \"No.\" He said, \"Go to Tan'im with your brother 'Abdur-Rahman, and assume Ihram for 'Umra and I will wait for you at such and such a place.\" So I went with 'Abdur-Rahman to Tan'im and assumed Ihram for 'Umra. Then Safiya bint Huyay got menses. The Prophet said, \" 'Aqra Halqa! You will detain us! Didn't you perform Tawaf-al-Ifada on the Day of Nahr (slaughtering)?\" She said, \"Yes, I did.\" He said, \"Then there is no harm, depart.\" So I met the Prophet when he was ascending the heights towards Mecca and I was descending, or vice-versa. ","by":"Narrated by 'Aisha"},{"id":816,"text":"I asked Anas bin Malik, \"Tell me something you have observed about the Prophet concerning where he offered the Zuhr prayer on the Day of Tarwiya (8th Dhul-Hijja).\" Anas replied, \"He offered it at Mina.\" I said, \"Where did he offer the Asr prayer on the Day of Nafr (day of departure from Mina)?\" He replied, \"At Al-Abtah,\" and added, \"You should do as your leaders do.\"","by":"Narrated by 'Abdul-Aziz bin Rufai"},{"id":817,"text":"The Prophet offered the Zuhr, 'Asr, Maghrib and 'Isha' prayers and slept for a while at a place called Al-Mahassab and then he rode towards the Ka'ba and performed Tawaf (al-Wada').","by":"Narrated by Anas bin Malik"},{"id":818,"text":"It (i.e. Al-Abtah) was a place where the Prophet used to camp so that it might be easier for him to depart.","by":"Narrated by 'Aisha"},{"id":819,"text":"Staying at Al-Mahassab is not one of the ceremonies (of Hajj), but Al-Mahassab is a place where Allah's Apostle camped (during his Hajjat-ul-wida).","by":"Narrated by Ibn Abbas"},{"id":820,"text":"Ibn 'Umar used to spend the night at Dhi-Tuwa in between the two Thaniyas and then he would enter Mecca through the Thaniya which is at the higher region of Mecca, and whenever he came to Mecca for Hajj or 'Umra, he never made his she camel kneel down except near the gate of the Masjid (Sacred Mosque) and then he would enter (it) and go to the Black (stone) Corner and start from there circumambulating the Ka'ba seven times: hastening in the first three rounds (Ramal) and walking in the last four. On finishing, he would offer two Rakat prayer and set out to perform Tawaf between Safa and Marwa before returning to his dwelling place. On returning (to Medina) from Hajj or 'Umra, he used to make his camel kneel down at Al-Batha which is at Dhu-l-Hulaifa, the place where the Prophet used to make his camel kneel down.","by":"Narrated by Nafi"},{"id":821,"text":"'Ubaidullah was asked about Al Mahassab. 'Ubaidullah narrated: Nafi' said, 'Allah's Apostles, 'Umar and Ibn 'Umar camped there.\" Nafi' added, \"Ibn 'Umar used to offer the Zuhr and 'Asr prayers at it (i.e. Al-Mahassab).\" I think he mentioned the Maghrib prayer also. I said, \"I don't doubt about 'Isha' (i.e. he used to offer it there also), and he used to sleep there for a while. He used to say, 'The Prophet used to do the same.' \"","by":"Narrated by Khalid bin Al-Harith"},{"id":822,"text":"Dhul-Majaz and 'Ukaz were the markets of the people during the pre-lslamic period of ignorance. When the people embraced Islam, they disliked to do bargaining there till the following Holy Verses were revealed:-- There is no harm for you If you seek of the bounty Of your Lord (during Hajj by trading, etc.) (2.198)","by":"Narrated by Ibn 'Abbas "},{"id":823,"text":"Safiya got her menses on the night of Nafr (departure from Hajj), and she said, \"I see that I will detain you.\" The Prophet said, \"Aqra Halqa! Did she perform the Tawaf on the Day of Nahr (slaughtering)?\" Somebody replied in the affirmative. He said, \"Then depart.\" (Different narrators mentioned that) 'Aisha said, \"We set out with Allah's Apostle (from Medina) with the intention of performing Hajj only. When we reached Mecca, he ordered us to finish the Ihram. When it was the night of Nafr (departure), Safiya bint Huyay got her menses. The Prophet said, \"Halqa Aqra! I think that she will detain you,\" and added, \"Did you perform the Tawaf (Al-Ifada) on the Day of Nahr (slaughtering)?\" She replied, \"Yes.\" He said, \"Then depart.\" I said, \"O Allah's Apostle! I have not (done the Umra).\" He replied, \"Perform 'Umra from Tan'im.\" My brother went with me and we came across the Prophet in the last part of the night. He said, \"Wait at such and such a place.\"","by":"Narrated by 'Aisha"}]}