{"name":"35. Paid in Advance","hadiths":[{"id":441,"text":"Allah's Apostle came to Medina and the people used to pay in advance the price of fruits to be delivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or two to three years.) The Prophet said, \"Whoever pays money in advance for dates (to be delivered later) should pay it for known specified weight and measure (of the dates).\"","by":"Narrated by Ibn Abbas"},{"id":442,"text":"As above, mentioning only specific measure.","by":"Narrated by Ibn Abi Najih"},{"id":443,"text":"The Prophet came to Medina and the people used to pay in advance the price of dates to be delivered within two or three years. He said (to them), \"Whoever pays in advance the price of a thing to be delivered later should pay it for a specified measure at specified weight for a specified period.\"","by":"Narrated by Ibn 'Abbas"},{"id":444,"text":"As above, saying, \"He should pay the price in advance for a specified measure and for a specified period.\"","by":"Narrated by Ibn Abi Najih"},{"id":445,"text":"The Prophet came (to Medina) and he told the people (regarding the payment of money in advance that they should pay it) for a known specified measure and a known specified weight and a known specified period.","by":"Narrated by Ibn 'Abbas"},{"id":446,"text":"Muhammad or 'Abdullah bin Abu Al-Mujalid said, \"Abdullah bin Shaddad and Abu Burda differed regarding As-Salam, so they sent me to Ibn Abi Aufa and I asked him about it. He replied, 'In the life-time of Allah's Apostle, Abu Bakr and 'Umar, we used to pay in advance the prices of wheat, barley, dried grapes and dates to be delivered later. I also asked Ibn Abza and he, too, replied as above.' \"","by":"Narrated by Shu'ba"},{"id":447,"text":"Abdullah bin Shaddad and Abu Burda sent me to 'Abdullah bin Abi Aufa and told me to ask 'Abdullah whether the people in the life-time of the Prophet used to pay in advance for wheat (to be delivered later). Abdullah replied, \"We used to pay in advance to the peasants of Sham for wheat, barley and olive oil of a known specified measure to be delivered in a specified period.\" I asked (him), \"Was the price paid (in advance) to those who had the things to be delivered later?\" Abdullah bin Aufa replied, \"We did not use to ask them about that.\" Then they sent me to 'Abdur Rahman bin Abza and I asked him. He replied, \"The companions of the Prophet used to practice Salam in the life-time of the Prophet; and we did not use to ask them whether they had standing crops or not.\"","by":"Narrated by Muhammad bin Al-Majalid"},{"id":448,"text":"As above (446) and said, \"We used to pay them in advance for wheat and barley (to be delivered later). Narrated Ash-Shaibani--\"And also for oil.\"","by":"Narrated by Muhammad bin Abi Al-Mujalid"},{"id":449,"text":"Who said \"We used to pay in advance for wheat barley and dried grapes.\"","by":"Narrated by Ash-Shaibani"},{"id":450,"text":"I asked Ibn 'Abbas about Salam for (the fruits of) date-palms. He replied \"The Prophet forbade the sale a dates on the trees till they became fit for eating and could be weighed.\" A man asked what to be weighed (as the dates were still on the trees). Another man sitting beside Ibn 'Abbas replied, \"Till they are cut and stored.\" Narrated Abu Al-Bakhtari: I heard Ibn Abbas (saying) that the Prophet forbade ... etc. as above.","by":"Narrated by Abu Bakhtari At-Tai"},{"id":451,"text":"I asked Ibn Umar about Salam (the fruits of) date-palms. He replied, \"The Prophet forbade the sale of dates till their benefit becomes evident and fit for eating and also the sale of silver (for gold) on credit.\" I asked Ibn 'Abbas about Salam for dates and he replied, \"The Prophet forbade the sale of dates till they were fit for eating and could be estimated.\"","by":"Narrated by Abu Al-Bakhtari"},{"id":452,"text":"I asked Ibn 'Umar about Salam for dates. Ibn 'Umar replied, \"The Prophet forbade the sale (the fruits) of datepalms until they were fit for eating and also forbade the sale of silver for gold on credit.\" I also asked Ibn 'Abbas about it. Ibn 'Abbas replied, \"The Prophet forbade the sale of dates till they were fit for eating, and could be weighed.\" I asked him, \"What is to be weighed (as the dates are on the trees)?\" A man sitting by Ibn 'Abbas said, \"It means till they are cut and stored.\"","by":"Narrated by Abu Al-Bakhtari"},{"id":453,"text":"Allah's Apostle bought some foodstuff (barley) from a Jew on credit and mortgaged his iron armor to him (the armor stands for a guarantor). ","by":"Narrated by 'Aisha"},{"id":454,"text":"We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha said, 'The Prophet bought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and he mortgaged his iron armor to him.\"","by":"Narrated by Al-A'mash"},{"id":455,"text":"The Prophet came to Medina and the people used to pay in advance the prices of fruits to be delivered within two to three years. The Prophet said (to them), \"Buy fruits by paying their prices in advance on condition that the fruits are to be delivered to you according to a fixed specified measure within a fixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight.\"","by":"Narrated by Ibn 'Abbas"},{"id":456,"text":"Abu Burda and 'Abdullah bin Shaddad sent me to 'Abdur Rahman bin Abza and 'Abdullah bin Abi Aufa to ask them about the Salaf (Salam). They said, \"We used to get war booty while we were with Allah's Apostle and when the peasants of Sham came to us we used to pay them in advance for wheat, barley, and oil to be delivered within a fixed period.\" I asked them, \"Did the peasants own standing crops or not?\" They replied, \"We never asked them about it.\"","by":"Narrated by Muhammad bin Abi Al-Mujalid"},{"id":457,"text":"The people used to sell camels on the basis of Habal-al-Habala. The Prophet forbade such sale. Nafi' explained Habalal-Habala by saying. \"The camel is to be delivered to the buyer after the she-camel gives birth.\"","by":"Narrated by 'Abdullah"},{"id":458,"text":"Allah's Apostle gave a verdict regarding Shuf'a in every undivided joint thing (property). But if the limits are defined (or demarcated) or the ways and streets are fixed, then there is no pre-emption.","by":"Narrated by Jabir bin 'Abdullah"},{"id":459,"text":"While I was standing with Sad bin Abi Waqqas, Al-Miswar bin Makhrama came and put his hand on my shoulder. Meanwhile Abu Rafi', the freed slave of the Prophet came and asked Sad to buy from him the (two) dwellings which were in his house. Sad said, \"By Allah I will not buy them.\" Al-Miswar said, \"By Allah, you shall buy them.\" Sad replied, \"By Allah, I will not pay more than four thousand (Dirhams) by installments.\" Abu Rafi' said, \"I have been offered five hundred Dinars (for it) and had I not heard the Prophet saying, 'The neighbor has more right than anyone else because of his nearness, I would not give them to you for four-thousand (Dirhams) while I am offered five-hundred Dinars (one Dinar equals ten Dirhams) for them.\" So, he sold it to Sad.","by":"Narrated by 'Amr bin Ash-Sharid"},{"id":460,"text":"I said, \"O Allah's Apostle! I have two neighbors and would like to know to which of them I should give presents.\" He replied, \"To the one whose door is nearer to you.\"","by":"Narrated by Aisha"}]}