{
  "id": 13,
  "name": "الرعد",
  "transliteration": "Ar-Ra'd",
  "translation": "The Thunder",
  "verses": [
    "المر ۚ تِلكَ آياتُ الكِتابِ ۗ وَالَّذي أُنزِلَ إِلَيكَ مِن رَبِّكَ الحَقُّ وَلٰكِنَّ أَكثَرَ النّاسِ لا يُؤمِنونَ",
    "اللَّهُ الَّذي رَفَعَ السَّماواتِ بِغَيرِ عَمَدٍ تَرَونَها ۖ ثُمَّ استَوىٰ عَلَى العَرشِ ۖ وَسَخَّرَ الشَّمسَ وَالقَمَرَ ۖ كُلٌّ يَجري لِأَجَلٍ مُسَمًّى ۚ يُدَبِّرُ الأَمرَ يُفَصِّلُ الآياتِ لَعَلَّكُم بِلِقاءِ رَبِّكُم توقِنونَ",
    "وَهُوَ الَّذي مَدَّ الأَرضَ وَجَعَلَ فيها رَواسِيَ وَأَنهارًا ۖ وَمِن كُلِّ الثَّمَراتِ جَعَلَ فيها زَوجَينِ اثنَينِ ۖ يُغشِي اللَّيلَ النَّهارَ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يَتَفَكَّرونَ",
    "وَفِي الأَرضِ قِطَعٌ مُتَجاوِراتٌ وَجَنّاتٌ مِن أَعنابٍ وَزَرعٌ وَنَخيلٌ صِنوانٌ وَغَيرُ صِنوانٍ يُسقىٰ بِماءٍ واحِدٍ وَنُفَضِّلُ بَعضَها عَلىٰ بَعضٍ فِي الأُكُلِ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يَعقِلونَ",
    "۞ وَإِن تَعجَب فَعَجَبٌ قَولُهُم أَإِذا كُنّا تُرابًا أَإِنّا لَفي خَلقٍ جَديدٍ ۗ أُولٰئِكَ الَّذينَ كَفَروا بِرَبِّهِم ۖ وَأُولٰئِكَ الأَغلالُ في أَعناقِهِم ۖ وَأُولٰئِكَ أَصحابُ النّارِ ۖ هُم فيها خالِدونَ",
    "وَيَستَعجِلونَكَ بِالسَّيِّئَةِ قَبلَ الحَسَنَةِ وَقَد خَلَت مِن قَبلِهِمُ المَثُلاتُ ۗ وَإِنَّ رَبَّكَ لَذو مَغفِرَةٍ لِلنّاسِ عَلىٰ ظُلمِهِم ۖ وَإِنَّ رَبَّكَ لَشَديدُ العِقابِ",
    "وَيَقولُ الَّذينَ كَفَروا لَولا أُنزِلَ عَلَيهِ آيَةٌ مِن رَبِّهِ ۗ إِنَّما أَنتَ مُنذِرٌ ۖ وَلِكُلِّ قَومٍ هادٍ",
    "اللَّهُ يَعلَمُ ما تَحمِلُ كُلُّ أُنثىٰ وَما تَغيضُ الأَرحامُ وَما تَزدادُ ۖ وَكُلُّ شَيءٍ عِندَهُ بِمِقدارٍ",
    "عالِمُ الغَيبِ وَالشَّهادَةِ الكَبيرُ المُتَعالِ",
    "سَواءٌ مِنكُم مَن أَسَرَّ القَولَ وَمَن جَهَرَ بِهِ وَمَن هُوَ مُستَخفٍ بِاللَّيلِ وَسارِبٌ بِالنَّهارِ",
    "لَهُ مُعَقِّباتٌ مِن بَينِ يَدَيهِ وَمِن خَلفِهِ يَحفَظونَهُ مِن أَمرِ اللَّهِ ۗ إِنَّ اللَّهَ لا يُغَيِّرُ ما بِقَومٍ حَتّىٰ يُغَيِّروا ما بِأَنفُسِهِم ۗ وَإِذا أَرادَ اللَّهُ بِقَومٍ سوءًا فَلا مَرَدَّ لَهُ ۚ وَما لَهُم مِن دونِهِ مِن والٍ",
    "هُوَ الَّذي يُريكُمُ البَرقَ خَوفًا وَطَمَعًا وَيُنشِئُ السَّحابَ الثِّقالَ",
    "وَيُسَبِّحُ الرَّعدُ بِحَمدِهِ وَالمَلائِكَةُ مِن خيفَتِهِ وَيُرسِلُ الصَّواعِقَ فَيُصيبُ بِها مَن يَشاءُ وَهُم يُجادِلونَ فِي اللَّهِ وَهُوَ شَديدُ المِحالِ",
    "لَهُ دَعوَةُ الحَقِّ ۖ وَالَّذينَ يَدعونَ مِن دونِهِ لا يَستَجيبونَ لَهُم بِشَيءٍ إِلّا كَباسِطِ كَفَّيهِ إِلَى الماءِ لِيَبلُغَ فاهُ وَما هُوَ بِبالِغِهِ ۚ وَما دُعاءُ الكافِرينَ إِلّا في ضَلالٍ",
    "وَلِلَّهِ يَسجُدُ مَن فِي السَّماواتِ وَالأَرضِ طَوعًا وَكَرهًا وَظِلالُهُم بِالغُدُوِّ وَالآصالِ ۩",
    "قُل مَن رَبُّ السَّماواتِ وَالأَرضِ قُلِ اللَّهُ ۚ قُل أَفَاتَّخَذتُم مِن دونِهِ أَولِياءَ لا يَملِكونَ لِأَنفُسِهِم نَفعًا وَلا ضَرًّا ۚ قُل هَل يَستَوِي الأَعمىٰ وَالبَصيرُ أَم هَل تَستَوِي الظُّلُماتُ وَالنّورُ ۗ أَم جَعَلوا لِلَّهِ شُرَكاءَ خَلَقوا كَخَلقِهِ فَتَشابَهَ الخَلقُ عَلَيهِم ۚ قُلِ اللَّهُ خالِقُ كُلِّ شَيءٍ وَهُوَ الواحِدُ القَهّارُ",
    "أَنزَلَ مِنَ السَّماءِ ماءً فَسالَت أَودِيَةٌ بِقَدَرِها فَاحتَمَلَ السَّيلُ زَبَدًا رابِيًا ۚ وَمِمّا يوقِدونَ عَلَيهِ فِي النّارِ ابتِغاءَ حِليَةٍ أَو مَتاعٍ زَبَدٌ مِثلُهُ ۚ كَذٰلِكَ يَضرِبُ اللَّهُ الحَقَّ وَالباطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذهَبُ جُفاءً ۖ وَأَمّا ما يَنفَعُ النّاسَ فَيَمكُثُ فِي الأَرضِ ۚ كَذٰلِكَ يَضرِبُ اللَّهُ الأَمثالَ",
    "لِلَّذينَ استَجابوا لِرَبِّهِمُ الحُسنىٰ ۚ وَالَّذينَ لَم يَستَجيبوا لَهُ لَو أَنَّ لَهُم ما فِي الأَرضِ جَميعًا وَمِثلَهُ مَعَهُ لَافتَدَوا بِهِ ۚ أُولٰئِكَ لَهُم سوءُ الحِسابِ وَمَأواهُم جَهَنَّمُ ۖ وَبِئسَ المِهادُ",
    "۞ أَفَمَن يَعلَمُ أَنَّما أُنزِلَ إِلَيكَ مِن رَبِّكَ الحَقُّ كَمَن هُوَ أَعمىٰ ۚ إِنَّما يَتَذَكَّرُ أُولُو الأَلبابِ",
    "الَّذينَ يوفونَ بِعَهدِ اللَّهِ وَلا يَنقُضونَ الميثاقَ",
    "وَالَّذينَ يَصِلونَ ما أَمَرَ اللَّهُ بِهِ أَن يوصَلَ وَيَخشَونَ رَبَّهُم وَيَخافونَ سوءَ الحِسابِ",
    "وَالَّذينَ صَبَرُوا ابتِغاءَ وَجهِ رَبِّهِم وَأَقامُوا الصَّلاةَ وَأَنفَقوا مِمّا رَزَقناهُم سِرًّا وَعَلانِيَةً وَيَدرَءونَ بِالحَسَنَةِ السَّيِّئَةَ أُولٰئِكَ لَهُم عُقبَى الدّارِ",
    "جَنّاتُ عَدنٍ يَدخُلونَها وَمَن صَلَحَ مِن آبائِهِم وَأَزواجِهِم وَذُرِّيّاتِهِم ۖ وَالمَلائِكَةُ يَدخُلونَ عَلَيهِم مِن كُلِّ بابٍ",
    "سَلامٌ عَلَيكُم بِما صَبَرتُم ۚ فَنِعمَ عُقبَى الدّارِ",
    "وَالَّذينَ يَنقُضونَ عَهدَ اللَّهِ مِن بَعدِ ميثاقِهِ وَيَقطَعونَ ما أَمَرَ اللَّهُ بِهِ أَن يوصَلَ وَيُفسِدونَ فِي الأَرضِ ۙ أُولٰئِكَ لَهُمُ اللَّعنَةُ وَلَهُم سوءُ الدّارِ",
    "اللَّهُ يَبسُطُ الرِّزقَ لِمَن يَشاءُ وَيَقدِرُ ۚ وَفَرِحوا بِالحَياةِ الدُّنيا وَمَا الحَياةُ الدُّنيا فِي الآخِرَةِ إِلّا مَتاعٌ",
    "وَيَقولُ الَّذينَ كَفَروا لَولا أُنزِلَ عَلَيهِ آيَةٌ مِن رَبِّهِ ۗ قُل إِنَّ اللَّهَ يُضِلُّ مَن يَشاءُ وَيَهدي إِلَيهِ مَن أَنابَ",
    "الَّذينَ آمَنوا وَتَطمَئِنُّ قُلوبُهُم بِذِكرِ اللَّهِ ۗ أَلا بِذِكرِ اللَّهِ تَطمَئِنُّ القُلوبُ",
    "الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ طوبىٰ لَهُم وَحُسنُ مَآبٍ",
    "كَذٰلِكَ أَرسَلناكَ في أُمَّةٍ قَد خَلَت مِن قَبلِها أُمَمٌ لِتَتلُوَ عَلَيهِمُ الَّذي أَوحَينا إِلَيكَ وَهُم يَكفُرونَ بِالرَّحمٰنِ ۚ قُل هُوَ رَبّي لا إِلٰهَ إِلّا هُوَ عَلَيهِ تَوَكَّلتُ وَإِلَيهِ مَتابِ",
    "وَلَو أَنَّ قُرآنًا سُيِّرَت بِهِ الجِبالُ أَو قُطِّعَت بِهِ الأَرضُ أَو كُلِّمَ بِهِ المَوتىٰ ۗ بَل لِلَّهِ الأَمرُ جَميعًا ۗ أَفَلَم يَيأَسِ الَّذينَ آمَنوا أَن لَو يَشاءُ اللَّهُ لَهَدَى النّاسَ جَميعًا ۗ وَلا يَزالُ الَّذينَ كَفَروا تُصيبُهُم بِما صَنَعوا قارِعَةٌ أَو تَحُلُّ قَريبًا مِن دارِهِم حَتّىٰ يَأتِيَ وَعدُ اللَّهِ ۚ إِنَّ اللَّهَ لا يُخلِفُ الميعادَ",
    "وَلَقَدِ استُهزِئَ بِرُسُلٍ مِن قَبلِكَ فَأَملَيتُ لِلَّذينَ كَفَروا ثُمَّ أَخَذتُهُم ۖ فَكَيفَ كانَ عِقابِ",
    "أَفَمَن هُوَ قائِمٌ عَلىٰ كُلِّ نَفسٍ بِما كَسَبَت ۗ وَجَعَلوا لِلَّهِ شُرَكاءَ قُل سَمّوهُم ۚ أَم تُنَبِّئونَهُ بِما لا يَعلَمُ فِي الأَرضِ أَم بِظاهِرٍ مِنَ القَولِ ۗ بَل زُيِّنَ لِلَّذينَ كَفَروا مَكرُهُم وَصُدّوا عَنِ السَّبيلِ ۗ وَمَن يُضلِلِ اللَّهُ فَما لَهُ مِن هادٍ",
    "لَهُم عَذابٌ فِي الحَياةِ الدُّنيا ۖ وَلَعَذابُ الآخِرَةِ أَشَقُّ ۖ وَما لَهُم مِنَ اللَّهِ مِن واقٍ",
    "۞ مَثَلُ الجَنَّةِ الَّتي وُعِدَ المُتَّقونَ ۖ تَجري مِن تَحتِهَا الأَنهارُ ۖ أُكُلُها دائِمٌ وَظِلُّها ۚ تِلكَ عُقبَى الَّذينَ اتَّقَوا ۖ وَعُقبَى الكافِرينَ النّارُ",
    "وَالَّذينَ آتَيناهُمُ الكِتابَ يَفرَحونَ بِما أُنزِلَ إِلَيكَ ۖ وَمِنَ الأَحزابِ مَن يُنكِرُ بَعضَهُ ۚ قُل إِنَّما أُمِرتُ أَن أَعبُدَ اللَّهَ وَلا أُشرِكَ بِهِ ۚ إِلَيهِ أَدعو وَإِلَيهِ مَآبِ",
    "وَكَذٰلِكَ أَنزَلناهُ حُكمًا عَرَبِيًّا ۚ وَلَئِنِ اتَّبَعتَ أَهواءَهُم بَعدَما جاءَكَ مِنَ العِلمِ ما لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلا واقٍ",
    "وَلَقَد أَرسَلنا رُسُلًا مِن قَبلِكَ وَجَعَلنا لَهُم أَزواجًا وَذُرِّيَّةً ۚ وَما كانَ لِرَسولٍ أَن يَأتِيَ بِآيَةٍ إِلّا بِإِذنِ اللَّهِ ۗ لِكُلِّ أَجَلٍ كِتابٌ",
    "يَمحُو اللَّهُ ما يَشاءُ وَيُثبِتُ ۖ وَعِندَهُ أُمُّ الكِتابِ",
    "وَإِن ما نُرِيَنَّكَ بَعضَ الَّذي نَعِدُهُم أَو نَتَوَفَّيَنَّكَ فَإِنَّما عَلَيكَ البَلاغُ وَعَلَينَا الحِسابُ",
    "أَوَلَم يَرَوا أَنّا نَأتِي الأَرضَ نَنقُصُها مِن أَطرافِها ۚ وَاللَّهُ يَحكُمُ لا مُعَقِّبَ لِحُكمِهِ ۚ وَهُوَ سَريعُ الحِسابِ",
    "وَقَد مَكَرَ الَّذينَ مِن قَبلِهِم فَلِلَّهِ المَكرُ جَميعًا ۖ يَعلَمُ ما تَكسِبُ كُلُّ نَفسٍ ۗ وَسَيَعلَمُ الكُفّارُ لِمَن عُقبَى الدّارِ",
    "وَيَقولُ الَّذينَ كَفَروا لَستَ مُرسَلًا ۚ قُل كَفىٰ بِاللَّهِ شَهيدًا بَيني وَبَينَكُم وَمَن عِندَهُ عِلمُ الكِتابِ"
  ]
}