{
  "id": 14,
  "name": "ابراهيم",
  "transliteration": "Ibrahim",
  "translation": "Abraham",
  "verses": [
    "الر ۚ كِتابٌ أَنزَلناهُ إِلَيكَ لِتُخرِجَ النّاسَ مِنَ الظُّلُماتِ إِلَى النّورِ بِإِذنِ رَبِّهِم إِلىٰ صِراطِ العَزيزِ الحَميدِ",
    "اللَّهِ الَّذي لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ وَوَيلٌ لِلكافِرينَ مِن عَذابٍ شَديدٍ",
    "الَّذينَ يَستَحِبّونَ الحَياةَ الدُّنيا عَلَى الآخِرَةِ وَيَصُدّونَ عَن سَبيلِ اللَّهِ وَيَبغونَها عِوَجًا ۚ أُولٰئِكَ في ضَلالٍ بَعيدٍ",
    "وَما أَرسَلنا مِن رَسولٍ إِلّا بِلِسانِ قَومِهِ لِيُبَيِّنَ لَهُم ۖ فَيُضِلُّ اللَّهُ مَن يَشاءُ وَيَهدي مَن يَشاءُ ۚ وَهُوَ العَزيزُ الحَكيمُ",
    "وَلَقَد أَرسَلنا موسىٰ بِآياتِنا أَن أَخرِج قَومَكَ مِنَ الظُّلُماتِ إِلَى النّورِ وَذَكِّرهُم بِأَيّامِ اللَّهِ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِكُلِّ صَبّارٍ شَكورٍ",
    "وَإِذ قالَ موسىٰ لِقَومِهِ اذكُروا نِعمَةَ اللَّهِ عَلَيكُم إِذ أَنجاكُم مِن آلِ فِرعَونَ يَسومونَكُم سوءَ العَذابِ وَيُذَبِّحونَ أَبناءَكُم وَيَستَحيونَ نِساءَكُم ۚ وَفي ذٰلِكُم بَلاءٌ مِن رَبِّكُم عَظيمٌ",
    "وَإِذ تَأَذَّنَ رَبُّكُم لَئِن شَكَرتُم لَأَزيدَنَّكُم ۖ وَلَئِن كَفَرتُم إِنَّ عَذابي لَشَديدٌ",
    "وَقالَ موسىٰ إِن تَكفُروا أَنتُم وَمَن فِي الأَرضِ جَميعًا فَإِنَّ اللَّهَ لَغَنِيٌّ حَميدٌ",
    "أَلَم يَأتِكُم نَبَأُ الَّذينَ مِن قَبلِكُم قَومِ نوحٍ وَعادٍ وَثَمودَ ۛ وَالَّذينَ مِن بَعدِهِم ۛ لا يَعلَمُهُم إِلَّا اللَّهُ ۚ جاءَتهُم رُسُلُهُم بِالبَيِّناتِ فَرَدّوا أَيدِيَهُم في أَفواهِهِم وَقالوا إِنّا كَفَرنا بِما أُرسِلتُم بِهِ وَإِنّا لَفي شَكٍّ مِمّا تَدعونَنا إِلَيهِ مُريبٍ",
    "۞ قالَت رُسُلُهُم أَفِي اللَّهِ شَكٌّ فاطِرِ السَّماواتِ وَالأَرضِ ۖ يَدعوكُم لِيَغفِرَ لَكُم مِن ذُنوبِكُم وَيُؤَخِّرَكُم إِلىٰ أَجَلٍ مُسَمًّى ۚ قالوا إِن أَنتُم إِلّا بَشَرٌ مِثلُنا تُريدونَ أَن تَصُدّونا عَمّا كانَ يَعبُدُ آباؤُنا فَأتونا بِسُلطانٍ مُبينٍ",
    "قالَت لَهُم رُسُلُهُم إِن نَحنُ إِلّا بَشَرٌ مِثلُكُم وَلٰكِنَّ اللَّهَ يَمُنُّ عَلىٰ مَن يَشاءُ مِن عِبادِهِ ۖ وَما كانَ لَنا أَن نَأتِيَكُم بِسُلطانٍ إِلّا بِإِذنِ اللَّهِ ۚ وَعَلَى اللَّهِ فَليَتَوَكَّلِ المُؤمِنونَ",
    "وَما لَنا أَلّا نَتَوَكَّلَ عَلَى اللَّهِ وَقَد هَدانا سُبُلَنا ۚ وَلَنَصبِرَنَّ عَلىٰ ما آذَيتُمونا ۚ وَعَلَى اللَّهِ فَليَتَوَكَّلِ المُتَوَكِّلونَ",
    "وَقالَ الَّذينَ كَفَروا لِرُسُلِهِم لَنُخرِجَنَّكُم مِن أَرضِنا أَو لَتَعودُنَّ في مِلَّتِنا ۖ فَأَوحىٰ إِلَيهِم رَبُّهُم لَنُهلِكَنَّ الظّالِمينَ",
    "وَلَنُسكِنَنَّكُمُ الأَرضَ مِن بَعدِهِم ۚ ذٰلِكَ لِمَن خافَ مَقامي وَخافَ وَعيدِ",
    "وَاستَفتَحوا وَخابَ كُلُّ جَبّارٍ عَنيدٍ",
    "مِن وَرائِهِ جَهَنَّمُ وَيُسقىٰ مِن ماءٍ صَديدٍ",
    "يَتَجَرَّعُهُ وَلا يَكادُ يُسيغُهُ وَيَأتيهِ المَوتُ مِن كُلِّ مَكانٍ وَما هُوَ بِمَيِّتٍ ۖ وَمِن وَرائِهِ عَذابٌ غَليظٌ",
    "مَثَلُ الَّذينَ كَفَروا بِرَبِّهِم ۖ أَعمالُهُم كَرَمادٍ اشتَدَّت بِهِ الرّيحُ في يَومٍ عاصِفٍ ۖ لا يَقدِرونَ مِمّا كَسَبوا عَلىٰ شَيءٍ ۚ ذٰلِكَ هُوَ الضَّلالُ البَعيدُ",
    "أَلَم تَرَ أَنَّ اللَّهَ خَلَقَ السَّماواتِ وَالأَرضَ بِالحَقِّ ۚ إِن يَشَأ يُذهِبكُم وَيَأتِ بِخَلقٍ جَديدٍ",
    "وَما ذٰلِكَ عَلَى اللَّهِ بِعَزيزٍ",
    "وَبَرَزوا لِلَّهِ جَميعًا فَقالَ الضُّعَفاءُ لِلَّذينَ استَكبَروا إِنّا كُنّا لَكُم تَبَعًا فَهَل أَنتُم مُغنونَ عَنّا مِن عَذابِ اللَّهِ مِن شَيءٍ ۚ قالوا لَو هَدانَا اللَّهُ لَهَدَيناكُم ۖ سَواءٌ عَلَينا أَجَزِعنا أَم صَبَرنا ما لَنا مِن مَحيصٍ",
    "وَقالَ الشَّيطانُ لَمّا قُضِيَ الأَمرُ إِنَّ اللَّهَ وَعَدَكُم وَعدَ الحَقِّ وَوَعَدتُكُم فَأَخلَفتُكُم ۖ وَما كانَ لِيَ عَلَيكُم مِن سُلطانٍ إِلّا أَن دَعَوتُكُم فَاستَجَبتُم لي ۖ فَلا تَلوموني وَلوموا أَنفُسَكُم ۖ ما أَنا بِمُصرِخِكُم وَما أَنتُم بِمُصرِخِيَّ ۖ إِنّي كَفَرتُ بِما أَشرَكتُمونِ مِن قَبلُ ۗ إِنَّ الظّالِمينَ لَهُم عَذابٌ أَليمٌ",
    "وَأُدخِلَ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ جَنّاتٍ تَجري مِن تَحتِهَا الأَنهارُ خالِدينَ فيها بِإِذنِ رَبِّهِم ۖ تَحِيَّتُهُم فيها سَلامٌ",
    "أَلَم تَرَ كَيفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصلُها ثابِتٌ وَفَرعُها فِي السَّماءِ",
    "تُؤتي أُكُلَها كُلَّ حينٍ بِإِذنِ رَبِّها ۗ وَيَضرِبُ اللَّهُ الأَمثالَ لِلنّاسِ لَعَلَّهُم يَتَذَكَّرونَ",
    "وَمَثَلُ كَلِمَةٍ خَبيثَةٍ كَشَجَرَةٍ خَبيثَةٍ اجتُثَّت مِن فَوقِ الأَرضِ ما لَها مِن قَرارٍ",
    "يُثَبِّتُ اللَّهُ الَّذينَ آمَنوا بِالقَولِ الثّابِتِ فِي الحَياةِ الدُّنيا وَفِي الآخِرَةِ ۖ وَيُضِلُّ اللَّهُ الظّالِمينَ ۚ وَيَفعَلُ اللَّهُ ما يَشاءُ",
    "۞ أَلَم تَرَ إِلَى الَّذينَ بَدَّلوا نِعمَتَ اللَّهِ كُفرًا وَأَحَلّوا قَومَهُم دارَ البَوارِ",
    "جَهَنَّمَ يَصلَونَها ۖ وَبِئسَ القَرارُ",
    "وَجَعَلوا لِلَّهِ أَندادًا لِيُضِلّوا عَن سَبيلِهِ ۗ قُل تَمَتَّعوا فَإِنَّ مَصيرَكُم إِلَى النّارِ",
    "قُل لِعِبادِيَ الَّذينَ آمَنوا يُقيمُوا الصَّلاةَ وَيُنفِقوا مِمّا رَزَقناهُم سِرًّا وَعَلانِيَةً مِن قَبلِ أَن يَأتِيَ يَومٌ لا بَيعٌ فيهِ وَلا خِلالٌ",
    "اللَّهُ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ وَأَنزَلَ مِنَ السَّماءِ ماءً فَأَخرَجَ بِهِ مِنَ الثَّمَراتِ رِزقًا لَكُم ۖ وَسَخَّرَ لَكُمُ الفُلكَ لِتَجرِيَ فِي البَحرِ بِأَمرِهِ ۖ وَسَخَّرَ لَكُمُ الأَنهارَ",
    "وَسَخَّرَ لَكُمُ الشَّمسَ وَالقَمَرَ دائِبَينِ ۖ وَسَخَّرَ لَكُمُ اللَّيلَ وَالنَّهارَ",
    "وَآتاكُم مِن كُلِّ ما سَأَلتُموهُ ۚ وَإِن تَعُدّوا نِعمَتَ اللَّهِ لا تُحصوها ۗ إِنَّ الإِنسانَ لَظَلومٌ كَفّارٌ",
    "وَإِذ قالَ إِبراهيمُ رَبِّ اجعَل هٰذَا البَلَدَ آمِنًا وَاجنُبني وَبَنِيَّ أَن نَعبُدَ الأَصنامَ",
    "رَبِّ إِنَّهُنَّ أَضلَلنَ كَثيرًا مِنَ النّاسِ ۖ فَمَن تَبِعَني فَإِنَّهُ مِنّي ۖ وَمَن عَصاني فَإِنَّكَ غَفورٌ رَحيمٌ",
    "رَبَّنا إِنّي أَسكَنتُ مِن ذُرِّيَّتي بِوادٍ غَيرِ ذي زَرعٍ عِندَ بَيتِكَ المُحَرَّمِ رَبَّنا لِيُقيمُوا الصَّلاةَ فَاجعَل أَفئِدَةً مِنَ النّاسِ تَهوي إِلَيهِم وَارزُقهُم مِنَ الثَّمَراتِ لَعَلَّهُم يَشكُرونَ",
    "رَبَّنا إِنَّكَ تَعلَمُ ما نُخفي وَما نُعلِنُ ۗ وَما يَخفىٰ عَلَى اللَّهِ مِن شَيءٍ فِي الأَرضِ وَلا فِي السَّماءِ",
    "الحَمدُ لِلَّهِ الَّذي وَهَبَ لي عَلَى الكِبَرِ إِسماعيلَ وَإِسحاقَ ۚ إِنَّ رَبّي لَسَميعُ الدُّعاءِ",
    "رَبِّ اجعَلني مُقيمَ الصَّلاةِ وَمِن ذُرِّيَّتي ۚ رَبَّنا وَتَقَبَّل دُعاءِ",
    "رَبَّنَا اغفِر لي وَلِوالِدَيَّ وَلِلمُؤمِنينَ يَومَ يَقومُ الحِسابُ",
    "وَلا تَحسَبَنَّ اللَّهَ غافِلًا عَمّا يَعمَلُ الظّالِمونَ ۚ إِنَّما يُؤَخِّرُهُم لِيَومٍ تَشخَصُ فيهِ الأَبصارُ",
    "مُهطِعينَ مُقنِعي رُءوسِهِم لا يَرتَدُّ إِلَيهِم طَرفُهُم ۖ وَأَفئِدَتُهُم هَواءٌ",
    "وَأَنذِرِ النّاسَ يَومَ يَأتيهِمُ العَذابُ فَيَقولُ الَّذينَ ظَلَموا رَبَّنا أَخِّرنا إِلىٰ أَجَلٍ قَريبٍ نُجِب دَعوَتَكَ وَنَتَّبِعِ الرُّسُلَ ۗ أَوَلَم تَكونوا أَقسَمتُم مِن قَبلُ ما لَكُم مِن زَوالٍ",
    "وَسَكَنتُم في مَساكِنِ الَّذينَ ظَلَموا أَنفُسَهُم وَتَبَيَّنَ لَكُم كَيفَ فَعَلنا بِهِم وَضَرَبنا لَكُمُ الأَمثالَ",
    "وَقَد مَكَروا مَكرَهُم وَعِندَ اللَّهِ مَكرُهُم وَإِن كانَ مَكرُهُم لِتَزولَ مِنهُ الجِبالُ",
    "فَلا تَحسَبَنَّ اللَّهَ مُخلِفَ وَعدِهِ رُسُلَهُ ۗ إِنَّ اللَّهَ عَزيزٌ ذُو انتِقامٍ",
    "يَومَ تُبَدَّلُ الأَرضُ غَيرَ الأَرضِ وَالسَّماواتُ ۖ وَبَرَزوا لِلَّهِ الواحِدِ القَهّارِ",
    "وَتَرَى المُجرِمينَ يَومَئِذٍ مُقَرَّنينَ فِي الأَصفادِ",
    "سَرابيلُهُم مِن قَطِرانٍ وَتَغشىٰ وُجوهَهُمُ النّارُ",
    "لِيَجزِيَ اللَّهُ كُلَّ نَفسٍ ما كَسَبَت ۚ إِنَّ اللَّهَ سَريعُ الحِسابِ",
    "هٰذا بَلاغٌ لِلنّاسِ وَلِيُنذَروا بِهِ وَلِيَعلَموا أَنَّما هُوَ إِلٰهٌ واحِدٌ وَلِيَذَّكَّرَ أُولُو الأَلبابِ"
  ]
}