{
  "id": 16,
  "name": "النحل",
  "transliteration": "An-Nahl",
  "translation": "The Bee",
  "verses": [
    "أَتىٰ أَمرُ اللَّهِ فَلا تَستَعجِلوهُ ۚ سُبحانَهُ وَتَعالىٰ عَمّا يُشرِكونَ",
    "يُنَزِّلُ المَلائِكَةَ بِالرّوحِ مِن أَمرِهِ عَلىٰ مَن يَشاءُ مِن عِبادِهِ أَن أَنذِروا أَنَّهُ لا إِلٰهَ إِلّا أَنا فَاتَّقونِ",
    "خَلَقَ السَّماواتِ وَالأَرضَ بِالحَقِّ ۚ تَعالىٰ عَمّا يُشرِكونَ",
    "خَلَقَ الإِنسانَ مِن نُطفَةٍ فَإِذا هُوَ خَصيمٌ مُبينٌ",
    "وَالأَنعامَ خَلَقَها ۗ لَكُم فيها دِفءٌ وَمَنافِعُ وَمِنها تَأكُلونَ",
    "وَلَكُم فيها جَمالٌ حينَ تُريحونَ وَحينَ تَسرَحونَ",
    "وَتَحمِلُ أَثقالَكُم إِلىٰ بَلَدٍ لَم تَكونوا بالِغيهِ إِلّا بِشِقِّ الأَنفُسِ ۚ إِنَّ رَبَّكُم لَرَءوفٌ رَحيمٌ",
    "وَالخَيلَ وَالبِغالَ وَالحَميرَ لِتَركَبوها وَزينَةً ۚ وَيَخلُقُ ما لا تَعلَمونَ",
    "وَعَلَى اللَّهِ قَصدُ السَّبيلِ وَمِنها جائِرٌ ۚ وَلَو شاءَ لَهَداكُم أَجمَعينَ",
    "هُوَ الَّذي أَنزَلَ مِنَ السَّماءِ ماءً ۖ لَكُم مِنهُ شَرابٌ وَمِنهُ شَجَرٌ فيهِ تُسيمونَ",
    "يُنبِتُ لَكُم بِهِ الزَّرعَ وَالزَّيتونَ وَالنَّخيلَ وَالأَعنابَ وَمِن كُلِّ الثَّمَراتِ ۗ إِنَّ في ذٰلِكَ لَآيَةً لِقَومٍ يَتَفَكَّرونَ",
    "وَسَخَّرَ لَكُمُ اللَّيلَ وَالنَّهارَ وَالشَّمسَ وَالقَمَرَ ۖ وَالنُّجومُ مُسَخَّراتٌ بِأَمرِهِ ۗ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يَعقِلونَ",
    "وَما ذَرَأَ لَكُم فِي الأَرضِ مُختَلِفًا أَلوانُهُ ۗ إِنَّ في ذٰلِكَ لَآيَةً لِقَومٍ يَذَّكَّرونَ",
    "وَهُوَ الَّذي سَخَّرَ البَحرَ لِتَأكُلوا مِنهُ لَحمًا طَرِيًّا وَتَستَخرِجوا مِنهُ حِليَةً تَلبَسونَها وَتَرَى الفُلكَ مَواخِرَ فيهِ وَلِتَبتَغوا مِن فَضلِهِ وَلَعَلَّكُم تَشكُرونَ",
    "وَأَلقىٰ فِي الأَرضِ رَواسِيَ أَن تَميدَ بِكُم وَأَنهارًا وَسُبُلًا لَعَلَّكُم تَهتَدونَ",
    "وَعَلاماتٍ ۚ وَبِالنَّجمِ هُم يَهتَدونَ",
    "أَفَمَن يَخلُقُ كَمَن لا يَخلُقُ ۗ أَفَلا تَذَكَّرونَ",
    "وَإِن تَعُدّوا نِعمَةَ اللَّهِ لا تُحصوها ۗ إِنَّ اللَّهَ لَغَفورٌ رَحيمٌ",
    "وَاللَّهُ يَعلَمُ ما تُسِرّونَ وَما تُعلِنونَ",
    "وَالَّذينَ يَدعونَ مِن دونِ اللَّهِ لا يَخلُقونَ شَيئًا وَهُم يُخلَقونَ",
    "أَمواتٌ غَيرُ أَحياءٍ ۖ وَما يَشعُرونَ أَيّانَ يُبعَثونَ",
    "إِلٰهُكُم إِلٰهٌ واحِدٌ ۚ فَالَّذينَ لا يُؤمِنونَ بِالآخِرَةِ قُلوبُهُم مُنكِرَةٌ وَهُم مُستَكبِرونَ",
    "لا جَرَمَ أَنَّ اللَّهَ يَعلَمُ ما يُسِرّونَ وَما يُعلِنونَ ۚ إِنَّهُ لا يُحِبُّ المُستَكبِرينَ",
    "وَإِذا قيلَ لَهُم ماذا أَنزَلَ رَبُّكُم ۙ قالوا أَساطيرُ الأَوَّلينَ",
    "لِيَحمِلوا أَوزارَهُم كامِلَةً يَومَ القِيامَةِ ۙ وَمِن أَوزارِ الَّذينَ يُضِلّونَهُم بِغَيرِ عِلمٍ ۗ أَلا ساءَ ما يَزِرونَ",
    "قَد مَكَرَ الَّذينَ مِن قَبلِهِم فَأَتَى اللَّهُ بُنيانَهُم مِنَ القَواعِدِ فَخَرَّ عَلَيهِمُ السَّقفُ مِن فَوقِهِم وَأَتاهُمُ العَذابُ مِن حَيثُ لا يَشعُرونَ",
    "ثُمَّ يَومَ القِيامَةِ يُخزيهِم وَيَقولُ أَينَ شُرَكائِيَ الَّذينَ كُنتُم تُشاقّونَ فيهِم ۚ قالَ الَّذينَ أوتُوا العِلمَ إِنَّ الخِزيَ اليَومَ وَالسّوءَ عَلَى الكافِرينَ",
    "الَّذينَ تَتَوَفّاهُمُ المَلائِكَةُ ظالِمي أَنفُسِهِم ۖ فَأَلقَوُا السَّلَمَ ما كُنّا نَعمَلُ مِن سوءٍ ۚ بَلىٰ إِنَّ اللَّهَ عَليمٌ بِما كُنتُم تَعمَلونَ",
    "فَادخُلوا أَبوابَ جَهَنَّمَ خالِدينَ فيها ۖ فَلَبِئسَ مَثوَى المُتَكَبِّرينَ",
    "۞ وَقيلَ لِلَّذينَ اتَّقَوا ماذا أَنزَلَ رَبُّكُم ۚ قالوا خَيرًا ۗ لِلَّذينَ أَحسَنوا في هٰذِهِ الدُّنيا حَسَنَةٌ ۚ وَلَدارُ الآخِرَةِ خَيرٌ ۚ وَلَنِعمَ دارُ المُتَّقينَ",
    "جَنّاتُ عَدنٍ يَدخُلونَها تَجري مِن تَحتِهَا الأَنهارُ ۖ لَهُم فيها ما يَشاءونَ ۚ كَذٰلِكَ يَجزِي اللَّهُ المُتَّقينَ",
    "الَّذينَ تَتَوَفّاهُمُ المَلائِكَةُ طَيِّبينَ ۙ يَقولونَ سَلامٌ عَلَيكُمُ ادخُلُوا الجَنَّةَ بِما كُنتُم تَعمَلونَ",
    "هَل يَنظُرونَ إِلّا أَن تَأتِيَهُمُ المَلائِكَةُ أَو يَأتِيَ أَمرُ رَبِّكَ ۚ كَذٰلِكَ فَعَلَ الَّذينَ مِن قَبلِهِم ۚ وَما ظَلَمَهُمُ اللَّهُ وَلٰكِن كانوا أَنفُسَهُم يَظلِمونَ",
    "فَأَصابَهُم سَيِّئَاتُ ما عَمِلوا وَحاقَ بِهِم ما كانوا بِهِ يَستَهزِئونَ",
    "وَقالَ الَّذينَ أَشرَكوا لَو شاءَ اللَّهُ ما عَبَدنا مِن دونِهِ مِن شَيءٍ نَحنُ وَلا آباؤُنا وَلا حَرَّمنا مِن دونِهِ مِن شَيءٍ ۚ كَذٰلِكَ فَعَلَ الَّذينَ مِن قَبلِهِم ۚ فَهَل عَلَى الرُّسُلِ إِلَّا البَلاغُ المُبينُ",
    "وَلَقَد بَعَثنا في كُلِّ أُمَّةٍ رَسولًا أَنِ اعبُدُوا اللَّهَ وَاجتَنِبُوا الطّاغوتَ ۖ فَمِنهُم مَن هَدَى اللَّهُ وَمِنهُم مَن حَقَّت عَلَيهِ الضَّلالَةُ ۚ فَسيروا فِي الأَرضِ فَانظُروا كَيفَ كانَ عاقِبَةُ المُكَذِّبينَ",
    "إِن تَحرِص عَلىٰ هُداهُم فَإِنَّ اللَّهَ لا يَهدي مَن يُضِلُّ ۖ وَما لَهُم مِن ناصِرينَ",
    "وَأَقسَموا بِاللَّهِ جَهدَ أَيمانِهِم ۙ لا يَبعَثُ اللَّهُ مَن يَموتُ ۚ بَلىٰ وَعدًا عَلَيهِ حَقًّا وَلٰكِنَّ أَكثَرَ النّاسِ لا يَعلَمونَ",
    "لِيُبَيِّنَ لَهُمُ الَّذي يَختَلِفونَ فيهِ وَلِيَعلَمَ الَّذينَ كَفَروا أَنَّهُم كانوا كاذِبينَ",
    "إِنَّما قَولُنا لِشَيءٍ إِذا أَرَدناهُ أَن نَقولَ لَهُ كُن فَيَكونُ",
    "وَالَّذينَ هاجَروا فِي اللَّهِ مِن بَعدِ ما ظُلِموا لَنُبَوِّئَنَّهُم فِي الدُّنيا حَسَنَةً ۖ وَلَأَجرُ الآخِرَةِ أَكبَرُ ۚ لَو كانوا يَعلَمونَ",
    "الَّذينَ صَبَروا وَعَلىٰ رَبِّهِم يَتَوَكَّلونَ",
    "وَما أَرسَلنا مِن قَبلِكَ إِلّا رِجالًا نوحي إِلَيهِم ۚ فَاسأَلوا أَهلَ الذِّكرِ إِن كُنتُم لا تَعلَمونَ",
    "بِالبَيِّناتِ وَالزُّبُرِ ۗ وَأَنزَلنا إِلَيكَ الذِّكرَ لِتُبَيِّنَ لِلنّاسِ ما نُزِّلَ إِلَيهِم وَلَعَلَّهُم يَتَفَكَّرونَ",
    "أَفَأَمِنَ الَّذينَ مَكَرُوا السَّيِّئَاتِ أَن يَخسِفَ اللَّهُ بِهِمُ الأَرضَ أَو يَأتِيَهُمُ العَذابُ مِن حَيثُ لا يَشعُرونَ",
    "أَو يَأخُذَهُم في تَقَلُّبِهِم فَما هُم بِمُعجِزينَ",
    "أَو يَأخُذَهُم عَلىٰ تَخَوُّفٍ فَإِنَّ رَبَّكُم لَرَءوفٌ رَحيمٌ",
    "أَوَلَم يَرَوا إِلىٰ ما خَلَقَ اللَّهُ مِن شَيءٍ يَتَفَيَّأُ ظِلالُهُ عَنِ اليَمينِ وَالشَّمائِلِ سُجَّدًا لِلَّهِ وَهُم داخِرونَ",
    "وَلِلَّهِ يَسجُدُ ما فِي السَّماواتِ وَما فِي الأَرضِ مِن دابَّةٍ وَالمَلائِكَةُ وَهُم لا يَستَكبِرونَ",
    "يَخافونَ رَبَّهُم مِن فَوقِهِم وَيَفعَلونَ ما يُؤمَرونَ ۩",
    "۞ وَقالَ اللَّهُ لا تَتَّخِذوا إِلٰهَينِ اثنَينِ ۖ إِنَّما هُوَ إِلٰهٌ واحِدٌ ۖ فَإِيّايَ فَارهَبونِ",
    "وَلَهُ ما فِي السَّماواتِ وَالأَرضِ وَلَهُ الدّينُ واصِبًا ۚ أَفَغَيرَ اللَّهِ تَتَّقونَ",
    "وَما بِكُم مِن نِعمَةٍ فَمِنَ اللَّهِ ۖ ثُمَّ إِذا مَسَّكُمُ الضُّرُّ فَإِلَيهِ تَجأَرونَ",
    "ثُمَّ إِذا كَشَفَ الضُّرَّ عَنكُم إِذا فَريقٌ مِنكُم بِرَبِّهِم يُشرِكونَ",
    "لِيَكفُروا بِما آتَيناهُم ۚ فَتَمَتَّعوا ۖ فَسَوفَ تَعلَمونَ",
    "وَيَجعَلونَ لِما لا يَعلَمونَ نَصيبًا مِمّا رَزَقناهُم ۗ تَاللَّهِ لَتُسأَلُنَّ عَمّا كُنتُم تَفتَرونَ",
    "وَيَجعَلونَ لِلَّهِ البَناتِ سُبحانَهُ ۙ وَلَهُم ما يَشتَهونَ",
    "وَإِذا بُشِّرَ أَحَدُهُم بِالأُنثىٰ ظَلَّ وَجهُهُ مُسوَدًّا وَهُوَ كَظيمٌ",
    "يَتَوارىٰ مِنَ القَومِ مِن سوءِ ما بُشِّرَ بِهِ ۚ أَيُمسِكُهُ عَلىٰ هونٍ أَم يَدُسُّهُ فِي التُّرابِ ۗ أَلا ساءَ ما يَحكُمونَ",
    "لِلَّذينَ لا يُؤمِنونَ بِالآخِرَةِ مَثَلُ السَّوءِ ۖ وَلِلَّهِ المَثَلُ الأَعلىٰ ۚ وَهُوَ العَزيزُ الحَكيمُ",
    "وَلَو يُؤاخِذُ اللَّهُ النّاسَ بِظُلمِهِم ما تَرَكَ عَلَيها مِن دابَّةٍ وَلٰكِن يُؤَخِّرُهُم إِلىٰ أَجَلٍ مُسَمًّى ۖ فَإِذا جاءَ أَجَلُهُم لا يَستَأخِرونَ ساعَةً ۖ وَلا يَستَقدِمونَ",
    "وَيَجعَلونَ لِلَّهِ ما يَكرَهونَ وَتَصِفُ أَلسِنَتُهُمُ الكَذِبَ أَنَّ لَهُمُ الحُسنىٰ ۖ لا جَرَمَ أَنَّ لَهُمُ النّارَ وَأَنَّهُم مُفرَطونَ",
    "تَاللَّهِ لَقَد أَرسَلنا إِلىٰ أُمَمٍ مِن قَبلِكَ فَزَيَّنَ لَهُمُ الشَّيطانُ أَعمالَهُم فَهُوَ وَلِيُّهُمُ اليَومَ وَلَهُم عَذابٌ أَليمٌ",
    "وَما أَنزَلنا عَلَيكَ الكِتابَ إِلّا لِتُبَيِّنَ لَهُمُ الَّذِي اختَلَفوا فيهِ ۙ وَهُدًى وَرَحمَةً لِقَومٍ يُؤمِنونَ",
    "وَاللَّهُ أَنزَلَ مِنَ السَّماءِ ماءً فَأَحيا بِهِ الأَرضَ بَعدَ مَوتِها ۚ إِنَّ في ذٰلِكَ لَآيَةً لِقَومٍ يَسمَعونَ",
    "وَإِنَّ لَكُم فِي الأَنعامِ لَعِبرَةً ۖ نُسقيكُم مِمّا في بُطونِهِ مِن بَينِ فَرثٍ وَدَمٍ لَبَنًا خالِصًا سائِغًا لِلشّارِبينَ",
    "وَمِن ثَمَراتِ النَّخيلِ وَالأَعنابِ تَتَّخِذونَ مِنهُ سَكَرًا وَرِزقًا حَسَنًا ۗ إِنَّ في ذٰلِكَ لَآيَةً لِقَومٍ يَعقِلونَ",
    "وَأَوحىٰ رَبُّكَ إِلَى النَّحلِ أَنِ اتَّخِذي مِنَ الجِبالِ بُيوتًا وَمِنَ الشَّجَرِ وَمِمّا يَعرِشونَ",
    "ثُمَّ كُلي مِن كُلِّ الثَّمَراتِ فَاسلُكي سُبُلَ رَبِّكِ ذُلُلًا ۚ يَخرُجُ مِن بُطونِها شَرابٌ مُختَلِفٌ أَلوانُهُ فيهِ شِفاءٌ لِلنّاسِ ۗ إِنَّ في ذٰلِكَ لَآيَةً لِقَومٍ يَتَفَكَّرونَ",
    "وَاللَّهُ خَلَقَكُم ثُمَّ يَتَوَفّاكُم ۚ وَمِنكُم مَن يُرَدُّ إِلىٰ أَرذَلِ العُمُرِ لِكَي لا يَعلَمَ بَعدَ عِلمٍ شَيئًا ۚ إِنَّ اللَّهَ عَليمٌ قَديرٌ",
    "وَاللَّهُ فَضَّلَ بَعضَكُم عَلىٰ بَعضٍ فِي الرِّزقِ ۚ فَمَا الَّذينَ فُضِّلوا بِرادّي رِزقِهِم عَلىٰ ما مَلَكَت أَيمانُهُم فَهُم فيهِ سَواءٌ ۚ أَفَبِنِعمَةِ اللَّهِ يَجحَدونَ",
    "وَاللَّهُ جَعَلَ لَكُم مِن أَنفُسِكُم أَزواجًا وَجَعَلَ لَكُم مِن أَزواجِكُم بَنينَ وَحَفَدَةً وَرَزَقَكُم مِنَ الطَّيِّباتِ ۚ أَفَبِالباطِلِ يُؤمِنونَ وَبِنِعمَتِ اللَّهِ هُم يَكفُرونَ",
    "وَيَعبُدونَ مِن دونِ اللَّهِ ما لا يَملِكُ لَهُم رِزقًا مِنَ السَّماواتِ وَالأَرضِ شَيئًا وَلا يَستَطيعونَ",
    "فَلا تَضرِبوا لِلَّهِ الأَمثالَ ۚ إِنَّ اللَّهَ يَعلَمُ وَأَنتُم لا تَعلَمونَ",
    "۞ ضَرَبَ اللَّهُ مَثَلًا عَبدًا مَملوكًا لا يَقدِرُ عَلىٰ شَيءٍ وَمَن رَزَقناهُ مِنّا رِزقًا حَسَنًا فَهُوَ يُنفِقُ مِنهُ سِرًّا وَجَهرًا ۖ هَل يَستَوونَ ۚ الحَمدُ لِلَّهِ ۚ بَل أَكثَرُهُم لا يَعلَمونَ",
    "وَضَرَبَ اللَّهُ مَثَلًا رَجُلَينِ أَحَدُهُما أَبكَمُ لا يَقدِرُ عَلىٰ شَيءٍ وَهُوَ كَلٌّ عَلىٰ مَولاهُ أَينَما يُوَجِّههُ لا يَأتِ بِخَيرٍ ۖ هَل يَستَوي هُوَ وَمَن يَأمُرُ بِالعَدلِ ۙ وَهُوَ عَلىٰ صِراطٍ مُستَقيمٍ",
    "وَلِلَّهِ غَيبُ السَّماواتِ وَالأَرضِ ۚ وَما أَمرُ السّاعَةِ إِلّا كَلَمحِ البَصَرِ أَو هُوَ أَقرَبُ ۚ إِنَّ اللَّهَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "وَاللَّهُ أَخرَجَكُم مِن بُطونِ أُمَّهاتِكُم لا تَعلَمونَ شَيئًا وَجَعَلَ لَكُمُ السَّمعَ وَالأَبصارَ وَالأَفئِدَةَ ۙ لَعَلَّكُم تَشكُرونَ",
    "أَلَم يَرَوا إِلَى الطَّيرِ مُسَخَّراتٍ في جَوِّ السَّماءِ ما يُمسِكُهُنَّ إِلَّا اللَّهُ ۗ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يُؤمِنونَ",
    "وَاللَّهُ جَعَلَ لَكُم مِن بُيوتِكُم سَكَنًا وَجَعَلَ لَكُم مِن جُلودِ الأَنعامِ بُيوتًا تَستَخِفّونَها يَومَ ظَعنِكُم وَيَومَ إِقامَتِكُم ۙ وَمِن أَصوافِها وَأَوبارِها وَأَشعارِها أَثاثًا وَمَتاعًا إِلىٰ حينٍ",
    "وَاللَّهُ جَعَلَ لَكُم مِمّا خَلَقَ ظِلالًا وَجَعَلَ لَكُم مِنَ الجِبالِ أَكنانًا وَجَعَلَ لَكُم سَرابيلَ تَقيكُمُ الحَرَّ وَسَرابيلَ تَقيكُم بَأسَكُم ۚ كَذٰلِكَ يُتِمُّ نِعمَتَهُ عَلَيكُم لَعَلَّكُم تُسلِمونَ",
    "فَإِن تَوَلَّوا فَإِنَّما عَلَيكَ البَلاغُ المُبينُ",
    "يَعرِفونَ نِعمَتَ اللَّهِ ثُمَّ يُنكِرونَها وَأَكثَرُهُمُ الكافِرونَ",
    "وَيَومَ نَبعَثُ مِن كُلِّ أُمَّةٍ شَهيدًا ثُمَّ لا يُؤذَنُ لِلَّذينَ كَفَروا وَلا هُم يُستَعتَبونَ",
    "وَإِذا رَأَى الَّذينَ ظَلَمُوا العَذابَ فَلا يُخَفَّفُ عَنهُم وَلا هُم يُنظَرونَ",
    "وَإِذا رَأَى الَّذينَ أَشرَكوا شُرَكاءَهُم قالوا رَبَّنا هٰؤُلاءِ شُرَكاؤُنَا الَّذينَ كُنّا نَدعو مِن دونِكَ ۖ فَأَلقَوا إِلَيهِمُ القَولَ إِنَّكُم لَكاذِبونَ",
    "وَأَلقَوا إِلَى اللَّهِ يَومَئِذٍ السَّلَمَ ۖ وَضَلَّ عَنهُم ما كانوا يَفتَرونَ",
    "الَّذينَ كَفَروا وَصَدّوا عَن سَبيلِ اللَّهِ زِدناهُم عَذابًا فَوقَ العَذابِ بِما كانوا يُفسِدونَ",
    "وَيَومَ نَبعَثُ في كُلِّ أُمَّةٍ شَهيدًا عَلَيهِم مِن أَنفُسِهِم ۖ وَجِئنا بِكَ شَهيدًا عَلىٰ هٰؤُلاءِ ۚ وَنَزَّلنا عَلَيكَ الكِتابَ تِبيانًا لِكُلِّ شَيءٍ وَهُدًى وَرَحمَةً وَبُشرىٰ لِلمُسلِمينَ",
    "۞ إِنَّ اللَّهَ يَأمُرُ بِالعَدلِ وَالإِحسانِ وَإيتاءِ ذِي القُربىٰ وَيَنهىٰ عَنِ الفَحشاءِ وَالمُنكَرِ وَالبَغيِ ۚ يَعِظُكُم لَعَلَّكُم تَذَكَّرونَ",
    "وَأَوفوا بِعَهدِ اللَّهِ إِذا عاهَدتُم وَلا تَنقُضُوا الأَيمانَ بَعدَ تَوكيدِها وَقَد جَعَلتُمُ اللَّهَ عَلَيكُم كَفيلًا ۚ إِنَّ اللَّهَ يَعلَمُ ما تَفعَلونَ",
    "وَلا تَكونوا كَالَّتي نَقَضَت غَزلَها مِن بَعدِ قُوَّةٍ أَنكاثًا تَتَّخِذونَ أَيمانَكُم دَخَلًا بَينَكُم أَن تَكونَ أُمَّةٌ هِيَ أَربىٰ مِن أُمَّةٍ ۚ إِنَّما يَبلوكُمُ اللَّهُ بِهِ ۚ وَلَيُبَيِّنَنَّ لَكُم يَومَ القِيامَةِ ما كُنتُم فيهِ تَختَلِفونَ",
    "وَلَو شاءَ اللَّهُ لَجَعَلَكُم أُمَّةً واحِدَةً وَلٰكِن يُضِلُّ مَن يَشاءُ وَيَهدي مَن يَشاءُ ۚ وَلَتُسأَلُنَّ عَمّا كُنتُم تَعمَلونَ",
    "وَلا تَتَّخِذوا أَيمانَكُم دَخَلًا بَينَكُم فَتَزِلَّ قَدَمٌ بَعدَ ثُبوتِها وَتَذوقُوا السّوءَ بِما صَدَدتُم عَن سَبيلِ اللَّهِ ۖ وَلَكُم عَذابٌ عَظيمٌ",
    "وَلا تَشتَروا بِعَهدِ اللَّهِ ثَمَنًا قَليلًا ۚ إِنَّما عِندَ اللَّهِ هُوَ خَيرٌ لَكُم إِن كُنتُم تَعلَمونَ",
    "ما عِندَكُم يَنفَدُ ۖ وَما عِندَ اللَّهِ باقٍ ۗ وَلَنَجزِيَنَّ الَّذينَ صَبَروا أَجرَهُم بِأَحسَنِ ما كانوا يَعمَلونَ",
    "مَن عَمِلَ صالِحًا مِن ذَكَرٍ أَو أُنثىٰ وَهُوَ مُؤمِنٌ فَلَنُحيِيَنَّهُ حَياةً طَيِّبَةً ۖ وَلَنَجزِيَنَّهُم أَجرَهُم بِأَحسَنِ ما كانوا يَعمَلونَ",
    "فَإِذا قَرَأتَ القُرآنَ فَاستَعِذ بِاللَّهِ مِنَ الشَّيطانِ الرَّجيمِ",
    "إِنَّهُ لَيسَ لَهُ سُلطانٌ عَلَى الَّذينَ آمَنوا وَعَلىٰ رَبِّهِم يَتَوَكَّلونَ",
    "إِنَّما سُلطانُهُ عَلَى الَّذينَ يَتَوَلَّونَهُ وَالَّذينَ هُم بِهِ مُشرِكونَ",
    "وَإِذا بَدَّلنا آيَةً مَكانَ آيَةٍ ۙ وَاللَّهُ أَعلَمُ بِما يُنَزِّلُ قالوا إِنَّما أَنتَ مُفتَرٍ ۚ بَل أَكثَرُهُم لا يَعلَمونَ",
    "قُل نَزَّلَهُ روحُ القُدُسِ مِن رَبِّكَ بِالحَقِّ لِيُثَبِّتَ الَّذينَ آمَنوا وَهُدًى وَبُشرىٰ لِلمُسلِمينَ",
    "وَلَقَد نَعلَمُ أَنَّهُم يَقولونَ إِنَّما يُعَلِّمُهُ بَشَرٌ ۗ لِسانُ الَّذي يُلحِدونَ إِلَيهِ أَعجَمِيٌّ وَهٰذا لِسانٌ عَرَبِيٌّ مُبينٌ",
    "إِنَّ الَّذينَ لا يُؤمِنونَ بِآياتِ اللَّهِ لا يَهديهِمُ اللَّهُ وَلَهُم عَذابٌ أَليمٌ",
    "إِنَّما يَفتَرِي الكَذِبَ الَّذينَ لا يُؤمِنونَ بِآياتِ اللَّهِ ۖ وَأُولٰئِكَ هُمُ الكاذِبونَ",
    "مَن كَفَرَ بِاللَّهِ مِن بَعدِ إيمانِهِ إِلّا مَن أُكرِهَ وَقَلبُهُ مُطمَئِنٌّ بِالإيمانِ وَلٰكِن مَن شَرَحَ بِالكُفرِ صَدرًا فَعَلَيهِم غَضَبٌ مِنَ اللَّهِ وَلَهُم عَذابٌ عَظيمٌ",
    "ذٰلِكَ بِأَنَّهُمُ استَحَبُّوا الحَياةَ الدُّنيا عَلَى الآخِرَةِ وَأَنَّ اللَّهَ لا يَهدِي القَومَ الكافِرينَ",
    "أُولٰئِكَ الَّذينَ طَبَعَ اللَّهُ عَلىٰ قُلوبِهِم وَسَمعِهِم وَأَبصارِهِم ۖ وَأُولٰئِكَ هُمُ الغافِلونَ",
    "لا جَرَمَ أَنَّهُم فِي الآخِرَةِ هُمُ الخاسِرونَ",
    "ثُمَّ إِنَّ رَبَّكَ لِلَّذينَ هاجَروا مِن بَعدِ ما فُتِنوا ثُمَّ جاهَدوا وَصَبَروا إِنَّ رَبَّكَ مِن بَعدِها لَغَفورٌ رَحيمٌ",
    "۞ يَومَ تَأتي كُلُّ نَفسٍ تُجادِلُ عَن نَفسِها وَتُوَفّىٰ كُلُّ نَفسٍ ما عَمِلَت وَهُم لا يُظلَمونَ",
    "وَضَرَبَ اللَّهُ مَثَلًا قَريَةً كانَت آمِنَةً مُطمَئِنَّةً يَأتيها رِزقُها رَغَدًا مِن كُلِّ مَكانٍ فَكَفَرَت بِأَنعُمِ اللَّهِ فَأَذاقَهَا اللَّهُ لِباسَ الجوعِ وَالخَوفِ بِما كانوا يَصنَعونَ",
    "وَلَقَد جاءَهُم رَسولٌ مِنهُم فَكَذَّبوهُ فَأَخَذَهُمُ العَذابُ وَهُم ظالِمونَ",
    "فَكُلوا مِمّا رَزَقَكُمُ اللَّهُ حَلالًا طَيِّبًا وَاشكُروا نِعمَتَ اللَّهِ إِن كُنتُم إِيّاهُ تَعبُدونَ",
    "إِنَّما حَرَّمَ عَلَيكُمُ المَيتَةَ وَالدَّمَ وَلَحمَ الخِنزيرِ وَما أُهِلَّ لِغَيرِ اللَّهِ بِهِ ۖ فَمَنِ اضطُرَّ غَيرَ باغٍ وَلا عادٍ فَإِنَّ اللَّهَ غَفورٌ رَحيمٌ",
    "وَلا تَقولوا لِما تَصِفُ أَلسِنَتُكُمُ الكَذِبَ هٰذا حَلالٌ وَهٰذا حَرامٌ لِتَفتَروا عَلَى اللَّهِ الكَذِبَ ۚ إِنَّ الَّذينَ يَفتَرونَ عَلَى اللَّهِ الكَذِبَ لا يُفلِحونَ",
    "مَتاعٌ قَليلٌ وَلَهُم عَذابٌ أَليمٌ",
    "وَعَلَى الَّذينَ هادوا حَرَّمنا ما قَصَصنا عَلَيكَ مِن قَبلُ ۖ وَما ظَلَمناهُم وَلٰكِن كانوا أَنفُسَهُم يَظلِمونَ",
    "ثُمَّ إِنَّ رَبَّكَ لِلَّذينَ عَمِلُوا السّوءَ بِجَهالَةٍ ثُمَّ تابوا مِن بَعدِ ذٰلِكَ وَأَصلَحوا إِنَّ رَبَّكَ مِن بَعدِها لَغَفورٌ رَحيمٌ",
    "إِنَّ إِبراهيمَ كانَ أُمَّةً قانِتًا لِلَّهِ حَنيفًا وَلَم يَكُ مِنَ المُشرِكينَ",
    "شاكِرًا لِأَنعُمِهِ ۚ اجتَباهُ وَهَداهُ إِلىٰ صِراطٍ مُستَقيمٍ",
    "وَآتَيناهُ فِي الدُّنيا حَسَنَةً ۖ وَإِنَّهُ فِي الآخِرَةِ لَمِنَ الصّالِحينَ",
    "ثُمَّ أَوحَينا إِلَيكَ أَنِ اتَّبِع مِلَّةَ إِبراهيمَ حَنيفًا ۖ وَما كانَ مِنَ المُشرِكينَ",
    "إِنَّما جُعِلَ السَّبتُ عَلَى الَّذينَ اختَلَفوا فيهِ ۚ وَإِنَّ رَبَّكَ لَيَحكُمُ بَينَهُم يَومَ القِيامَةِ فيما كانوا فيهِ يَختَلِفونَ",
    "ادعُ إِلىٰ سَبيلِ رَبِّكَ بِالحِكمَةِ وَالمَوعِظَةِ الحَسَنَةِ ۖ وَجادِلهُم بِالَّتي هِيَ أَحسَنُ ۚ إِنَّ رَبَّكَ هُوَ أَعلَمُ بِمَن ضَلَّ عَن سَبيلِهِ ۖ وَهُوَ أَعلَمُ بِالمُهتَدينَ",
    "وَإِن عاقَبتُم فَعاقِبوا بِمِثلِ ما عوقِبتُم بِهِ ۖ وَلَئِن صَبَرتُم لَهُوَ خَيرٌ لِلصّابِرينَ",
    "وَاصبِر وَما صَبرُكَ إِلّا بِاللَّهِ ۚ وَلا تَحزَن عَلَيهِم وَلا تَكُ في ضَيقٍ مِمّا يَمكُرونَ",
    "إِنَّ اللَّهَ مَعَ الَّذينَ اتَّقَوا وَالَّذينَ هُم مُحسِنونَ"
  ]
}