{
  "id": 17,
  "name": "الإسراء",
  "transliteration": "Al-Isra",
  "translation": "The Night Journey",
  "verses": [
    "سُبحانَ الَّذي أَسرىٰ بِعَبدِهِ لَيلًا مِنَ المَسجِدِ الحَرامِ إِلَى المَسجِدِ الأَقصَى الَّذي بارَكنا حَولَهُ لِنُرِيَهُ مِن آياتِنا ۚ إِنَّهُ هُوَ السَّميعُ البَصيرُ",
    "وَآتَينا موسَى الكِتابَ وَجَعَلناهُ هُدًى لِبَني إِسرائيلَ أَلّا تَتَّخِذوا مِن دوني وَكيلًا",
    "ذُرِّيَّةَ مَن حَمَلنا مَعَ نوحٍ ۚ إِنَّهُ كانَ عَبدًا شَكورًا",
    "وَقَضَينا إِلىٰ بَني إِسرائيلَ فِي الكِتابِ لَتُفسِدُنَّ فِي الأَرضِ مَرَّتَينِ وَلَتَعلُنَّ عُلُوًّا كَبيرًا",
    "فَإِذا جاءَ وَعدُ أولاهُما بَعَثنا عَلَيكُم عِبادًا لَنا أُولي بَأسٍ شَديدٍ فَجاسوا خِلالَ الدِّيارِ ۚ وَكانَ وَعدًا مَفعولًا",
    "ثُمَّ رَدَدنا لَكُمُ الكَرَّةَ عَلَيهِم وَأَمدَدناكُم بِأَموالٍ وَبَنينَ وَجَعَلناكُم أَكثَرَ نَفيرًا",
    "إِن أَحسَنتُم أَحسَنتُم لِأَنفُسِكُم ۖ وَإِن أَسَأتُم فَلَها ۚ فَإِذا جاءَ وَعدُ الآخِرَةِ لِيَسوءوا وُجوهَكُم وَلِيَدخُلُوا المَسجِدَ كَما دَخَلوهُ أَوَّلَ مَرَّةٍ وَلِيُتَبِّروا ما عَلَوا تَتبيرًا",
    "عَسىٰ رَبُّكُم أَن يَرحَمَكُم ۚ وَإِن عُدتُم عُدنا ۘ وَجَعَلنا جَهَنَّمَ لِلكافِرينَ حَصيرًا",
    "إِنَّ هٰذَا القُرآنَ يَهدي لِلَّتي هِيَ أَقوَمُ وَيُبَشِّرُ المُؤمِنينَ الَّذينَ يَعمَلونَ الصّالِحاتِ أَنَّ لَهُم أَجرًا كَبيرًا",
    "وَأَنَّ الَّذينَ لا يُؤمِنونَ بِالآخِرَةِ أَعتَدنا لَهُم عَذابًا أَليمًا",
    "وَيَدعُ الإِنسانُ بِالشَّرِّ دُعاءَهُ بِالخَيرِ ۖ وَكانَ الإِنسانُ عَجولًا",
    "وَجَعَلنَا اللَّيلَ وَالنَّهارَ آيَتَينِ ۖ فَمَحَونا آيَةَ اللَّيلِ وَجَعَلنا آيَةَ النَّهارِ مُبصِرَةً لِتَبتَغوا فَضلًا مِن رَبِّكُم وَلِتَعلَموا عَدَدَ السِّنينَ وَالحِسابَ ۚ وَكُلَّ شَيءٍ فَصَّلناهُ تَفصيلًا",
    "وَكُلَّ إِنسانٍ أَلزَمناهُ طائِرَهُ في عُنُقِهِ ۖ وَنُخرِجُ لَهُ يَومَ القِيامَةِ كِتابًا يَلقاهُ مَنشورًا",
    "اقرَأ كِتابَكَ كَفىٰ بِنَفسِكَ اليَومَ عَلَيكَ حَسيبًا",
    "مَنِ اهتَدىٰ فَإِنَّما يَهتَدي لِنَفسِهِ ۖ وَمَن ضَلَّ فَإِنَّما يَضِلُّ عَلَيها ۚ وَلا تَزِرُ وازِرَةٌ وِزرَ أُخرىٰ ۗ وَما كُنّا مُعَذِّبينَ حَتّىٰ نَبعَثَ رَسولًا",
    "وَإِذا أَرَدنا أَن نُهلِكَ قَريَةً أَمَرنا مُترَفيها فَفَسَقوا فيها فَحَقَّ عَلَيهَا القَولُ فَدَمَّرناها تَدميرًا",
    "وَكَم أَهلَكنا مِنَ القُرونِ مِن بَعدِ نوحٍ ۗ وَكَفىٰ بِرَبِّكَ بِذُنوبِ عِبادِهِ خَبيرًا بَصيرًا",
    "مَن كانَ يُريدُ العاجِلَةَ عَجَّلنا لَهُ فيها ما نَشاءُ لِمَن نُريدُ ثُمَّ جَعَلنا لَهُ جَهَنَّمَ يَصلاها مَذمومًا مَدحورًا",
    "وَمَن أَرادَ الآخِرَةَ وَسَعىٰ لَها سَعيَها وَهُوَ مُؤمِنٌ فَأُولٰئِكَ كانَ سَعيُهُم مَشكورًا",
    "كُلًّا نُمِدُّ هٰؤُلاءِ وَهٰؤُلاءِ مِن عَطاءِ رَبِّكَ ۚ وَما كانَ عَطاءُ رَبِّكَ مَحظورًا",
    "انظُر كَيفَ فَضَّلنا بَعضَهُم عَلىٰ بَعضٍ ۚ وَلَلآخِرَةُ أَكبَرُ دَرَجاتٍ وَأَكبَرُ تَفضيلًا",
    "لا تَجعَل مَعَ اللَّهِ إِلٰهًا آخَرَ فَتَقعُدَ مَذمومًا مَخذولًا",
    "۞ وَقَضىٰ رَبُّكَ أَلّا تَعبُدوا إِلّا إِيّاهُ وَبِالوالِدَينِ إِحسانًا ۚ إِمّا يَبلُغَنَّ عِندَكَ الكِبَرَ أَحَدُهُما أَو كِلاهُما فَلا تَقُل لَهُما أُفٍّ وَلا تَنهَرهُما وَقُل لَهُما قَولًا كَريمًا",
    "وَاخفِض لَهُما جَناحَ الذُّلِّ مِنَ الرَّحمَةِ وَقُل رَبِّ ارحَمهُما كَما رَبَّياني صَغيرًا",
    "رَبُّكُم أَعلَمُ بِما في نُفوسِكُم ۚ إِن تَكونوا صالِحينَ فَإِنَّهُ كانَ لِلأَوّابينَ غَفورًا",
    "وَآتِ ذَا القُربىٰ حَقَّهُ وَالمِسكينَ وَابنَ السَّبيلِ وَلا تُبَذِّر تَبذيرًا",
    "إِنَّ المُبَذِّرينَ كانوا إِخوانَ الشَّياطينِ ۖ وَكانَ الشَّيطانُ لِرَبِّهِ كَفورًا",
    "وَإِمّا تُعرِضَنَّ عَنهُمُ ابتِغاءَ رَحمَةٍ مِن رَبِّكَ تَرجوها فَقُل لَهُم قَولًا مَيسورًا",
    "وَلا تَجعَل يَدَكَ مَغلولَةً إِلىٰ عُنُقِكَ وَلا تَبسُطها كُلَّ البَسطِ فَتَقعُدَ مَلومًا مَحسورًا",
    "إِنَّ رَبَّكَ يَبسُطُ الرِّزقَ لِمَن يَشاءُ وَيَقدِرُ ۚ إِنَّهُ كانَ بِعِبادِهِ خَبيرًا بَصيرًا",
    "وَلا تَقتُلوا أَولادَكُم خَشيَةَ إِملاقٍ ۖ نَحنُ نَرزُقُهُم وَإِيّاكُم ۚ إِنَّ قَتلَهُم كانَ خِطئًا كَبيرًا",
    "وَلا تَقرَبُوا الزِّنا ۖ إِنَّهُ كانَ فاحِشَةً وَساءَ سَبيلًا",
    "وَلا تَقتُلُوا النَّفسَ الَّتي حَرَّمَ اللَّهُ إِلّا بِالحَقِّ ۗ وَمَن قُتِلَ مَظلومًا فَقَد جَعَلنا لِوَلِيِّهِ سُلطانًا فَلا يُسرِف فِي القَتلِ ۖ إِنَّهُ كانَ مَنصورًا",
    "وَلا تَقرَبوا مالَ اليَتيمِ إِلّا بِالَّتي هِيَ أَحسَنُ حَتّىٰ يَبلُغَ أَشُدَّهُ ۚ وَأَوفوا بِالعَهدِ ۖ إِنَّ العَهدَ كانَ مَسئولًا",
    "وَأَوفُوا الكَيلَ إِذا كِلتُم وَزِنوا بِالقِسطاسِ المُستَقيمِ ۚ ذٰلِكَ خَيرٌ وَأَحسَنُ تَأويلًا",
    "وَلا تَقفُ ما لَيسَ لَكَ بِهِ عِلمٌ ۚ إِنَّ السَّمعَ وَالبَصَرَ وَالفُؤادَ كُلُّ أُولٰئِكَ كانَ عَنهُ مَسئولًا",
    "وَلا تَمشِ فِي الأَرضِ مَرَحًا ۖ إِنَّكَ لَن تَخرِقَ الأَرضَ وَلَن تَبلُغَ الجِبالَ طولًا",
    "كُلُّ ذٰلِكَ كانَ سَيِّئُهُ عِندَ رَبِّكَ مَكروهًا",
    "ذٰلِكَ مِمّا أَوحىٰ إِلَيكَ رَبُّكَ مِنَ الحِكمَةِ ۗ وَلا تَجعَل مَعَ اللَّهِ إِلٰهًا آخَرَ فَتُلقىٰ في جَهَنَّمَ مَلومًا مَدحورًا",
    "أَفَأَصفاكُم رَبُّكُم بِالبَنينَ وَاتَّخَذَ مِنَ المَلائِكَةِ إِناثًا ۚ إِنَّكُم لَتَقولونَ قَولًا عَظيمًا",
    "وَلَقَد صَرَّفنا في هٰذَا القُرآنِ لِيَذَّكَّروا وَما يَزيدُهُم إِلّا نُفورًا",
    "قُل لَو كانَ مَعَهُ آلِهَةٌ كَما يَقولونَ إِذًا لَابتَغَوا إِلىٰ ذِي العَرشِ سَبيلًا",
    "سُبحانَهُ وَتَعالىٰ عَمّا يَقولونَ عُلُوًّا كَبيرًا",
    "تُسَبِّحُ لَهُ السَّماواتُ السَّبعُ وَالأَرضُ وَمَن فيهِنَّ ۚ وَإِن مِن شَيءٍ إِلّا يُسَبِّحُ بِحَمدِهِ وَلٰكِن لا تَفقَهونَ تَسبيحَهُم ۗ إِنَّهُ كانَ حَليمًا غَفورًا",
    "وَإِذا قَرَأتَ القُرآنَ جَعَلنا بَينَكَ وَبَينَ الَّذينَ لا يُؤمِنونَ بِالآخِرَةِ حِجابًا مَستورًا",
    "وَجَعَلنا عَلىٰ قُلوبِهِم أَكِنَّةً أَن يَفقَهوهُ وَفي آذانِهِم وَقرًا ۚ وَإِذا ذَكَرتَ رَبَّكَ فِي القُرآنِ وَحدَهُ وَلَّوا عَلىٰ أَدبارِهِم نُفورًا",
    "نَحنُ أَعلَمُ بِما يَستَمِعونَ بِهِ إِذ يَستَمِعونَ إِلَيكَ وَإِذ هُم نَجوىٰ إِذ يَقولُ الظّالِمونَ إِن تَتَّبِعونَ إِلّا رَجُلًا مَسحورًا",
    "انظُر كَيفَ ضَرَبوا لَكَ الأَمثالَ فَضَلّوا فَلا يَستَطيعونَ سَبيلًا",
    "وَقالوا أَإِذا كُنّا عِظامًا وَرُفاتًا أَإِنّا لَمَبعوثونَ خَلقًا جَديدًا",
    "۞ قُل كونوا حِجارَةً أَو حَديدًا",
    "أَو خَلقًا مِمّا يَكبُرُ في صُدورِكُم ۚ فَسَيَقولونَ مَن يُعيدُنا ۖ قُلِ الَّذي فَطَرَكُم أَوَّلَ مَرَّةٍ ۚ فَسَيُنغِضونَ إِلَيكَ رُءوسَهُم وَيَقولونَ مَتىٰ هُوَ ۖ قُل عَسىٰ أَن يَكونَ قَريبًا",
    "يَومَ يَدعوكُم فَتَستَجيبونَ بِحَمدِهِ وَتَظُنّونَ إِن لَبِثتُم إِلّا قَليلًا",
    "وَقُل لِعِبادي يَقولُوا الَّتي هِيَ أَحسَنُ ۚ إِنَّ الشَّيطانَ يَنزَغُ بَينَهُم ۚ إِنَّ الشَّيطانَ كانَ لِلإِنسانِ عَدُوًّا مُبينًا",
    "رَبُّكُم أَعلَمُ بِكُم ۖ إِن يَشَأ يَرحَمكُم أَو إِن يَشَأ يُعَذِّبكُم ۚ وَما أَرسَلناكَ عَلَيهِم وَكيلًا",
    "وَرَبُّكَ أَعلَمُ بِمَن فِي السَّماواتِ وَالأَرضِ ۗ وَلَقَد فَضَّلنا بَعضَ النَّبِيّينَ عَلىٰ بَعضٍ ۖ وَآتَينا داوودَ زَبورًا",
    "قُلِ ادعُوا الَّذينَ زَعَمتُم مِن دونِهِ فَلا يَملِكونَ كَشفَ الضُّرِّ عَنكُم وَلا تَحويلًا",
    "أُولٰئِكَ الَّذينَ يَدعونَ يَبتَغونَ إِلىٰ رَبِّهِمُ الوَسيلَةَ أَيُّهُم أَقرَبُ وَيَرجونَ رَحمَتَهُ وَيَخافونَ عَذابَهُ ۚ إِنَّ عَذابَ رَبِّكَ كانَ مَحذورًا",
    "وَإِن مِن قَريَةٍ إِلّا نَحنُ مُهلِكوها قَبلَ يَومِ القِيامَةِ أَو مُعَذِّبوها عَذابًا شَديدًا ۚ كانَ ذٰلِكَ فِي الكِتابِ مَسطورًا",
    "وَما مَنَعَنا أَن نُرسِلَ بِالآياتِ إِلّا أَن كَذَّبَ بِهَا الأَوَّلونَ ۚ وَآتَينا ثَمودَ النّاقَةَ مُبصِرَةً فَظَلَموا بِها ۚ وَما نُرسِلُ بِالآياتِ إِلّا تَخويفًا",
    "وَإِذ قُلنا لَكَ إِنَّ رَبَّكَ أَحاطَ بِالنّاسِ ۚ وَما جَعَلنَا الرُّؤيَا الَّتي أَرَيناكَ إِلّا فِتنَةً لِلنّاسِ وَالشَّجَرَةَ المَلعونَةَ فِي القُرآنِ ۚ وَنُخَوِّفُهُم فَما يَزيدُهُم إِلّا طُغيانًا كَبيرًا",
    "وَإِذ قُلنا لِلمَلائِكَةِ اسجُدوا لِآدَمَ فَسَجَدوا إِلّا إِبليسَ قالَ أَأَسجُدُ لِمَن خَلَقتَ طينًا",
    "قالَ أَرَأَيتَكَ هٰذَا الَّذي كَرَّمتَ عَلَيَّ لَئِن أَخَّرتَنِ إِلىٰ يَومِ القِيامَةِ لَأَحتَنِكَنَّ ذُرِّيَّتَهُ إِلّا قَليلًا",
    "قالَ اذهَب فَمَن تَبِعَكَ مِنهُم فَإِنَّ جَهَنَّمَ جَزاؤُكُم جَزاءً مَوفورًا",
    "وَاستَفزِز مَنِ استَطَعتَ مِنهُم بِصَوتِكَ وَأَجلِب عَلَيهِم بِخَيلِكَ وَرَجِلِكَ وَشارِكهُم فِي الأَموالِ وَالأَولادِ وَعِدهُم ۚ وَما يَعِدُهُمُ الشَّيطانُ إِلّا غُرورًا",
    "إِنَّ عِبادي لَيسَ لَكَ عَلَيهِم سُلطانٌ ۚ وَكَفىٰ بِرَبِّكَ وَكيلًا",
    "رَبُّكُمُ الَّذي يُزجي لَكُمُ الفُلكَ فِي البَحرِ لِتَبتَغوا مِن فَضلِهِ ۚ إِنَّهُ كانَ بِكُم رَحيمًا",
    "وَإِذا مَسَّكُمُ الضُّرُّ فِي البَحرِ ضَلَّ مَن تَدعونَ إِلّا إِيّاهُ ۖ فَلَمّا نَجّاكُم إِلَى البَرِّ أَعرَضتُم ۚ وَكانَ الإِنسانُ كَفورًا",
    "أَفَأَمِنتُم أَن يَخسِفَ بِكُم جانِبَ البَرِّ أَو يُرسِلَ عَلَيكُم حاصِبًا ثُمَّ لا تَجِدوا لَكُم وَكيلًا",
    "أَم أَمِنتُم أَن يُعيدَكُم فيهِ تارَةً أُخرىٰ فَيُرسِلَ عَلَيكُم قاصِفًا مِنَ الرّيحِ فَيُغرِقَكُم بِما كَفَرتُم ۙ ثُمَّ لا تَجِدوا لَكُم عَلَينا بِهِ تَبيعًا",
    "۞ وَلَقَد كَرَّمنا بَني آدَمَ وَحَمَلناهُم فِي البَرِّ وَالبَحرِ وَرَزَقناهُم مِنَ الطَّيِّباتِ وَفَضَّلناهُم عَلىٰ كَثيرٍ مِمَّن خَلَقنا تَفضيلًا",
    "يَومَ نَدعو كُلَّ أُناسٍ بِإِمامِهِم ۖ فَمَن أوتِيَ كِتابَهُ بِيَمينِهِ فَأُولٰئِكَ يَقرَءونَ كِتابَهُم وَلا يُظلَمونَ فَتيلًا",
    "وَمَن كانَ في هٰذِهِ أَعمىٰ فَهُوَ فِي الآخِرَةِ أَعمىٰ وَأَضَلُّ سَبيلًا",
    "وَإِن كادوا لَيَفتِنونَكَ عَنِ الَّذي أَوحَينا إِلَيكَ لِتَفتَرِيَ عَلَينا غَيرَهُ ۖ وَإِذًا لَاتَّخَذوكَ خَليلًا",
    "وَلَولا أَن ثَبَّتناكَ لَقَد كِدتَ تَركَنُ إِلَيهِم شَيئًا قَليلًا",
    "إِذًا لَأَذَقناكَ ضِعفَ الحَياةِ وَضِعفَ المَماتِ ثُمَّ لا تَجِدُ لَكَ عَلَينا نَصيرًا",
    "وَإِن كادوا لَيَستَفِزّونَكَ مِنَ الأَرضِ لِيُخرِجوكَ مِنها ۖ وَإِذًا لا يَلبَثونَ خِلافَكَ إِلّا قَليلًا",
    "سُنَّةَ مَن قَد أَرسَلنا قَبلَكَ مِن رُسُلِنا ۖ وَلا تَجِدُ لِسُنَّتِنا تَحويلًا",
    "أَقِمِ الصَّلاةَ لِدُلوكِ الشَّمسِ إِلىٰ غَسَقِ اللَّيلِ وَقُرآنَ الفَجرِ ۖ إِنَّ قُرآنَ الفَجرِ كانَ مَشهودًا",
    "وَمِنَ اللَّيلِ فَتَهَجَّد بِهِ نافِلَةً لَكَ عَسىٰ أَن يَبعَثَكَ رَبُّكَ مَقامًا مَحمودًا",
    "وَقُل رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا",
    "وَقُل جاءَ الحَقُّ وَزَهَقَ الباطِلُ ۚ إِنَّ الباطِلَ كانَ زَهوقًا",
    "وَنُنَزِّلُ مِنَ القُرآنِ ما هُوَ شِفاءٌ وَرَحمَةٌ لِلمُؤمِنينَ ۙ وَلا يَزيدُ الظّالِمينَ إِلّا خَسارًا",
    "وَإِذا أَنعَمنا عَلَى الإِنسانِ أَعرَضَ وَنَأىٰ بِجانِبِهِ ۖ وَإِذا مَسَّهُ الشَّرُّ كانَ يَئوسًا",
    "قُل كُلٌّ يَعمَلُ عَلىٰ شاكِلَتِهِ فَرَبُّكُم أَعلَمُ بِمَن هُوَ أَهدىٰ سَبيلًا",
    "وَيَسأَلونَكَ عَنِ الرّوحِ ۖ قُلِ الرّوحُ مِن أَمرِ رَبّي وَما أوتيتُم مِنَ العِلمِ إِلّا قَليلًا",
    "وَلَئِن شِئنا لَنَذهَبَنَّ بِالَّذي أَوحَينا إِلَيكَ ثُمَّ لا تَجِدُ لَكَ بِهِ عَلَينا وَكيلًا",
    "إِلّا رَحمَةً مِن رَبِّكَ ۚ إِنَّ فَضلَهُ كانَ عَلَيكَ كَبيرًا",
    "قُل لَئِنِ اجتَمَعَتِ الإِنسُ وَالجِنُّ عَلىٰ أَن يَأتوا بِمِثلِ هٰذَا القُرآنِ لا يَأتونَ بِمِثلِهِ وَلَو كانَ بَعضُهُم لِبَعضٍ ظَهيرًا",
    "وَلَقَد صَرَّفنا لِلنّاسِ في هٰذَا القُرآنِ مِن كُلِّ مَثَلٍ فَأَبىٰ أَكثَرُ النّاسِ إِلّا كُفورًا",
    "وَقالوا لَن نُؤمِنَ لَكَ حَتّىٰ تَفجُرَ لَنا مِنَ الأَرضِ يَنبوعًا",
    "أَو تَكونَ لَكَ جَنَّةٌ مِن نَخيلٍ وَعِنَبٍ فَتُفَجِّرَ الأَنهارَ خِلالَها تَفجيرًا",
    "أَو تُسقِطَ السَّماءَ كَما زَعَمتَ عَلَينا كِسَفًا أَو تَأتِيَ بِاللَّهِ وَالمَلائِكَةِ قَبيلًا",
    "أَو يَكونَ لَكَ بَيتٌ مِن زُخرُفٍ أَو تَرقىٰ فِي السَّماءِ وَلَن نُؤمِنَ لِرُقِيِّكَ حَتّىٰ تُنَزِّلَ عَلَينا كِتابًا نَقرَؤُهُ ۗ قُل سُبحانَ رَبّي هَل كُنتُ إِلّا بَشَرًا رَسولًا",
    "وَما مَنَعَ النّاسَ أَن يُؤمِنوا إِذ جاءَهُمُ الهُدىٰ إِلّا أَن قالوا أَبَعَثَ اللَّهُ بَشَرًا رَسولًا",
    "قُل لَو كانَ فِي الأَرضِ مَلائِكَةٌ يَمشونَ مُطمَئِنّينَ لَنَزَّلنا عَلَيهِم مِنَ السَّماءِ مَلَكًا رَسولًا",
    "قُل كَفىٰ بِاللَّهِ شَهيدًا بَيني وَبَينَكُم ۚ إِنَّهُ كانَ بِعِبادِهِ خَبيرًا بَصيرًا",
    "وَمَن يَهدِ اللَّهُ فَهُوَ المُهتَدِ ۖ وَمَن يُضلِل فَلَن تَجِدَ لَهُم أَولِياءَ مِن دونِهِ ۖ وَنَحشُرُهُم يَومَ القِيامَةِ عَلىٰ وُجوهِهِم عُميًا وَبُكمًا وَصُمًّا ۖ مَأواهُم جَهَنَّمُ ۖ كُلَّما خَبَت زِدناهُم سَعيرًا",
    "ذٰلِكَ جَزاؤُهُم بِأَنَّهُم كَفَروا بِآياتِنا وَقالوا أَإِذا كُنّا عِظامًا وَرُفاتًا أَإِنّا لَمَبعوثونَ خَلقًا جَديدًا",
    "۞ أَوَلَم يَرَوا أَنَّ اللَّهَ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ قادِرٌ عَلىٰ أَن يَخلُقَ مِثلَهُم وَجَعَلَ لَهُم أَجَلًا لا رَيبَ فيهِ فَأَبَى الظّالِمونَ إِلّا كُفورًا",
    "قُل لَو أَنتُم تَملِكونَ خَزائِنَ رَحمَةِ رَبّي إِذًا لَأَمسَكتُم خَشيَةَ الإِنفاقِ ۚ وَكانَ الإِنسانُ قَتورًا",
    "وَلَقَد آتَينا موسىٰ تِسعَ آياتٍ بَيِّناتٍ ۖ فَاسأَل بَني إِسرائيلَ إِذ جاءَهُم فَقالَ لَهُ فِرعَونُ إِنّي لَأَظُنُّكَ يا موسىٰ مَسحورًا",
    "قالَ لَقَد عَلِمتَ ما أَنزَلَ هٰؤُلاءِ إِلّا رَبُّ السَّماواتِ وَالأَرضِ بَصائِرَ وَإِنّي لَأَظُنُّكَ يا فِرعَونُ مَثبورًا",
    "فَأَرادَ أَن يَستَفِزَّهُم مِنَ الأَرضِ فَأَغرَقناهُ وَمَن مَعَهُ جَميعًا",
    "وَقُلنا مِن بَعدِهِ لِبَني إِسرائيلَ اسكُنُوا الأَرضَ فَإِذا جاءَ وَعدُ الآخِرَةِ جِئنا بِكُم لَفيفًا",
    "وَبِالحَقِّ أَنزَلناهُ وَبِالحَقِّ نَزَلَ ۗ وَما أَرسَلناكَ إِلّا مُبَشِّرًا وَنَذيرًا",
    "وَقُرآنًا فَرَقناهُ لِتَقرَأَهُ عَلَى النّاسِ عَلىٰ مُكثٍ وَنَزَّلناهُ تَنزيلًا",
    "قُل آمِنوا بِهِ أَو لا تُؤمِنوا ۚ إِنَّ الَّذينَ أوتُوا العِلمَ مِن قَبلِهِ إِذا يُتلىٰ عَلَيهِم يَخِرّونَ لِلأَذقانِ سُجَّدًا",
    "وَيَقولونَ سُبحانَ رَبِّنا إِن كانَ وَعدُ رَبِّنا لَمَفعولًا",
    "وَيَخِرّونَ لِلأَذقانِ يَبكونَ وَيَزيدُهُم خُشوعًا ۩",
    "قُلِ ادعُوا اللَّهَ أَوِ ادعُوا الرَّحمٰنَ ۖ أَيًّا ما تَدعوا فَلَهُ الأَسماءُ الحُسنىٰ ۚ وَلا تَجهَر بِصَلاتِكَ وَلا تُخافِت بِها وَابتَغِ بَينَ ذٰلِكَ سَبيلًا",
    "وَقُلِ الحَمدُ لِلَّهِ الَّذي لَم يَتَّخِذ وَلَدًا وَلَم يَكُن لَهُ شَريكٌ فِي المُلكِ وَلَم يَكُن لَهُ وَلِيٌّ مِنَ الذُّلِّ ۖ وَكَبِّرهُ تَكبيرًا"
  ]
}