{
  "id": 20,
  "name": "طه",
  "transliteration": "Taha",
  "translation": "Ta-Ha",
  "verses": [
    "طه",
    "ما أَنزَلنا عَلَيكَ القُرآنَ لِتَشقىٰ",
    "إِلّا تَذكِرَةً لِمَن يَخشىٰ",
    "تَنزيلًا مِمَّن خَلَقَ الأَرضَ وَالسَّماواتِ العُلَى",
    "الرَّحمٰنُ عَلَى العَرشِ استَوىٰ",
    "لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ وَما بَينَهُما وَما تَحتَ الثَّرىٰ",
    "وَإِن تَجهَر بِالقَولِ فَإِنَّهُ يَعلَمُ السِّرَّ وَأَخفَى",
    "اللَّهُ لا إِلٰهَ إِلّا هُوَ ۖ لَهُ الأَسماءُ الحُسنىٰ",
    "وَهَل أَتاكَ حَديثُ موسىٰ",
    "إِذ رَأىٰ نارًا فَقالَ لِأَهلِهِ امكُثوا إِنّي آنَستُ نارًا لَعَلّي آتيكُم مِنها بِقَبَسٍ أَو أَجِدُ عَلَى النّارِ هُدًى",
    "فَلَمّا أَتاها نودِيَ يا موسىٰ",
    "إِنّي أَنا رَبُّكَ فَاخلَع نَعلَيكَ ۖ إِنَّكَ بِالوادِ المُقَدَّسِ طُوًى",
    "وَأَنَا اختَرتُكَ فَاستَمِع لِما يوحىٰ",
    "إِنَّني أَنَا اللَّهُ لا إِلٰهَ إِلّا أَنا فَاعبُدني وَأَقِمِ الصَّلاةَ لِذِكري",
    "إِنَّ السّاعَةَ آتِيَةٌ أَكادُ أُخفيها لِتُجزىٰ كُلُّ نَفسٍ بِما تَسعىٰ",
    "فَلا يَصُدَّنَّكَ عَنها مَن لا يُؤمِنُ بِها وَاتَّبَعَ هَواهُ فَتَردىٰ",
    "وَما تِلكَ بِيَمينِكَ يا موسىٰ",
    "قالَ هِيَ عَصايَ أَتَوَكَّأُ عَلَيها وَأَهُشُّ بِها عَلىٰ غَنَمي وَلِيَ فيها مَآرِبُ أُخرىٰ",
    "قالَ أَلقِها يا موسىٰ",
    "فَأَلقاها فَإِذا هِيَ حَيَّةٌ تَسعىٰ",
    "قالَ خُذها وَلا تَخَف ۖ سَنُعيدُها سيرَتَهَا الأولىٰ",
    "وَاضمُم يَدَكَ إِلىٰ جَناحِكَ تَخرُج بَيضاءَ مِن غَيرِ سوءٍ آيَةً أُخرىٰ",
    "لِنُرِيَكَ مِن آياتِنَا الكُبرَى",
    "اذهَب إِلىٰ فِرعَونَ إِنَّهُ طَغىٰ",
    "قالَ رَبِّ اشرَح لي صَدري",
    "وَيَسِّر لي أَمري",
    "وَاحلُل عُقدَةً مِن لِساني",
    "يَفقَهوا قَولي",
    "وَاجعَل لي وَزيرًا مِن أَهلي",
    "هارونَ أَخِي",
    "اشدُد بِهِ أَزري",
    "وَأَشرِكهُ في أَمري",
    "كَي نُسَبِّحَكَ كَثيرًا",
    "وَنَذكُرَكَ كَثيرًا",
    "إِنَّكَ كُنتَ بِنا بَصيرًا",
    "قالَ قَد أوتيتَ سُؤلَكَ يا موسىٰ",
    "وَلَقَد مَنَنّا عَلَيكَ مَرَّةً أُخرىٰ",
    "إِذ أَوحَينا إِلىٰ أُمِّكَ ما يوحىٰ",
    "أَنِ اقذِفيهِ فِي التّابوتِ فَاقذِفيهِ فِي اليَمِّ فَليُلقِهِ اليَمُّ بِالسّاحِلِ يَأخُذهُ عَدُوٌّ لي وَعَدُوٌّ لَهُ ۚ وَأَلقَيتُ عَلَيكَ مَحَبَّةً مِنّي وَلِتُصنَعَ عَلىٰ عَيني",
    "إِذ تَمشي أُختُكَ فَتَقولُ هَل أَدُلُّكُم عَلىٰ مَن يَكفُلُهُ ۖ فَرَجَعناكَ إِلىٰ أُمِّكَ كَي تَقَرَّ عَينُها وَلا تَحزَنَ ۚ وَقَتَلتَ نَفسًا فَنَجَّيناكَ مِنَ الغَمِّ وَفَتَنّاكَ فُتونًا ۚ فَلَبِثتَ سِنينَ في أَهلِ مَديَنَ ثُمَّ جِئتَ عَلىٰ قَدَرٍ يا موسىٰ",
    "وَاصطَنَعتُكَ لِنَفسِي",
    "اذهَب أَنتَ وَأَخوكَ بِآياتي وَلا تَنِيا في ذِكرِي",
    "اذهَبا إِلىٰ فِرعَونَ إِنَّهُ طَغىٰ",
    "فَقولا لَهُ قَولًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ أَو يَخشىٰ",
    "قالا رَبَّنا إِنَّنا نَخافُ أَن يَفرُطَ عَلَينا أَو أَن يَطغىٰ",
    "قالَ لا تَخافا ۖ إِنَّني مَعَكُما أَسمَعُ وَأَرىٰ",
    "فَأتِياهُ فَقولا إِنّا رَسولا رَبِّكَ فَأَرسِل مَعَنا بَني إِسرائيلَ وَلا تُعَذِّبهُم ۖ قَد جِئناكَ بِآيَةٍ مِن رَبِّكَ ۖ وَالسَّلامُ عَلىٰ مَنِ اتَّبَعَ الهُدىٰ",
    "إِنّا قَد أوحِيَ إِلَينا أَنَّ العَذابَ عَلىٰ مَن كَذَّبَ وَتَوَلّىٰ",
    "قالَ فَمَن رَبُّكُما يا موسىٰ",
    "قالَ رَبُّنَا الَّذي أَعطىٰ كُلَّ شَيءٍ خَلقَهُ ثُمَّ هَدىٰ",
    "قالَ فَما بالُ القُرونِ الأولىٰ",
    "قالَ عِلمُها عِندَ رَبّي في كِتابٍ ۖ لا يَضِلُّ رَبّي وَلا يَنسَى",
    "الَّذي جَعَلَ لَكُمُ الأَرضَ مَهدًا وَسَلَكَ لَكُم فيها سُبُلًا وَأَنزَلَ مِنَ السَّماءِ ماءً فَأَخرَجنا بِهِ أَزواجًا مِن نَباتٍ شَتّىٰ",
    "كُلوا وَارعَوا أَنعامَكُم ۗ إِنَّ في ذٰلِكَ لَآياتٍ لِأُولِي النُّهىٰ",
    "۞ مِنها خَلَقناكُم وَفيها نُعيدُكُم وَمِنها نُخرِجُكُم تارَةً أُخرىٰ",
    "وَلَقَد أَرَيناهُ آياتِنا كُلَّها فَكَذَّبَ وَأَبىٰ",
    "قالَ أَجِئتَنا لِتُخرِجَنا مِن أَرضِنا بِسِحرِكَ يا موسىٰ",
    "فَلَنَأتِيَنَّكَ بِسِحرٍ مِثلِهِ فَاجعَل بَينَنا وَبَينَكَ مَوعِدًا لا نُخلِفُهُ نَحنُ وَلا أَنتَ مَكانًا سُوًى",
    "قالَ مَوعِدُكُم يَومُ الزّينَةِ وَأَن يُحشَرَ النّاسُ ضُحًى",
    "فَتَوَلّىٰ فِرعَونُ فَجَمَعَ كَيدَهُ ثُمَّ أَتىٰ",
    "قالَ لَهُم موسىٰ وَيلَكُم لا تَفتَروا عَلَى اللَّهِ كَذِبًا فَيُسحِتَكُم بِعَذابٍ ۖ وَقَد خابَ مَنِ افتَرىٰ",
    "فَتَنازَعوا أَمرَهُم بَينَهُم وَأَسَرُّوا النَّجوىٰ",
    "قالوا إِن هٰذانِ لَساحِرانِ يُريدانِ أَن يُخرِجاكُم مِن أَرضِكُم بِسِحرِهِما وَيَذهَبا بِطَريقَتِكُمُ المُثلىٰ",
    "فَأَجمِعوا كَيدَكُم ثُمَّ ائتوا صَفًّا ۚ وَقَد أَفلَحَ اليَومَ مَنِ استَعلىٰ",
    "قالوا يا موسىٰ إِمّا أَن تُلقِيَ وَإِمّا أَن نَكونَ أَوَّلَ مَن أَلقىٰ",
    "قالَ بَل أَلقوا ۖ فَإِذا حِبالُهُم وَعِصِيُّهُم يُخَيَّلُ إِلَيهِ مِن سِحرِهِم أَنَّها تَسعىٰ",
    "فَأَوجَسَ في نَفسِهِ خيفَةً موسىٰ",
    "قُلنا لا تَخَف إِنَّكَ أَنتَ الأَعلىٰ",
    "وَأَلقِ ما في يَمينِكَ تَلقَف ما صَنَعوا ۖ إِنَّما صَنَعوا كَيدُ ساحِرٍ ۖ وَلا يُفلِحُ السّاحِرُ حَيثُ أَتىٰ",
    "فَأُلقِيَ السَّحَرَةُ سُجَّدًا قالوا آمَنّا بِرَبِّ هارونَ وَموسىٰ",
    "قالَ آمَنتُم لَهُ قَبلَ أَن آذَنَ لَكُم ۖ إِنَّهُ لَكَبيرُكُمُ الَّذي عَلَّمَكُمُ السِّحرَ ۖ فَلَأُقَطِّعَنَّ أَيدِيَكُم وَأَرجُلَكُم مِن خِلافٍ وَلَأُصَلِّبَنَّكُم في جُذوعِ النَّخلِ وَلَتَعلَمُنَّ أَيُّنا أَشَدُّ عَذابًا وَأَبقىٰ",
    "قالوا لَن نُؤثِرَكَ عَلىٰ ما جاءَنا مِنَ البَيِّناتِ وَالَّذي فَطَرَنا ۖ فَاقضِ ما أَنتَ قاضٍ ۖ إِنَّما تَقضي هٰذِهِ الحَياةَ الدُّنيا",
    "إِنّا آمَنّا بِرَبِّنا لِيَغفِرَ لَنا خَطايانا وَما أَكرَهتَنا عَلَيهِ مِنَ السِّحرِ ۗ وَاللَّهُ خَيرٌ وَأَبقىٰ",
    "إِنَّهُ مَن يَأتِ رَبَّهُ مُجرِمًا فَإِنَّ لَهُ جَهَنَّمَ لا يَموتُ فيها وَلا يَحيىٰ",
    "وَمَن يَأتِهِ مُؤمِنًا قَد عَمِلَ الصّالِحاتِ فَأُولٰئِكَ لَهُمُ الدَّرَجاتُ العُلىٰ",
    "جَنّاتُ عَدنٍ تَجري مِن تَحتِهَا الأَنهارُ خالِدينَ فيها ۚ وَذٰلِكَ جَزاءُ مَن تَزَكّىٰ",
    "وَلَقَد أَوحَينا إِلىٰ موسىٰ أَن أَسرِ بِعِبادي فَاضرِب لَهُم طَريقًا فِي البَحرِ يَبَسًا لا تَخافُ دَرَكًا وَلا تَخشىٰ",
    "فَأَتبَعَهُم فِرعَونُ بِجُنودِهِ فَغَشِيَهُم مِنَ اليَمِّ ما غَشِيَهُم",
    "وَأَضَلَّ فِرعَونُ قَومَهُ وَما هَدىٰ",
    "يا بَني إِسرائيلَ قَد أَنجَيناكُم مِن عَدُوِّكُم وَواعَدناكُم جانِبَ الطّورِ الأَيمَنَ وَنَزَّلنا عَلَيكُمُ المَنَّ وَالسَّلوىٰ",
    "كُلوا مِن طَيِّباتِ ما رَزَقناكُم وَلا تَطغَوا فيهِ فَيَحِلَّ عَلَيكُم غَضَبي ۖ وَمَن يَحلِل عَلَيهِ غَضَبي فَقَد هَوىٰ",
    "وَإِنّي لَغَفّارٌ لِمَن تابَ وَآمَنَ وَعَمِلَ صالِحًا ثُمَّ اهتَدىٰ",
    "۞ وَما أَعجَلَكَ عَن قَومِكَ يا موسىٰ",
    "قالَ هُم أُولاءِ عَلىٰ أَثَري وَعَجِلتُ إِلَيكَ رَبِّ لِتَرضىٰ",
    "قالَ فَإِنّا قَد فَتَنّا قَومَكَ مِن بَعدِكَ وَأَضَلَّهُمُ السّامِرِيُّ",
    "فَرَجَعَ موسىٰ إِلىٰ قَومِهِ غَضبانَ أَسِفًا ۚ قالَ يا قَومِ أَلَم يَعِدكُم رَبُّكُم وَعدًا حَسَنًا ۚ أَفَطالَ عَلَيكُمُ العَهدُ أَم أَرَدتُم أَن يَحِلَّ عَلَيكُم غَضَبٌ مِن رَبِّكُم فَأَخلَفتُم مَوعِدي",
    "قالوا ما أَخلَفنا مَوعِدَكَ بِمَلكِنا وَلٰكِنّا حُمِّلنا أَوزارًا مِن زينَةِ القَومِ فَقَذَفناها فَكَذٰلِكَ أَلقَى السّامِرِيُّ",
    "فَأَخرَجَ لَهُم عِجلًا جَسَدًا لَهُ خُوارٌ فَقالوا هٰذا إِلٰهُكُم وَإِلٰهُ موسىٰ فَنَسِيَ",
    "أَفَلا يَرَونَ أَلّا يَرجِعُ إِلَيهِم قَولًا وَلا يَملِكُ لَهُم ضَرًّا وَلا نَفعًا",
    "وَلَقَد قالَ لَهُم هارونُ مِن قَبلُ يا قَومِ إِنَّما فُتِنتُم بِهِ ۖ وَإِنَّ رَبَّكُمُ الرَّحمٰنُ فَاتَّبِعوني وَأَطيعوا أَمري",
    "قالوا لَن نَبرَحَ عَلَيهِ عاكِفينَ حَتّىٰ يَرجِعَ إِلَينا موسىٰ",
    "قالَ يا هارونُ ما مَنَعَكَ إِذ رَأَيتَهُم ضَلّوا",
    "أَلّا تَتَّبِعَنِ ۖ أَفَعَصَيتَ أَمري",
    "قالَ يَا ابنَ أُمَّ لا تَأخُذ بِلِحيَتي وَلا بِرَأسي ۖ إِنّي خَشيتُ أَن تَقولَ فَرَّقتَ بَينَ بَني إِسرائيلَ وَلَم تَرقُب قَولي",
    "قالَ فَما خَطبُكَ يا سامِرِيُّ",
    "قالَ بَصُرتُ بِما لَم يَبصُروا بِهِ فَقَبَضتُ قَبضَةً مِن أَثَرِ الرَّسولِ فَنَبَذتُها وَكَذٰلِكَ سَوَّلَت لي نَفسي",
    "قالَ فَاذهَب فَإِنَّ لَكَ فِي الحَياةِ أَن تَقولَ لا مِساسَ ۖ وَإِنَّ لَكَ مَوعِدًا لَن تُخلَفَهُ ۖ وَانظُر إِلىٰ إِلٰهِكَ الَّذي ظَلتَ عَلَيهِ عاكِفًا ۖ لَنُحَرِّقَنَّهُ ثُمَّ لَنَنسِفَنَّهُ فِي اليَمِّ نَسفًا",
    "إِنَّما إِلٰهُكُمُ اللَّهُ الَّذي لا إِلٰهَ إِلّا هُوَ ۚ وَسِعَ كُلَّ شَيءٍ عِلمًا",
    "كَذٰلِكَ نَقُصُّ عَلَيكَ مِن أَنباءِ ما قَد سَبَقَ ۚ وَقَد آتَيناكَ مِن لَدُنّا ذِكرًا",
    "مَن أَعرَضَ عَنهُ فَإِنَّهُ يَحمِلُ يَومَ القِيامَةِ وِزرًا",
    "خالِدينَ فيهِ ۖ وَساءَ لَهُم يَومَ القِيامَةِ حِملًا",
    "يَومَ يُنفَخُ فِي الصّورِ ۚ وَنَحشُرُ المُجرِمينَ يَومَئِذٍ زُرقًا",
    "يَتَخافَتونَ بَينَهُم إِن لَبِثتُم إِلّا عَشرًا",
    "نَحنُ أَعلَمُ بِما يَقولونَ إِذ يَقولُ أَمثَلُهُم طَريقَةً إِن لَبِثتُم إِلّا يَومًا",
    "وَيَسأَلونَكَ عَنِ الجِبالِ فَقُل يَنسِفُها رَبّي نَسفًا",
    "فَيَذَرُها قاعًا صَفصَفًا",
    "لا تَرىٰ فيها عِوَجًا وَلا أَمتًا",
    "يَومَئِذٍ يَتَّبِعونَ الدّاعِيَ لا عِوَجَ لَهُ ۖ وَخَشَعَتِ الأَصواتُ لِلرَّحمٰنِ فَلا تَسمَعُ إِلّا هَمسًا",
    "يَومَئِذٍ لا تَنفَعُ الشَّفاعَةُ إِلّا مَن أَذِنَ لَهُ الرَّحمٰنُ وَرَضِيَ لَهُ قَولًا",
    "يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يُحيطونَ بِهِ عِلمًا",
    "۞ وَعَنَتِ الوُجوهُ لِلحَيِّ القَيّومِ ۖ وَقَد خابَ مَن حَمَلَ ظُلمًا",
    "وَمَن يَعمَل مِنَ الصّالِحاتِ وَهُوَ مُؤمِنٌ فَلا يَخافُ ظُلمًا وَلا هَضمًا",
    "وَكَذٰلِكَ أَنزَلناهُ قُرآنًا عَرَبِيًّا وَصَرَّفنا فيهِ مِنَ الوَعيدِ لَعَلَّهُم يَتَّقونَ أَو يُحدِثُ لَهُم ذِكرًا",
    "فَتَعالَى اللَّهُ المَلِكُ الحَقُّ ۗ وَلا تَعجَل بِالقُرآنِ مِن قَبلِ أَن يُقضىٰ إِلَيكَ وَحيُهُ ۖ وَقُل رَبِّ زِدني عِلمًا",
    "وَلَقَد عَهِدنا إِلىٰ آدَمَ مِن قَبلُ فَنَسِيَ وَلَم نَجِد لَهُ عَزمًا",
    "وَإِذ قُلنا لِلمَلائِكَةِ اسجُدوا لِآدَمَ فَسَجَدوا إِلّا إِبليسَ أَبىٰ",
    "فَقُلنا يا آدَمُ إِنَّ هٰذا عَدُوٌّ لَكَ وَلِزَوجِكَ فَلا يُخرِجَنَّكُما مِنَ الجَنَّةِ فَتَشقىٰ",
    "إِنَّ لَكَ أَلّا تَجوعَ فيها وَلا تَعرىٰ",
    "وَأَنَّكَ لا تَظمَأُ فيها وَلا تَضحىٰ",
    "فَوَسوَسَ إِلَيهِ الشَّيطانُ قالَ يا آدَمُ هَل أَدُلُّكَ عَلىٰ شَجَرَةِ الخُلدِ وَمُلكٍ لا يَبلىٰ",
    "فَأَكَلا مِنها فَبَدَت لَهُما سَوآتُهُما وَطَفِقا يَخصِفانِ عَلَيهِما مِن وَرَقِ الجَنَّةِ ۚ وَعَصىٰ آدَمُ رَبَّهُ فَغَوىٰ",
    "ثُمَّ اجتَباهُ رَبُّهُ فَتابَ عَلَيهِ وَهَدىٰ",
    "قالَ اهبِطا مِنها جَميعًا ۖ بَعضُكُم لِبَعضٍ عَدُوٌّ ۖ فَإِمّا يَأتِيَنَّكُم مِنّي هُدًى فَمَنِ اتَّبَعَ هُدايَ فَلا يَضِلُّ وَلا يَشقىٰ",
    "وَمَن أَعرَضَ عَن ذِكري فَإِنَّ لَهُ مَعيشَةً ضَنكًا وَنَحشُرُهُ يَومَ القِيامَةِ أَعمىٰ",
    "قالَ رَبِّ لِمَ حَشَرتَني أَعمىٰ وَقَد كُنتُ بَصيرًا",
    "قالَ كَذٰلِكَ أَتَتكَ آياتُنا فَنَسيتَها ۖ وَكَذٰلِكَ اليَومَ تُنسىٰ",
    "وَكَذٰلِكَ نَجزي مَن أَسرَفَ وَلَم يُؤمِن بِآياتِ رَبِّهِ ۚ وَلَعَذابُ الآخِرَةِ أَشَدُّ وَأَبقىٰ",
    "أَفَلَم يَهدِ لَهُم كَم أَهلَكنا قَبلَهُم مِنَ القُرونِ يَمشونَ في مَساكِنِهِم ۗ إِنَّ في ذٰلِكَ لَآياتٍ لِأُولِي النُّهىٰ",
    "وَلَولا كَلِمَةٌ سَبَقَت مِن رَبِّكَ لَكانَ لِزامًا وَأَجَلٌ مُسَمًّى",
    "فَاصبِر عَلىٰ ما يَقولونَ وَسَبِّح بِحَمدِ رَبِّكَ قَبلَ طُلوعِ الشَّمسِ وَقَبلَ غُروبِها ۖ وَمِن آناءِ اللَّيلِ فَسَبِّح وَأَطرافَ النَّهارِ لَعَلَّكَ تَرضىٰ",
    "وَلا تَمُدَّنَّ عَينَيكَ إِلىٰ ما مَتَّعنا بِهِ أَزواجًا مِنهُم زَهرَةَ الحَياةِ الدُّنيا لِنَفتِنَهُم فيهِ ۚ وَرِزقُ رَبِّكَ خَيرٌ وَأَبقىٰ",
    "وَأمُر أَهلَكَ بِالصَّلاةِ وَاصطَبِر عَلَيها ۖ لا نَسأَلُكَ رِزقًا ۖ نَحنُ نَرزُقُكَ ۗ وَالعاقِبَةُ لِلتَّقوىٰ",
    "وَقالوا لَولا يَأتينا بِآيَةٍ مِن رَبِّهِ ۚ أَوَلَم تَأتِهِم بَيِّنَةُ ما فِي الصُّحُفِ الأولىٰ",
    "وَلَو أَنّا أَهلَكناهُم بِعَذابٍ مِن قَبلِهِ لَقالوا رَبَّنا لَولا أَرسَلتَ إِلَينا رَسولًا فَنَتَّبِعَ آياتِكَ مِن قَبلِ أَن نَذِلَّ وَنَخزىٰ",
    "قُل كُلٌّ مُتَرَبِّصٌ فَتَرَبَّصوا ۖ فَسَتَعلَمونَ مَن أَصحابُ الصِّراطِ السَّوِيِّ وَمَنِ اهتَدىٰ"
  ]
}