{
  "id": 21,
  "name": "الأنبياء",
  "transliteration": "Al-Anbya",
  "translation": "The Prophets",
  "verses": [
    "اقتَرَبَ لِلنّاسِ حِسابُهُم وَهُم في غَفلَةٍ مُعرِضونَ",
    "ما يَأتيهِم مِن ذِكرٍ مِن رَبِّهِم مُحدَثٍ إِلَّا استَمَعوهُ وَهُم يَلعَبونَ",
    "لاهِيَةً قُلوبُهُم ۗ وَأَسَرُّوا النَّجوَى الَّذينَ ظَلَموا هَل هٰذا إِلّا بَشَرٌ مِثلُكُم ۖ أَفَتَأتونَ السِّحرَ وَأَنتُم تُبصِرونَ",
    "قالَ رَبّي يَعلَمُ القَولَ فِي السَّماءِ وَالأَرضِ ۖ وَهُوَ السَّميعُ العَليمُ",
    "بَل قالوا أَضغاثُ أَحلامٍ بَلِ افتَراهُ بَل هُوَ شاعِرٌ فَليَأتِنا بِآيَةٍ كَما أُرسِلَ الأَوَّلونَ",
    "ما آمَنَت قَبلَهُم مِن قَريَةٍ أَهلَكناها ۖ أَفَهُم يُؤمِنونَ",
    "وَما أَرسَلنا قَبلَكَ إِلّا رِجالًا نوحي إِلَيهِم ۖ فَاسأَلوا أَهلَ الذِّكرِ إِن كُنتُم لا تَعلَمونَ",
    "وَما جَعَلناهُم جَسَدًا لا يَأكُلونَ الطَّعامَ وَما كانوا خالِدينَ",
    "ثُمَّ صَدَقناهُمُ الوَعدَ فَأَنجَيناهُم وَمَن نَشاءُ وَأَهلَكنَا المُسرِفينَ",
    "لَقَد أَنزَلنا إِلَيكُم كِتابًا فيهِ ذِكرُكُم ۖ أَفَلا تَعقِلونَ",
    "وَكَم قَصَمنا مِن قَريَةٍ كانَت ظالِمَةً وَأَنشَأنا بَعدَها قَومًا آخَرينَ",
    "فَلَمّا أَحَسّوا بَأسَنا إِذا هُم مِنها يَركُضونَ",
    "لا تَركُضوا وَارجِعوا إِلىٰ ما أُترِفتُم فيهِ وَمَساكِنِكُم لَعَلَّكُم تُسأَلونَ",
    "قالوا يا وَيلَنا إِنّا كُنّا ظالِمينَ",
    "فَما زالَت تِلكَ دَعواهُم حَتّىٰ جَعَلناهُم حَصيدًا خامِدينَ",
    "وَما خَلَقنَا السَّماءَ وَالأَرضَ وَما بَينَهُما لاعِبينَ",
    "لَو أَرَدنا أَن نَتَّخِذَ لَهوًا لَاتَّخَذناهُ مِن لَدُنّا إِن كُنّا فاعِلينَ",
    "بَل نَقذِفُ بِالحَقِّ عَلَى الباطِلِ فَيَدمَغُهُ فَإِذا هُوَ زاهِقٌ ۚ وَلَكُمُ الوَيلُ مِمّا تَصِفونَ",
    "وَلَهُ مَن فِي السَّماواتِ وَالأَرضِ ۚ وَمَن عِندَهُ لا يَستَكبِرونَ عَن عِبادَتِهِ وَلا يَستَحسِرونَ",
    "يُسَبِّحونَ اللَّيلَ وَالنَّهارَ لا يَفتُرونَ",
    "أَمِ اتَّخَذوا آلِهَةً مِنَ الأَرضِ هُم يُنشِرونَ",
    "لَو كانَ فيهِما آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتا ۚ فَسُبحانَ اللَّهِ رَبِّ العَرشِ عَمّا يَصِفونَ",
    "لا يُسأَلُ عَمّا يَفعَلُ وَهُم يُسأَلونَ",
    "أَمِ اتَّخَذوا مِن دونِهِ آلِهَةً ۖ قُل هاتوا بُرهانَكُم ۖ هٰذا ذِكرُ مَن مَعِيَ وَذِكرُ مَن قَبلي ۗ بَل أَكثَرُهُم لا يَعلَمونَ الحَقَّ ۖ فَهُم مُعرِضونَ",
    "وَما أَرسَلنا مِن قَبلِكَ مِن رَسولٍ إِلّا نوحي إِلَيهِ أَنَّهُ لا إِلٰهَ إِلّا أَنا فَاعبُدونِ",
    "وَقالُوا اتَّخَذَ الرَّحمٰنُ وَلَدًا ۗ سُبحانَهُ ۚ بَل عِبادٌ مُكرَمونَ",
    "لا يَسبِقونَهُ بِالقَولِ وَهُم بِأَمرِهِ يَعمَلونَ",
    "يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يَشفَعونَ إِلّا لِمَنِ ارتَضىٰ وَهُم مِن خَشيَتِهِ مُشفِقونَ",
    "۞ وَمَن يَقُل مِنهُم إِنّي إِلٰهٌ مِن دونِهِ فَذٰلِكَ نَجزيهِ جَهَنَّمَ ۚ كَذٰلِكَ نَجزِي الظّالِمينَ",
    "أَوَلَم يَرَ الَّذينَ كَفَروا أَنَّ السَّماواتِ وَالأَرضَ كانَتا رَتقًا فَفَتَقناهُما ۖ وَجَعَلنا مِنَ الماءِ كُلَّ شَيءٍ حَيٍّ ۖ أَفَلا يُؤمِنونَ",
    "وَجَعَلنا فِي الأَرضِ رَواسِيَ أَن تَميدَ بِهِم وَجَعَلنا فيها فِجاجًا سُبُلًا لَعَلَّهُم يَهتَدونَ",
    "وَجَعَلنَا السَّماءَ سَقفًا مَحفوظًا ۖ وَهُم عَن آياتِها مُعرِضونَ",
    "وَهُوَ الَّذي خَلَقَ اللَّيلَ وَالنَّهارَ وَالشَّمسَ وَالقَمَرَ ۖ كُلٌّ في فَلَكٍ يَسبَحونَ",
    "وَما جَعَلنا لِبَشَرٍ مِن قَبلِكَ الخُلدَ ۖ أَفَإِن مِتَّ فَهُمُ الخالِدونَ",
    "كُلُّ نَفسٍ ذائِقَةُ المَوتِ ۗ وَنَبلوكُم بِالشَّرِّ وَالخَيرِ فِتنَةً ۖ وَإِلَينا تُرجَعونَ",
    "وَإِذا رَآكَ الَّذينَ كَفَروا إِن يَتَّخِذونَكَ إِلّا هُزُوًا أَهٰذَا الَّذي يَذكُرُ آلِهَتَكُم وَهُم بِذِكرِ الرَّحمٰنِ هُم كافِرونَ",
    "خُلِقَ الإِنسانُ مِن عَجَلٍ ۚ سَأُريكُم آياتي فَلا تَستَعجِلونِ",
    "وَيَقولونَ مَتىٰ هٰذَا الوَعدُ إِن كُنتُم صادِقينَ",
    "لَو يَعلَمُ الَّذينَ كَفَروا حينَ لا يَكُفّونَ عَن وُجوهِهِمُ النّارَ وَلا عَن ظُهورِهِم وَلا هُم يُنصَرونَ",
    "بَل تَأتيهِم بَغتَةً فَتَبهَتُهُم فَلا يَستَطيعونَ رَدَّها وَلا هُم يُنظَرونَ",
    "وَلَقَدِ استُهزِئَ بِرُسُلٍ مِن قَبلِكَ فَحاقَ بِالَّذينَ سَخِروا مِنهُم ما كانوا بِهِ يَستَهزِئونَ",
    "قُل مَن يَكلَؤُكُم بِاللَّيلِ وَالنَّهارِ مِنَ الرَّحمٰنِ ۗ بَل هُم عَن ذِكرِ رَبِّهِم مُعرِضونَ",
    "أَم لَهُم آلِهَةٌ تَمنَعُهُم مِن دونِنا ۚ لا يَستَطيعونَ نَصرَ أَنفُسِهِم وَلا هُم مِنّا يُصحَبونَ",
    "بَل مَتَّعنا هٰؤُلاءِ وَآباءَهُم حَتّىٰ طالَ عَلَيهِمُ العُمُرُ ۗ أَفَلا يَرَونَ أَنّا نَأتِي الأَرضَ نَنقُصُها مِن أَطرافِها ۚ أَفَهُمُ الغالِبونَ",
    "قُل إِنَّما أُنذِرُكُم بِالوَحيِ ۚ وَلا يَسمَعُ الصُّمُّ الدُّعاءَ إِذا ما يُنذَرونَ",
    "وَلَئِن مَسَّتهُم نَفحَةٌ مِن عَذابِ رَبِّكَ لَيَقولُنَّ يا وَيلَنا إِنّا كُنّا ظالِمينَ",
    "وَنَضَعُ المَوازينَ القِسطَ لِيَومِ القِيامَةِ فَلا تُظلَمُ نَفسٌ شَيئًا ۖ وَإِن كانَ مِثقالَ حَبَّةٍ مِن خَردَلٍ أَتَينا بِها ۗ وَكَفىٰ بِنا حاسِبينَ",
    "وَلَقَد آتَينا موسىٰ وَهارونَ الفُرقانَ وَضِياءً وَذِكرًا لِلمُتَّقينَ",
    "الَّذينَ يَخشَونَ رَبَّهُم بِالغَيبِ وَهُم مِنَ السّاعَةِ مُشفِقونَ",
    "وَهٰذا ذِكرٌ مُبارَكٌ أَنزَلناهُ ۚ أَفَأَنتُم لَهُ مُنكِرونَ",
    "۞ وَلَقَد آتَينا إِبراهيمَ رُشدَهُ مِن قَبلُ وَكُنّا بِهِ عالِمينَ",
    "إِذ قالَ لِأَبيهِ وَقَومِهِ ما هٰذِهِ التَّماثيلُ الَّتي أَنتُم لَها عاكِفونَ",
    "قالوا وَجَدنا آباءَنا لَها عابِدينَ",
    "قالَ لَقَد كُنتُم أَنتُم وَآباؤُكُم في ضَلالٍ مُبينٍ",
    "قالوا أَجِئتَنا بِالحَقِّ أَم أَنتَ مِنَ اللّاعِبينَ",
    "قالَ بَل رَبُّكُم رَبُّ السَّماواتِ وَالأَرضِ الَّذي فَطَرَهُنَّ وَأَنا عَلىٰ ذٰلِكُم مِنَ الشّاهِدينَ",
    "وَتَاللَّهِ لَأَكيدَنَّ أَصنامَكُم بَعدَ أَن تُوَلّوا مُدبِرينَ",
    "فَجَعَلَهُم جُذاذًا إِلّا كَبيرًا لَهُم لَعَلَّهُم إِلَيهِ يَرجِعونَ",
    "قالوا مَن فَعَلَ هٰذا بِآلِهَتِنا إِنَّهُ لَمِنَ الظّالِمينَ",
    "قالوا سَمِعنا فَتًى يَذكُرُهُم يُقالُ لَهُ إِبراهيمُ",
    "قالوا فَأتوا بِهِ عَلىٰ أَعيُنِ النّاسِ لَعَلَّهُم يَشهَدونَ",
    "قالوا أَأَنتَ فَعَلتَ هٰذا بِآلِهَتِنا يا إِبراهيمُ",
    "قالَ بَل فَعَلَهُ كَبيرُهُم هٰذا فَاسأَلوهُم إِن كانوا يَنطِقونَ",
    "فَرَجَعوا إِلىٰ أَنفُسِهِم فَقالوا إِنَّكُم أَنتُمُ الظّالِمونَ",
    "ثُمَّ نُكِسوا عَلىٰ رُءوسِهِم لَقَد عَلِمتَ ما هٰؤُلاءِ يَنطِقونَ",
    "قالَ أَفَتَعبُدونَ مِن دونِ اللَّهِ ما لا يَنفَعُكُم شَيئًا وَلا يَضُرُّكُم",
    "أُفٍّ لَكُم وَلِما تَعبُدونَ مِن دونِ اللَّهِ ۖ أَفَلا تَعقِلونَ",
    "قالوا حَرِّقوهُ وَانصُروا آلِهَتَكُم إِن كُنتُم فاعِلينَ",
    "قُلنا يا نارُ كوني بَردًا وَسَلامًا عَلىٰ إِبراهيمَ",
    "وَأَرادوا بِهِ كَيدًا فَجَعَلناهُمُ الأَخسَرينَ",
    "وَنَجَّيناهُ وَلوطًا إِلَى الأَرضِ الَّتي بارَكنا فيها لِلعالَمينَ",
    "وَوَهَبنا لَهُ إِسحاقَ وَيَعقوبَ نافِلَةً ۖ وَكُلًّا جَعَلنا صالِحينَ",
    "وَجَعَلناهُم أَئِمَّةً يَهدونَ بِأَمرِنا وَأَوحَينا إِلَيهِم فِعلَ الخَيراتِ وَإِقامَ الصَّلاةِ وَإيتاءَ الزَّكاةِ ۖ وَكانوا لَنا عابِدينَ",
    "وَلوطًا آتَيناهُ حُكمًا وَعِلمًا وَنَجَّيناهُ مِنَ القَريَةِ الَّتي كانَت تَعمَلُ الخَبائِثَ ۗ إِنَّهُم كانوا قَومَ سَوءٍ فاسِقينَ",
    "وَأَدخَلناهُ في رَحمَتِنا ۖ إِنَّهُ مِنَ الصّالِحينَ",
    "وَنوحًا إِذ نادىٰ مِن قَبلُ فَاستَجَبنا لَهُ فَنَجَّيناهُ وَأَهلَهُ مِنَ الكَربِ العَظيمِ",
    "وَنَصَرناهُ مِنَ القَومِ الَّذينَ كَذَّبوا بِآياتِنا ۚ إِنَّهُم كانوا قَومَ سَوءٍ فَأَغرَقناهُم أَجمَعينَ",
    "وَداوودَ وَسُلَيمانَ إِذ يَحكُمانِ فِي الحَرثِ إِذ نَفَشَت فيهِ غَنَمُ القَومِ وَكُنّا لِحُكمِهِم شاهِدينَ",
    "فَفَهَّمناها سُلَيمانَ ۚ وَكُلًّا آتَينا حُكمًا وَعِلمًا ۚ وَسَخَّرنا مَعَ داوودَ الجِبالَ يُسَبِّحنَ وَالطَّيرَ ۚ وَكُنّا فاعِلينَ",
    "وَعَلَّمناهُ صَنعَةَ لَبوسٍ لَكُم لِتُحصِنَكُم مِن بَأسِكُم ۖ فَهَل أَنتُم شاكِرونَ",
    "وَلِسُلَيمانَ الرّيحَ عاصِفَةً تَجري بِأَمرِهِ إِلَى الأَرضِ الَّتي بارَكنا فيها ۚ وَكُنّا بِكُلِّ شَيءٍ عالِمينَ",
    "وَمِنَ الشَّياطينِ مَن يَغوصونَ لَهُ وَيَعمَلونَ عَمَلًا دونَ ذٰلِكَ ۖ وَكُنّا لَهُم حافِظينَ",
    "۞ وَأَيّوبَ إِذ نادىٰ رَبَّهُ أَنّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرحَمُ الرّاحِمينَ",
    "فَاستَجَبنا لَهُ فَكَشَفنا ما بِهِ مِن ضُرٍّ ۖ وَآتَيناهُ أَهلَهُ وَمِثلَهُم مَعَهُم رَحمَةً مِن عِندِنا وَذِكرىٰ لِلعابِدينَ",
    "وَإِسماعيلَ وَإِدريسَ وَذَا الكِفلِ ۖ كُلٌّ مِنَ الصّابِرينَ",
    "وَأَدخَلناهُم في رَحمَتِنا ۖ إِنَّهُم مِنَ الصّالِحينَ",
    "وَذَا النّونِ إِذ ذَهَبَ مُغاضِبًا فَظَنَّ أَن لَن نَقدِرَ عَلَيهِ فَنادىٰ فِي الظُّلُماتِ أَن لا إِلٰهَ إِلّا أَنتَ سُبحانَكَ إِنّي كُنتُ مِنَ الظّالِمينَ",
    "فَاستَجَبنا لَهُ وَنَجَّيناهُ مِنَ الغَمِّ ۚ وَكَذٰلِكَ نُنجِي المُؤمِنينَ",
    "وَزَكَرِيّا إِذ نادىٰ رَبَّهُ رَبِّ لا تَذَرني فَردًا وَأَنتَ خَيرُ الوارِثينَ",
    "فَاستَجَبنا لَهُ وَوَهَبنا لَهُ يَحيىٰ وَأَصلَحنا لَهُ زَوجَهُ ۚ إِنَّهُم كانوا يُسارِعونَ فِي الخَيراتِ وَيَدعونَنا رَغَبًا وَرَهَبًا ۖ وَكانوا لَنا خاشِعينَ",
    "وَالَّتي أَحصَنَت فَرجَها فَنَفَخنا فيها مِن روحِنا وَجَعَلناها وَابنَها آيَةً لِلعالَمينَ",
    "إِنَّ هٰذِهِ أُمَّتُكُم أُمَّةً واحِدَةً وَأَنا رَبُّكُم فَاعبُدونِ",
    "وَتَقَطَّعوا أَمرَهُم بَينَهُم ۖ كُلٌّ إِلَينا راجِعونَ",
    "فَمَن يَعمَل مِنَ الصّالِحاتِ وَهُوَ مُؤمِنٌ فَلا كُفرانَ لِسَعيِهِ وَإِنّا لَهُ كاتِبونَ",
    "وَحَرامٌ عَلىٰ قَريَةٍ أَهلَكناها أَنَّهُم لا يَرجِعونَ",
    "حَتّىٰ إِذا فُتِحَت يَأجوجُ وَمَأجوجُ وَهُم مِن كُلِّ حَدَبٍ يَنسِلونَ",
    "وَاقتَرَبَ الوَعدُ الحَقُّ فَإِذا هِيَ شاخِصَةٌ أَبصارُ الَّذينَ كَفَروا يا وَيلَنا قَد كُنّا في غَفلَةٍ مِن هٰذا بَل كُنّا ظالِمينَ",
    "إِنَّكُم وَما تَعبُدونَ مِن دونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنتُم لَها وارِدونَ",
    "لَو كانَ هٰؤُلاءِ آلِهَةً ما وَرَدوها ۖ وَكُلٌّ فيها خالِدونَ",
    "لَهُم فيها زَفيرٌ وَهُم فيها لا يَسمَعونَ",
    "إِنَّ الَّذينَ سَبَقَت لَهُم مِنَّا الحُسنىٰ أُولٰئِكَ عَنها مُبعَدونَ",
    "لا يَسمَعونَ حَسيسَها ۖ وَهُم في مَا اشتَهَت أَنفُسُهُم خالِدونَ",
    "لا يَحزُنُهُمُ الفَزَعُ الأَكبَرُ وَتَتَلَقّاهُمُ المَلائِكَةُ هٰذا يَومُكُمُ الَّذي كُنتُم توعَدونَ",
    "يَومَ نَطوِي السَّماءَ كَطَيِّ السِّجِلِّ لِلكُتُبِ ۚ كَما بَدَأنا أَوَّلَ خَلقٍ نُعيدُهُ ۚ وَعدًا عَلَينا ۚ إِنّا كُنّا فاعِلينَ",
    "وَلَقَد كَتَبنا فِي الزَّبورِ مِن بَعدِ الذِّكرِ أَنَّ الأَرضَ يَرِثُها عِبادِيَ الصّالِحونَ",
    "إِنَّ في هٰذا لَبَلاغًا لِقَومٍ عابِدينَ",
    "وَما أَرسَلناكَ إِلّا رَحمَةً لِلعالَمينَ",
    "قُل إِنَّما يوحىٰ إِلَيَّ أَنَّما إِلٰهُكُم إِلٰهٌ واحِدٌ ۖ فَهَل أَنتُم مُسلِمونَ",
    "فَإِن تَوَلَّوا فَقُل آذَنتُكُم عَلىٰ سَواءٍ ۖ وَإِن أَدري أَقَريبٌ أَم بَعيدٌ ما توعَدونَ",
    "إِنَّهُ يَعلَمُ الجَهرَ مِنَ القَولِ وَيَعلَمُ ما تَكتُمونَ",
    "وَإِن أَدري لَعَلَّهُ فِتنَةٌ لَكُم وَمَتاعٌ إِلىٰ حينٍ",
    "قالَ رَبِّ احكُم بِالحَقِّ ۗ وَرَبُّنَا الرَّحمٰنُ المُستَعانُ عَلىٰ ما تَصِفونَ"
  ]
}