{
  "id": 23,
  "name": "المؤمنون",
  "transliteration": "Al-Mu'minun",
  "translation": "The Believers",
  "verses": [
    "قَد أَفلَحَ المُؤمِنونَ",
    "الَّذينَ هُم في صَلاتِهِم خاشِعونَ",
    "وَالَّذينَ هُم عَنِ اللَّغوِ مُعرِضونَ",
    "وَالَّذينَ هُم لِلزَّكاةِ فاعِلونَ",
    "وَالَّذينَ هُم لِفُروجِهِم حافِظونَ",
    "إِلّا عَلىٰ أَزواجِهِم أَو ما مَلَكَت أَيمانُهُم فَإِنَّهُم غَيرُ مَلومينَ",
    "فَمَنِ ابتَغىٰ وَراءَ ذٰلِكَ فَأُولٰئِكَ هُمُ العادونَ",
    "وَالَّذينَ هُم لِأَماناتِهِم وَعَهدِهِم راعونَ",
    "وَالَّذينَ هُم عَلىٰ صَلَواتِهِم يُحافِظونَ",
    "أُولٰئِكَ هُمُ الوارِثونَ",
    "الَّذينَ يَرِثونَ الفِردَوسَ هُم فيها خالِدونَ",
    "وَلَقَد خَلَقنَا الإِنسانَ مِن سُلالَةٍ مِن طينٍ",
    "ثُمَّ جَعَلناهُ نُطفَةً في قَرارٍ مَكينٍ",
    "ثُمَّ خَلَقنَا النُّطفَةَ عَلَقَةً فَخَلَقنَا العَلَقَةَ مُضغَةً فَخَلَقنَا المُضغَةَ عِظامًا فَكَسَونَا العِظامَ لَحمًا ثُمَّ أَنشَأناهُ خَلقًا آخَرَ ۚ فَتَبارَكَ اللَّهُ أَحسَنُ الخالِقينَ",
    "ثُمَّ إِنَّكُم بَعدَ ذٰلِكَ لَمَيِّتونَ",
    "ثُمَّ إِنَّكُم يَومَ القِيامَةِ تُبعَثونَ",
    "وَلَقَد خَلَقنا فَوقَكُم سَبعَ طَرائِقَ وَما كُنّا عَنِ الخَلقِ غافِلينَ",
    "وَأَنزَلنا مِنَ السَّماءِ ماءً بِقَدَرٍ فَأَسكَنّاهُ فِي الأَرضِ ۖ وَإِنّا عَلىٰ ذَهابٍ بِهِ لَقادِرونَ",
    "فَأَنشَأنا لَكُم بِهِ جَنّاتٍ مِن نَخيلٍ وَأَعنابٍ لَكُم فيها فَواكِهُ كَثيرَةٌ وَمِنها تَأكُلونَ",
    "وَشَجَرَةً تَخرُجُ مِن طورِ سَيناءَ تَنبُتُ بِالدُّهنِ وَصِبغٍ لِلآكِلينَ",
    "وَإِنَّ لَكُم فِي الأَنعامِ لَعِبرَةً ۖ نُسقيكُم مِمّا في بُطونِها وَلَكُم فيها مَنافِعُ كَثيرَةٌ وَمِنها تَأكُلونَ",
    "وَعَلَيها وَعَلَى الفُلكِ تُحمَلونَ",
    "وَلَقَد أَرسَلنا نوحًا إِلىٰ قَومِهِ فَقالَ يا قَومِ اعبُدُوا اللَّهَ ما لَكُم مِن إِلٰهٍ غَيرُهُ ۖ أَفَلا تَتَّقونَ",
    "فَقالَ المَلَأُ الَّذينَ كَفَروا مِن قَومِهِ ما هٰذا إِلّا بَشَرٌ مِثلُكُم يُريدُ أَن يَتَفَضَّلَ عَلَيكُم وَلَو شاءَ اللَّهُ لَأَنزَلَ مَلائِكَةً ما سَمِعنا بِهٰذا في آبائِنَا الأَوَّلينَ",
    "إِن هُوَ إِلّا رَجُلٌ بِهِ جِنَّةٌ فَتَرَبَّصوا بِهِ حَتّىٰ حينٍ",
    "قالَ رَبِّ انصُرني بِما كَذَّبونِ",
    "فَأَوحَينا إِلَيهِ أَنِ اصنَعِ الفُلكَ بِأَعيُنِنا وَوَحيِنا فَإِذا جاءَ أَمرُنا وَفارَ التَّنّورُ ۙ فَاسلُك فيها مِن كُلٍّ زَوجَينِ اثنَينِ وَأَهلَكَ إِلّا مَن سَبَقَ عَلَيهِ القَولُ مِنهُم ۖ وَلا تُخاطِبني فِي الَّذينَ ظَلَموا ۖ إِنَّهُم مُغرَقونَ",
    "فَإِذَا استَوَيتَ أَنتَ وَمَن مَعَكَ عَلَى الفُلكِ فَقُلِ الحَمدُ لِلَّهِ الَّذي نَجّانا مِنَ القَومِ الظّالِمينَ",
    "وَقُل رَبِّ أَنزِلني مُنزَلًا مُبارَكًا وَأَنتَ خَيرُ المُنزِلينَ",
    "إِنَّ في ذٰلِكَ لَآياتٍ وَإِن كُنّا لَمُبتَلينَ",
    "ثُمَّ أَنشَأنا مِن بَعدِهِم قَرنًا آخَرينَ",
    "فَأَرسَلنا فيهِم رَسولًا مِنهُم أَنِ اعبُدُوا اللَّهَ ما لَكُم مِن إِلٰهٍ غَيرُهُ ۖ أَفَلا تَتَّقونَ",
    "وَقالَ المَلَأُ مِن قَومِهِ الَّذينَ كَفَروا وَكَذَّبوا بِلِقاءِ الآخِرَةِ وَأَترَفناهُم فِي الحَياةِ الدُّنيا ما هٰذا إِلّا بَشَرٌ مِثلُكُم يَأكُلُ مِمّا تَأكُلونَ مِنهُ وَيَشرَبُ مِمّا تَشرَبونَ",
    "وَلَئِن أَطَعتُم بَشَرًا مِثلَكُم إِنَّكُم إِذًا لَخاسِرونَ",
    "أَيَعِدُكُم أَنَّكُم إِذا مِتُّم وَكُنتُم تُرابًا وَعِظامًا أَنَّكُم مُخرَجونَ",
    "۞ هَيهاتَ هَيهاتَ لِما توعَدونَ",
    "إِن هِيَ إِلّا حَياتُنَا الدُّنيا نَموتُ وَنَحيا وَما نَحنُ بِمَبعوثينَ",
    "إِن هُوَ إِلّا رَجُلٌ افتَرىٰ عَلَى اللَّهِ كَذِبًا وَما نَحنُ لَهُ بِمُؤمِنينَ",
    "قالَ رَبِّ انصُرني بِما كَذَّبونِ",
    "قالَ عَمّا قَليلٍ لَيُصبِحُنَّ نادِمينَ",
    "فَأَخَذَتهُمُ الصَّيحَةُ بِالحَقِّ فَجَعَلناهُم غُثاءً ۚ فَبُعدًا لِلقَومِ الظّالِمينَ",
    "ثُمَّ أَنشَأنا مِن بَعدِهِم قُرونًا آخَرينَ",
    "ما تَسبِقُ مِن أُمَّةٍ أَجَلَها وَما يَستَأخِرونَ",
    "ثُمَّ أَرسَلنا رُسُلَنا تَترىٰ ۖ كُلَّ ما جاءَ أُمَّةً رَسولُها كَذَّبوهُ ۚ فَأَتبَعنا بَعضَهُم بَعضًا وَجَعَلناهُم أَحاديثَ ۚ فَبُعدًا لِقَومٍ لا يُؤمِنونَ",
    "ثُمَّ أَرسَلنا موسىٰ وَأَخاهُ هارونَ بِآياتِنا وَسُلطانٍ مُبينٍ",
    "إِلىٰ فِرعَونَ وَمَلَئِهِ فَاستَكبَروا وَكانوا قَومًا عالينَ",
    "فَقالوا أَنُؤمِنُ لِبَشَرَينِ مِثلِنا وَقَومُهُما لَنا عابِدونَ",
    "فَكَذَّبوهُما فَكانوا مِنَ المُهلَكينَ",
    "وَلَقَد آتَينا موسَى الكِتابَ لَعَلَّهُم يَهتَدونَ",
    "وَجَعَلنَا ابنَ مَريَمَ وَأُمَّهُ آيَةً وَآوَيناهُما إِلىٰ رَبوَةٍ ذاتِ قَرارٍ وَمَعينٍ",
    "يا أَيُّهَا الرُّسُلُ كُلوا مِنَ الطَّيِّباتِ وَاعمَلوا صالِحًا ۖ إِنّي بِما تَعمَلونَ عَليمٌ",
    "وَإِنَّ هٰذِهِ أُمَّتُكُم أُمَّةً واحِدَةً وَأَنا رَبُّكُم فَاتَّقونِ",
    "فَتَقَطَّعوا أَمرَهُم بَينَهُم زُبُرًا ۖ كُلُّ حِزبٍ بِما لَدَيهِم فَرِحونَ",
    "فَذَرهُم في غَمرَتِهِم حَتّىٰ حينٍ",
    "أَيَحسَبونَ أَنَّما نُمِدُّهُم بِهِ مِن مالٍ وَبَنينَ",
    "نُسارِعُ لَهُم فِي الخَيراتِ ۚ بَل لا يَشعُرونَ",
    "إِنَّ الَّذينَ هُم مِن خَشيَةِ رَبِّهِم مُشفِقونَ",
    "وَالَّذينَ هُم بِآياتِ رَبِّهِم يُؤمِنونَ",
    "وَالَّذينَ هُم بِرَبِّهِم لا يُشرِكونَ",
    "وَالَّذينَ يُؤتونَ ما آتَوا وَقُلوبُهُم وَجِلَةٌ أَنَّهُم إِلىٰ رَبِّهِم راجِعونَ",
    "أُولٰئِكَ يُسارِعونَ فِي الخَيراتِ وَهُم لَها سابِقونَ",
    "وَلا نُكَلِّفُ نَفسًا إِلّا وُسعَها ۖ وَلَدَينا كِتابٌ يَنطِقُ بِالحَقِّ ۚ وَهُم لا يُظلَمونَ",
    "بَل قُلوبُهُم في غَمرَةٍ مِن هٰذا وَلَهُم أَعمالٌ مِن دونِ ذٰلِكَ هُم لَها عامِلونَ",
    "حَتّىٰ إِذا أَخَذنا مُترَفيهِم بِالعَذابِ إِذا هُم يَجأَرونَ",
    "لا تَجأَرُوا اليَومَ ۖ إِنَّكُم مِنّا لا تُنصَرونَ",
    "قَد كانَت آياتي تُتلىٰ عَلَيكُم فَكُنتُم عَلىٰ أَعقابِكُم تَنكِصونَ",
    "مُستَكبِرينَ بِهِ سامِرًا تَهجُرونَ",
    "أَفَلَم يَدَّبَّرُوا القَولَ أَم جاءَهُم ما لَم يَأتِ آباءَهُمُ الأَوَّلينَ",
    "أَم لَم يَعرِفوا رَسولَهُم فَهُم لَهُ مُنكِرونَ",
    "أَم يَقولونَ بِهِ جِنَّةٌ ۚ بَل جاءَهُم بِالحَقِّ وَأَكثَرُهُم لِلحَقِّ كارِهونَ",
    "وَلَوِ اتَّبَعَ الحَقُّ أَهواءَهُم لَفَسَدَتِ السَّماواتُ وَالأَرضُ وَمَن فيهِنَّ ۚ بَل أَتَيناهُم بِذِكرِهِم فَهُم عَن ذِكرِهِم مُعرِضونَ",
    "أَم تَسأَلُهُم خَرجًا فَخَراجُ رَبِّكَ خَيرٌ ۖ وَهُوَ خَيرُ الرّازِقينَ",
    "وَإِنَّكَ لَتَدعوهُم إِلىٰ صِراطٍ مُستَقيمٍ",
    "وَإِنَّ الَّذينَ لا يُؤمِنونَ بِالآخِرَةِ عَنِ الصِّراطِ لَناكِبونَ",
    "۞ وَلَو رَحِمناهُم وَكَشَفنا ما بِهِم مِن ضُرٍّ لَلَجّوا في طُغيانِهِم يَعمَهونَ",
    "وَلَقَد أَخَذناهُم بِالعَذابِ فَمَا استَكانوا لِرَبِّهِم وَما يَتَضَرَّعونَ",
    "حَتّىٰ إِذا فَتَحنا عَلَيهِم بابًا ذا عَذابٍ شَديدٍ إِذا هُم فيهِ مُبلِسونَ",
    "وَهُوَ الَّذي أَنشَأَ لَكُمُ السَّمعَ وَالأَبصارَ وَالأَفئِدَةَ ۚ قَليلًا ما تَشكُرونَ",
    "وَهُوَ الَّذي ذَرَأَكُم فِي الأَرضِ وَإِلَيهِ تُحشَرونَ",
    "وَهُوَ الَّذي يُحيي وَيُميتُ وَلَهُ اختِلافُ اللَّيلِ وَالنَّهارِ ۚ أَفَلا تَعقِلونَ",
    "بَل قالوا مِثلَ ما قالَ الأَوَّلونَ",
    "قالوا أَإِذا مِتنا وَكُنّا تُرابًا وَعِظامًا أَإِنّا لَمَبعوثونَ",
    "لَقَد وُعِدنا نَحنُ وَآباؤُنا هٰذا مِن قَبلُ إِن هٰذا إِلّا أَساطيرُ الأَوَّلينَ",
    "قُل لِمَنِ الأَرضُ وَمَن فيها إِن كُنتُم تَعلَمونَ",
    "سَيَقولونَ لِلَّهِ ۚ قُل أَفَلا تَذَكَّرونَ",
    "قُل مَن رَبُّ السَّماواتِ السَّبعِ وَرَبُّ العَرشِ العَظيمِ",
    "سَيَقولونَ لِلَّهِ ۚ قُل أَفَلا تَتَّقونَ",
    "قُل مَن بِيَدِهِ مَلَكوتُ كُلِّ شَيءٍ وَهُوَ يُجيرُ وَلا يُجارُ عَلَيهِ إِن كُنتُم تَعلَمونَ",
    "سَيَقولونَ لِلَّهِ ۚ قُل فَأَنّىٰ تُسحَرونَ",
    "بَل أَتَيناهُم بِالحَقِّ وَإِنَّهُم لَكاذِبونَ",
    "مَا اتَّخَذَ اللَّهُ مِن وَلَدٍ وَما كانَ مَعَهُ مِن إِلٰهٍ ۚ إِذًا لَذَهَبَ كُلُّ إِلٰهٍ بِما خَلَقَ وَلَعَلا بَعضُهُم عَلىٰ بَعضٍ ۚ سُبحانَ اللَّهِ عَمّا يَصِفونَ",
    "عالِمِ الغَيبِ وَالشَّهادَةِ فَتَعالىٰ عَمّا يُشرِكونَ",
    "قُل رَبِّ إِمّا تُرِيَنّي ما يوعَدونَ",
    "رَبِّ فَلا تَجعَلني فِي القَومِ الظّالِمينَ",
    "وَإِنّا عَلىٰ أَن نُرِيَكَ ما نَعِدُهُم لَقادِرونَ",
    "ادفَع بِالَّتي هِيَ أَحسَنُ السَّيِّئَةَ ۚ نَحنُ أَعلَمُ بِما يَصِفونَ",
    "وَقُل رَبِّ أَعوذُ بِكَ مِن هَمَزاتِ الشَّياطينِ",
    "وَأَعوذُ بِكَ رَبِّ أَن يَحضُرونِ",
    "حَتّىٰ إِذا جاءَ أَحَدَهُمُ المَوتُ قالَ رَبِّ ارجِعونِ",
    "لَعَلّي أَعمَلُ صالِحًا فيما تَرَكتُ ۚ كَلّا ۚ إِنَّها كَلِمَةٌ هُوَ قائِلُها ۖ وَمِن وَرائِهِم بَرزَخٌ إِلىٰ يَومِ يُبعَثونَ",
    "فَإِذا نُفِخَ فِي الصّورِ فَلا أَنسابَ بَينَهُم يَومَئِذٍ وَلا يَتَساءَلونَ",
    "فَمَن ثَقُلَت مَوازينُهُ فَأُولٰئِكَ هُمُ المُفلِحونَ",
    "وَمَن خَفَّت مَوازينُهُ فَأُولٰئِكَ الَّذينَ خَسِروا أَنفُسَهُم في جَهَنَّمَ خالِدونَ",
    "تَلفَحُ وُجوهَهُمُ النّارُ وَهُم فيها كالِحونَ",
    "أَلَم تَكُن آياتي تُتلىٰ عَلَيكُم فَكُنتُم بِها تُكَذِّبونَ",
    "قالوا رَبَّنا غَلَبَت عَلَينا شِقوَتُنا وَكُنّا قَومًا ضالّينَ",
    "رَبَّنا أَخرِجنا مِنها فَإِن عُدنا فَإِنّا ظالِمونَ",
    "قالَ اخسَئوا فيها وَلا تُكَلِّمونِ",
    "إِنَّهُ كانَ فَريقٌ مِن عِبادي يَقولونَ رَبَّنا آمَنّا فَاغفِر لَنا وَارحَمنا وَأَنتَ خَيرُ الرّاحِمينَ",
    "فَاتَّخَذتُموهُم سِخرِيًّا حَتّىٰ أَنسَوكُم ذِكري وَكُنتُم مِنهُم تَضحَكونَ",
    "إِنّي جَزَيتُهُمُ اليَومَ بِما صَبَروا أَنَّهُم هُمُ الفائِزونَ",
    "قالَ كَم لَبِثتُم فِي الأَرضِ عَدَدَ سِنينَ",
    "قالوا لَبِثنا يَومًا أَو بَعضَ يَومٍ فَاسأَلِ العادّينَ",
    "قالَ إِن لَبِثتُم إِلّا قَليلًا ۖ لَو أَنَّكُم كُنتُم تَعلَمونَ",
    "أَفَحَسِبتُم أَنَّما خَلَقناكُم عَبَثًا وَأَنَّكُم إِلَينا لا تُرجَعونَ",
    "فَتَعالَى اللَّهُ المَلِكُ الحَقُّ ۖ لا إِلٰهَ إِلّا هُوَ رَبُّ العَرشِ الكَريمِ",
    "وَمَن يَدعُ مَعَ اللَّهِ إِلٰهًا آخَرَ لا بُرهانَ لَهُ بِهِ فَإِنَّما حِسابُهُ عِندَ رَبِّهِ ۚ إِنَّهُ لا يُفلِحُ الكافِرونَ",
    "وَقُل رَبِّ اغفِر وَارحَم وَأَنتَ خَيرُ الرّاحِمينَ"
  ]
}