{
  "id": 24,
  "name": "النور",
  "transliteration": "An-Nur",
  "translation": "The Light",
  "verses": [
    "سورَةٌ أَنزَلناها وَفَرَضناها وَأَنزَلنا فيها آياتٍ بَيِّناتٍ لَعَلَّكُم تَذَكَّرونَ",
    "الزّانِيَةُ وَالزّاني فَاجلِدوا كُلَّ واحِدٍ مِنهُما مِائَةَ جَلدَةٍ ۖ وَلا تَأخُذكُم بِهِما رَأفَةٌ في دينِ اللَّهِ إِن كُنتُم تُؤمِنونَ بِاللَّهِ وَاليَومِ الآخِرِ ۖ وَليَشهَد عَذابَهُما طائِفَةٌ مِنَ المُؤمِنينَ",
    "الزّاني لا يَنكِحُ إِلّا زانِيَةً أَو مُشرِكَةً وَالزّانِيَةُ لا يَنكِحُها إِلّا زانٍ أَو مُشرِكٌ ۚ وَحُرِّمَ ذٰلِكَ عَلَى المُؤمِنينَ",
    "وَالَّذينَ يَرمونَ المُحصَناتِ ثُمَّ لَم يَأتوا بِأَربَعَةِ شُهَداءَ فَاجلِدوهُم ثَمانينَ جَلدَةً وَلا تَقبَلوا لَهُم شَهادَةً أَبَدًا ۚ وَأُولٰئِكَ هُمُ الفاسِقونَ",
    "إِلَّا الَّذينَ تابوا مِن بَعدِ ذٰلِكَ وَأَصلَحوا فَإِنَّ اللَّهَ غَفورٌ رَحيمٌ",
    "وَالَّذينَ يَرمونَ أَزواجَهُم وَلَم يَكُن لَهُم شُهَداءُ إِلّا أَنفُسُهُم فَشَهادَةُ أَحَدِهِم أَربَعُ شَهاداتٍ بِاللَّهِ ۙ إِنَّهُ لَمِنَ الصّادِقينَ",
    "وَالخامِسَةُ أَنَّ لَعنَتَ اللَّهِ عَلَيهِ إِن كانَ مِنَ الكاذِبينَ",
    "وَيَدرَأُ عَنهَا العَذابَ أَن تَشهَدَ أَربَعَ شَهاداتٍ بِاللَّهِ ۙ إِنَّهُ لَمِنَ الكاذِبينَ",
    "وَالخامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيها إِن كانَ مِنَ الصّادِقينَ",
    "وَلَولا فَضلُ اللَّهِ عَلَيكُم وَرَحمَتُهُ وَأَنَّ اللَّهَ تَوّابٌ حَكيمٌ",
    "إِنَّ الَّذينَ جاءوا بِالإِفكِ عُصبَةٌ مِنكُم ۚ لا تَحسَبوهُ شَرًّا لَكُم ۖ بَل هُوَ خَيرٌ لَكُم ۚ لِكُلِّ امرِئٍ مِنهُم مَا اكتَسَبَ مِنَ الإِثمِ ۚ وَالَّذي تَوَلّىٰ كِبرَهُ مِنهُم لَهُ عَذابٌ عَظيمٌ",
    "لَولا إِذ سَمِعتُموهُ ظَنَّ المُؤمِنونَ وَالمُؤمِناتُ بِأَنفُسِهِم خَيرًا وَقالوا هٰذا إِفكٌ مُبينٌ",
    "لَولا جاءوا عَلَيهِ بِأَربَعَةِ شُهَداءَ ۚ فَإِذ لَم يَأتوا بِالشُّهَداءِ فَأُولٰئِكَ عِندَ اللَّهِ هُمُ الكاذِبونَ",
    "وَلَولا فَضلُ اللَّهِ عَلَيكُم وَرَحمَتُهُ فِي الدُّنيا وَالآخِرَةِ لَمَسَّكُم في ما أَفَضتُم فيهِ عَذابٌ عَظيمٌ",
    "إِذ تَلَقَّونَهُ بِأَلسِنَتِكُم وَتَقولونَ بِأَفواهِكُم ما لَيسَ لَكُم بِهِ عِلمٌ وَتَحسَبونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ عَظيمٌ",
    "وَلَولا إِذ سَمِعتُموهُ قُلتُم ما يَكونُ لَنا أَن نَتَكَلَّمَ بِهٰذا سُبحانَكَ هٰذا بُهتانٌ عَظيمٌ",
    "يَعِظُكُمُ اللَّهُ أَن تَعودوا لِمِثلِهِ أَبَدًا إِن كُنتُم مُؤمِنينَ",
    "وَيُبَيِّنُ اللَّهُ لَكُمُ الآياتِ ۚ وَاللَّهُ عَليمٌ حَكيمٌ",
    "إِنَّ الَّذينَ يُحِبّونَ أَن تَشيعَ الفاحِشَةُ فِي الَّذينَ آمَنوا لَهُم عَذابٌ أَليمٌ فِي الدُّنيا وَالآخِرَةِ ۚ وَاللَّهُ يَعلَمُ وَأَنتُم لا تَعلَمونَ",
    "وَلَولا فَضلُ اللَّهِ عَلَيكُم وَرَحمَتُهُ وَأَنَّ اللَّهَ رَءوفٌ رَحيمٌ",
    "۞ يا أَيُّهَا الَّذينَ آمَنوا لا تَتَّبِعوا خُطُواتِ الشَّيطانِ ۚ وَمَن يَتَّبِع خُطُواتِ الشَّيطانِ فَإِنَّهُ يَأمُرُ بِالفَحشاءِ وَالمُنكَرِ ۚ وَلَولا فَضلُ اللَّهِ عَلَيكُم وَرَحمَتُهُ ما زَكىٰ مِنكُم مِن أَحَدٍ أَبَدًا وَلٰكِنَّ اللَّهَ يُزَكّي مَن يَشاءُ ۗ وَاللَّهُ سَميعٌ عَليمٌ",
    "وَلا يَأتَلِ أُولُو الفَضلِ مِنكُم وَالسَّعَةِ أَن يُؤتوا أُولِي القُربىٰ وَالمَساكينَ وَالمُهاجِرينَ في سَبيلِ اللَّهِ ۖ وَليَعفوا وَليَصفَحوا ۗ أَلا تُحِبّونَ أَن يَغفِرَ اللَّهُ لَكُم ۗ وَاللَّهُ غَفورٌ رَحيمٌ",
    "إِنَّ الَّذينَ يَرمونَ المُحصَناتِ الغافِلاتِ المُؤمِناتِ لُعِنوا فِي الدُّنيا وَالآخِرَةِ وَلَهُم عَذابٌ عَظيمٌ",
    "يَومَ تَشهَدُ عَلَيهِم أَلسِنَتُهُم وَأَيديهِم وَأَرجُلُهُم بِما كانوا يَعمَلونَ",
    "يَومَئِذٍ يُوَفّيهِمُ اللَّهُ دينَهُمُ الحَقَّ وَيَعلَمونَ أَنَّ اللَّهَ هُوَ الحَقُّ المُبينُ",
    "الخَبيثاتُ لِلخَبيثينَ وَالخَبيثونَ لِلخَبيثاتِ ۖ وَالطَّيِّباتُ لِلطَّيِّبينَ وَالطَّيِّبونَ لِلطَّيِّباتِ ۚ أُولٰئِكَ مُبَرَّءونَ مِمّا يَقولونَ ۖ لَهُم مَغفِرَةٌ وَرِزقٌ كَريمٌ",
    "يا أَيُّهَا الَّذينَ آمَنوا لا تَدخُلوا بُيوتًا غَيرَ بُيوتِكُم حَتّىٰ تَستَأنِسوا وَتُسَلِّموا عَلىٰ أَهلِها ۚ ذٰلِكُم خَيرٌ لَكُم لَعَلَّكُم تَذَكَّرونَ",
    "فَإِن لَم تَجِدوا فيها أَحَدًا فَلا تَدخُلوها حَتّىٰ يُؤذَنَ لَكُم ۖ وَإِن قيلَ لَكُمُ ارجِعوا فَارجِعوا ۖ هُوَ أَزكىٰ لَكُم ۚ وَاللَّهُ بِما تَعمَلونَ عَليمٌ",
    "لَيسَ عَلَيكُم جُناحٌ أَن تَدخُلوا بُيوتًا غَيرَ مَسكونَةٍ فيها مَتاعٌ لَكُم ۚ وَاللَّهُ يَعلَمُ ما تُبدونَ وَما تَكتُمونَ",
    "قُل لِلمُؤمِنينَ يَغُضّوا مِن أَبصارِهِم وَيَحفَظوا فُروجَهُم ۚ ذٰلِكَ أَزكىٰ لَهُم ۗ إِنَّ اللَّهَ خَبيرٌ بِما يَصنَعونَ",
    "وَقُل لِلمُؤمِناتِ يَغضُضنَ مِن أَبصارِهِنَّ وَيَحفَظنَ فُروجَهُنَّ وَلا يُبدينَ زينَتَهُنَّ إِلّا ما ظَهَرَ مِنها ۖ وَليَضرِبنَ بِخُمُرِهِنَّ عَلىٰ جُيوبِهِنَّ ۖ وَلا يُبدينَ زينَتَهُنَّ إِلّا لِبُعولَتِهِنَّ أَو آبائِهِنَّ أَو آباءِ بُعولَتِهِنَّ أَو أَبنائِهِنَّ أَو أَبناءِ بُعولَتِهِنَّ أَو إِخوانِهِنَّ أَو بَني إِخوانِهِنَّ أَو بَني أَخَواتِهِنَّ أَو نِسائِهِنَّ أَو ما مَلَكَت أَيمانُهُنَّ أَوِ التّابِعينَ غَيرِ أُولِي الإِربَةِ مِنَ الرِّجالِ أَوِ الطِّفلِ الَّذينَ لَم يَظهَروا عَلىٰ عَوراتِ النِّساءِ ۖ وَلا يَضرِبنَ بِأَرجُلِهِنَّ لِيُعلَمَ ما يُخفينَ مِن زينَتِهِنَّ ۚ وَتوبوا إِلَى اللَّهِ جَميعًا أَيُّهَ المُؤمِنونَ لَعَلَّكُم تُفلِحونَ",
    "وَأَنكِحُوا الأَيامىٰ مِنكُم وَالصّالِحينَ مِن عِبادِكُم وَإِمائِكُم ۚ إِن يَكونوا فُقَراءَ يُغنِهِمُ اللَّهُ مِن فَضلِهِ ۗ وَاللَّهُ واسِعٌ عَليمٌ",
    "وَليَستَعفِفِ الَّذينَ لا يَجِدونَ نِكاحًا حَتّىٰ يُغنِيَهُمُ اللَّهُ مِن فَضلِهِ ۗ وَالَّذينَ يَبتَغونَ الكِتابَ مِمّا مَلَكَت أَيمانُكُم فَكاتِبوهُم إِن عَلِمتُم فيهِم خَيرًا ۖ وَآتوهُم مِن مالِ اللَّهِ الَّذي آتاكُم ۚ وَلا تُكرِهوا فَتَياتِكُم عَلَى البِغاءِ إِن أَرَدنَ تَحَصُّنًا لِتَبتَغوا عَرَضَ الحَياةِ الدُّنيا ۚ وَمَن يُكرِههُنَّ فَإِنَّ اللَّهَ مِن بَعدِ إِكراهِهِنَّ غَفورٌ رَحيمٌ",
    "وَلَقَد أَنزَلنا إِلَيكُم آياتٍ مُبَيِّناتٍ وَمَثَلًا مِنَ الَّذينَ خَلَوا مِن قَبلِكُم وَمَوعِظَةً لِلمُتَّقينَ",
    "۞ اللَّهُ نورُ السَّماواتِ وَالأَرضِ ۚ مَثَلُ نورِهِ كَمِشكاةٍ فيها مِصباحٌ ۖ المِصباحُ في زُجاجَةٍ ۖ الزُّجاجَةُ كَأَنَّها كَوكَبٌ دُرِّيٌّ يوقَدُ مِن شَجَرَةٍ مُبارَكَةٍ زَيتونَةٍ لا شَرقِيَّةٍ وَلا غَربِيَّةٍ يَكادُ زَيتُها يُضيءُ وَلَو لَم تَمسَسهُ نارٌ ۚ نورٌ عَلىٰ نورٍ ۗ يَهدِي اللَّهُ لِنورِهِ مَن يَشاءُ ۚ وَيَضرِبُ اللَّهُ الأَمثالَ لِلنّاسِ ۗ وَاللَّهُ بِكُلِّ شَيءٍ عَليمٌ",
    "في بُيوتٍ أَذِنَ اللَّهُ أَن تُرفَعَ وَيُذكَرَ فيهَا اسمُهُ يُسَبِّحُ لَهُ فيها بِالغُدُوِّ وَالآصالِ",
    "رِجالٌ لا تُلهيهِم تِجارَةٌ وَلا بَيعٌ عَن ذِكرِ اللَّهِ وَإِقامِ الصَّلاةِ وَإيتاءِ الزَّكاةِ ۙ يَخافونَ يَومًا تَتَقَلَّبُ فيهِ القُلوبُ وَالأَبصارُ",
    "لِيَجزِيَهُمُ اللَّهُ أَحسَنَ ما عَمِلوا وَيَزيدَهُم مِن فَضلِهِ ۗ وَاللَّهُ يَرزُقُ مَن يَشاءُ بِغَيرِ حِسابٍ",
    "وَالَّذينَ كَفَروا أَعمالُهُم كَسَرابٍ بِقيعَةٍ يَحسَبُهُ الظَّمآنُ ماءً حَتّىٰ إِذا جاءَهُ لَم يَجِدهُ شَيئًا وَوَجَدَ اللَّهَ عِندَهُ فَوَفّاهُ حِسابَهُ ۗ وَاللَّهُ سَريعُ الحِسابِ",
    "أَو كَظُلُماتٍ في بَحرٍ لُجِّيٍّ يَغشاهُ مَوجٌ مِن فَوقِهِ مَوجٌ مِن فَوقِهِ سَحابٌ ۚ ظُلُماتٌ بَعضُها فَوقَ بَعضٍ إِذا أَخرَجَ يَدَهُ لَم يَكَد يَراها ۗ وَمَن لَم يَجعَلِ اللَّهُ لَهُ نورًا فَما لَهُ مِن نورٍ",
    "أَلَم تَرَ أَنَّ اللَّهَ يُسَبِّحُ لَهُ مَن فِي السَّماواتِ وَالأَرضِ وَالطَّيرُ صافّاتٍ ۖ كُلٌّ قَد عَلِمَ صَلاتَهُ وَتَسبيحَهُ ۗ وَاللَّهُ عَليمٌ بِما يَفعَلونَ",
    "وَلِلَّهِ مُلكُ السَّماواتِ وَالأَرضِ ۖ وَإِلَى اللَّهِ المَصيرُ",
    "أَلَم تَرَ أَنَّ اللَّهَ يُزجي سَحابًا ثُمَّ يُؤَلِّفُ بَينَهُ ثُمَّ يَجعَلُهُ رُكامًا فَتَرَى الوَدقَ يَخرُجُ مِن خِلالِهِ وَيُنَزِّلُ مِنَ السَّماءِ مِن جِبالٍ فيها مِن بَرَدٍ فَيُصيبُ بِهِ مَن يَشاءُ وَيَصرِفُهُ عَن مَن يَشاءُ ۖ يَكادُ سَنا بَرقِهِ يَذهَبُ بِالأَبصارِ",
    "يُقَلِّبُ اللَّهُ اللَّيلَ وَالنَّهارَ ۚ إِنَّ في ذٰلِكَ لَعِبرَةً لِأُولِي الأَبصارِ",
    "وَاللَّهُ خَلَقَ كُلَّ دابَّةٍ مِن ماءٍ ۖ فَمِنهُم مَن يَمشي عَلىٰ بَطنِهِ وَمِنهُم مَن يَمشي عَلىٰ رِجلَينِ وَمِنهُم مَن يَمشي عَلىٰ أَربَعٍ ۚ يَخلُقُ اللَّهُ ما يَشاءُ ۚ إِنَّ اللَّهَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "لَقَد أَنزَلنا آياتٍ مُبَيِّناتٍ ۚ وَاللَّهُ يَهدي مَن يَشاءُ إِلىٰ صِراطٍ مُستَقيمٍ",
    "وَيَقولونَ آمَنّا بِاللَّهِ وَبِالرَّسولِ وَأَطَعنا ثُمَّ يَتَوَلّىٰ فَريقٌ مِنهُم مِن بَعدِ ذٰلِكَ ۚ وَما أُولٰئِكَ بِالمُؤمِنينَ",
    "وَإِذا دُعوا إِلَى اللَّهِ وَرَسولِهِ لِيَحكُمَ بَينَهُم إِذا فَريقٌ مِنهُم مُعرِضونَ",
    "وَإِن يَكُن لَهُمُ الحَقُّ يَأتوا إِلَيهِ مُذعِنينَ",
    "أَفي قُلوبِهِم مَرَضٌ أَمِ ارتابوا أَم يَخافونَ أَن يَحيفَ اللَّهُ عَلَيهِم وَرَسولُهُ ۚ بَل أُولٰئِكَ هُمُ الظّالِمونَ",
    "إِنَّما كانَ قَولَ المُؤمِنينَ إِذا دُعوا إِلَى اللَّهِ وَرَسولِهِ لِيَحكُمَ بَينَهُم أَن يَقولوا سَمِعنا وَأَطَعنا ۚ وَأُولٰئِكَ هُمُ المُفلِحونَ",
    "وَمَن يُطِعِ اللَّهَ وَرَسولَهُ وَيَخشَ اللَّهَ وَيَتَّقهِ فَأُولٰئِكَ هُمُ الفائِزونَ",
    "۞ وَأَقسَموا بِاللَّهِ جَهدَ أَيمانِهِم لَئِن أَمَرتَهُم لَيَخرُجُنَّ ۖ قُل لا تُقسِموا ۖ طاعَةٌ مَعروفَةٌ ۚ إِنَّ اللَّهَ خَبيرٌ بِما تَعمَلونَ",
    "قُل أَطيعُوا اللَّهَ وَأَطيعُوا الرَّسولَ ۖ فَإِن تَوَلَّوا فَإِنَّما عَلَيهِ ما حُمِّلَ وَعَلَيكُم ما حُمِّلتُم ۖ وَإِن تُطيعوهُ تَهتَدوا ۚ وَما عَلَى الرَّسولِ إِلَّا البَلاغُ المُبينُ",
    "وَعَدَ اللَّهُ الَّذينَ آمَنوا مِنكُم وَعَمِلُوا الصّالِحاتِ لَيَستَخلِفَنَّهُم فِي الأَرضِ كَمَا استَخلَفَ الَّذينَ مِن قَبلِهِم وَلَيُمَكِّنَنَّ لَهُم دينَهُمُ الَّذِي ارتَضىٰ لَهُم وَلَيُبَدِّلَنَّهُم مِن بَعدِ خَوفِهِم أَمنًا ۚ يَعبُدونَني لا يُشرِكونَ بي شَيئًا ۚ وَمَن كَفَرَ بَعدَ ذٰلِكَ فَأُولٰئِكَ هُمُ الفاسِقونَ",
    "وَأَقيمُوا الصَّلاةَ وَآتُوا الزَّكاةَ وَأَطيعُوا الرَّسولَ لَعَلَّكُم تُرحَمونَ",
    "لا تَحسَبَنَّ الَّذينَ كَفَروا مُعجِزينَ فِي الأَرضِ ۚ وَمَأواهُمُ النّارُ ۖ وَلَبِئسَ المَصيرُ",
    "يا أَيُّهَا الَّذينَ آمَنوا لِيَستَأذِنكُمُ الَّذينَ مَلَكَت أَيمانُكُم وَالَّذينَ لَم يَبلُغُوا الحُلُمَ مِنكُم ثَلاثَ مَرّاتٍ ۚ مِن قَبلِ صَلاةِ الفَجرِ وَحينَ تَضَعونَ ثِيابَكُم مِنَ الظَّهيرَةِ وَمِن بَعدِ صَلاةِ العِشاءِ ۚ ثَلاثُ عَوراتٍ لَكُم ۚ لَيسَ عَلَيكُم وَلا عَلَيهِم جُناحٌ بَعدَهُنَّ ۚ طَوّافونَ عَلَيكُم بَعضُكُم عَلىٰ بَعضٍ ۚ كَذٰلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الآياتِ ۗ وَاللَّهُ عَليمٌ حَكيمٌ",
    "وَإِذا بَلَغَ الأَطفالُ مِنكُمُ الحُلُمَ فَليَستَأذِنوا كَمَا استَأذَنَ الَّذينَ مِن قَبلِهِم ۚ كَذٰلِكَ يُبَيِّنُ اللَّهُ لَكُم آياتِهِ ۗ وَاللَّهُ عَليمٌ حَكيمٌ",
    "وَالقَواعِدُ مِنَ النِّساءِ اللّاتي لا يَرجونَ نِكاحًا فَلَيسَ عَلَيهِنَّ جُناحٌ أَن يَضَعنَ ثِيابَهُنَّ غَيرَ مُتَبَرِّجاتٍ بِزينَةٍ ۖ وَأَن يَستَعفِفنَ خَيرٌ لَهُنَّ ۗ وَاللَّهُ سَميعٌ عَليمٌ",
    "لَيسَ عَلَى الأَعمىٰ حَرَجٌ وَلا عَلَى الأَعرَجِ حَرَجٌ وَلا عَلَى المَريضِ حَرَجٌ وَلا عَلىٰ أَنفُسِكُم أَن تَأكُلوا مِن بُيوتِكُم أَو بُيوتِ آبائِكُم أَو بُيوتِ أُمَّهاتِكُم أَو بُيوتِ إِخوانِكُم أَو بُيوتِ أَخَواتِكُم أَو بُيوتِ أَعمامِكُم أَو بُيوتِ عَمّاتِكُم أَو بُيوتِ أَخوالِكُم أَو بُيوتِ خالاتِكُم أَو ما مَلَكتُم مَفاتِحَهُ أَو صَديقِكُم ۚ لَيسَ عَلَيكُم جُناحٌ أَن تَأكُلوا جَميعًا أَو أَشتاتًا ۚ فَإِذا دَخَلتُم بُيوتًا فَسَلِّموا عَلىٰ أَنفُسِكُم تَحِيَّةً مِن عِندِ اللَّهِ مُبارَكَةً طَيِّبَةً ۚ كَذٰلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الآياتِ لَعَلَّكُم تَعقِلونَ",
    "إِنَّمَا المُؤمِنونَ الَّذينَ آمَنوا بِاللَّهِ وَرَسولِهِ وَإِذا كانوا مَعَهُ عَلىٰ أَمرٍ جامِعٍ لَم يَذهَبوا حَتّىٰ يَستَأذِنوهُ ۚ إِنَّ الَّذينَ يَستَأذِنونَكَ أُولٰئِكَ الَّذينَ يُؤمِنونَ بِاللَّهِ وَرَسولِهِ ۚ فَإِذَا استَأذَنوكَ لِبَعضِ شَأنِهِم فَأذَن لِمَن شِئتَ مِنهُم وَاستَغفِر لَهُمُ اللَّهَ ۚ إِنَّ اللَّهَ غَفورٌ رَحيمٌ",
    "لا تَجعَلوا دُعاءَ الرَّسولِ بَينَكُم كَدُعاءِ بَعضِكُم بَعضًا ۚ قَد يَعلَمُ اللَّهُ الَّذينَ يَتَسَلَّلونَ مِنكُم لِواذًا ۚ فَليَحذَرِ الَّذينَ يُخالِفونَ عَن أَمرِهِ أَن تُصيبَهُم فِتنَةٌ أَو يُصيبَهُم عَذابٌ أَليمٌ",
    "أَلا إِنَّ لِلَّهِ ما فِي السَّماواتِ وَالأَرضِ ۖ قَد يَعلَمُ ما أَنتُم عَلَيهِ وَيَومَ يُرجَعونَ إِلَيهِ فَيُنَبِّئُهُم بِما عَمِلوا ۗ وَاللَّهُ بِكُلِّ شَيءٍ عَليمٌ"
  ]
}