{
  "id": 29,
  "name": "العنكبوت",
  "transliteration": "Al-'Ankabut",
  "translation": "The Spider",
  "verses": [
    "الم",
    "أَحَسِبَ النّاسُ أَن يُترَكوا أَن يَقولوا آمَنّا وَهُم لا يُفتَنونَ",
    "وَلَقَد فَتَنَّا الَّذينَ مِن قَبلِهِم ۖ فَلَيَعلَمَنَّ اللَّهُ الَّذينَ صَدَقوا وَلَيَعلَمَنَّ الكاذِبينَ",
    "أَم حَسِبَ الَّذينَ يَعمَلونَ السَّيِّئَاتِ أَن يَسبِقونا ۚ ساءَ ما يَحكُمونَ",
    "مَن كانَ يَرجو لِقاءَ اللَّهِ فَإِنَّ أَجَلَ اللَّهِ لَآتٍ ۚ وَهُوَ السَّميعُ العَليمُ",
    "وَمَن جاهَدَ فَإِنَّما يُجاهِدُ لِنَفسِهِ ۚ إِنَّ اللَّهَ لَغَنِيٌّ عَنِ العالَمينَ",
    "وَالَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ لَنُكَفِّرَنَّ عَنهُم سَيِّئَاتِهِم وَلَنَجزِيَنَّهُم أَحسَنَ الَّذي كانوا يَعمَلونَ",
    "وَوَصَّينَا الإِنسانَ بِوالِدَيهِ حُسنًا ۖ وَإِن جاهَداكَ لِتُشرِكَ بي ما لَيسَ لَكَ بِهِ عِلمٌ فَلا تُطِعهُما ۚ إِلَيَّ مَرجِعُكُم فَأُنَبِّئُكُم بِما كُنتُم تَعمَلونَ",
    "وَالَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ لَنُدخِلَنَّهُم فِي الصّالِحينَ",
    "وَمِنَ النّاسِ مَن يَقولُ آمَنّا بِاللَّهِ فَإِذا أوذِيَ فِي اللَّهِ جَعَلَ فِتنَةَ النّاسِ كَعَذابِ اللَّهِ وَلَئِن جاءَ نَصرٌ مِن رَبِّكَ لَيَقولُنَّ إِنّا كُنّا مَعَكُم ۚ أَوَلَيسَ اللَّهُ بِأَعلَمَ بِما في صُدورِ العالَمينَ",
    "وَلَيَعلَمَنَّ اللَّهُ الَّذينَ آمَنوا وَلَيَعلَمَنَّ المُنافِقينَ",
    "وَقالَ الَّذينَ كَفَروا لِلَّذينَ آمَنُوا اتَّبِعوا سَبيلَنا وَلنَحمِل خَطاياكُم وَما هُم بِحامِلينَ مِن خَطاياهُم مِن شَيءٍ ۖ إِنَّهُم لَكاذِبونَ",
    "وَلَيَحمِلُنَّ أَثقالَهُم وَأَثقالًا مَعَ أَثقالِهِم ۖ وَلَيُسأَلُنَّ يَومَ القِيامَةِ عَمّا كانوا يَفتَرونَ",
    "وَلَقَد أَرسَلنا نوحًا إِلىٰ قَومِهِ فَلَبِثَ فيهِم أَلفَ سَنَةٍ إِلّا خَمسينَ عامًا فَأَخَذَهُمُ الطّوفانُ وَهُم ظالِمونَ",
    "فَأَنجَيناهُ وَأَصحابَ السَّفينَةِ وَجَعَلناها آيَةً لِلعالَمينَ",
    "وَإِبراهيمَ إِذ قالَ لِقَومِهِ اعبُدُوا اللَّهَ وَاتَّقوهُ ۖ ذٰلِكُم خَيرٌ لَكُم إِن كُنتُم تَعلَمونَ",
    "إِنَّما تَعبُدونَ مِن دونِ اللَّهِ أَوثانًا وَتَخلُقونَ إِفكًا ۚ إِنَّ الَّذينَ تَعبُدونَ مِن دونِ اللَّهِ لا يَملِكونَ لَكُم رِزقًا فَابتَغوا عِندَ اللَّهِ الرِّزقَ وَاعبُدوهُ وَاشكُروا لَهُ ۖ إِلَيهِ تُرجَعونَ",
    "وَإِن تُكَذِّبوا فَقَد كَذَّبَ أُمَمٌ مِن قَبلِكُم ۖ وَما عَلَى الرَّسولِ إِلَّا البَلاغُ المُبينُ",
    "أَوَلَم يَرَوا كَيفَ يُبدِئُ اللَّهُ الخَلقَ ثُمَّ يُعيدُهُ ۚ إِنَّ ذٰلِكَ عَلَى اللَّهِ يَسيرٌ",
    "قُل سيروا فِي الأَرضِ فَانظُروا كَيفَ بَدَأَ الخَلقَ ۚ ثُمَّ اللَّهُ يُنشِئُ النَّشأَةَ الآخِرَةَ ۚ إِنَّ اللَّهَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "يُعَذِّبُ مَن يَشاءُ وَيَرحَمُ مَن يَشاءُ ۖ وَإِلَيهِ تُقلَبونَ",
    "وَما أَنتُم بِمُعجِزينَ فِي الأَرضِ وَلا فِي السَّماءِ ۖ وَما لَكُم مِن دونِ اللَّهِ مِن وَلِيٍّ وَلا نَصيرٍ",
    "وَالَّذينَ كَفَروا بِآياتِ اللَّهِ وَلِقائِهِ أُولٰئِكَ يَئِسوا مِن رَحمَتي وَأُولٰئِكَ لَهُم عَذابٌ أَليمٌ",
    "فَما كانَ جَوابَ قَومِهِ إِلّا أَن قالُوا اقتُلوهُ أَو حَرِّقوهُ فَأَنجاهُ اللَّهُ مِنَ النّارِ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يُؤمِنونَ",
    "وَقالَ إِنَّمَا اتَّخَذتُم مِن دونِ اللَّهِ أَوثانًا مَوَدَّةَ بَينِكُم فِي الحَياةِ الدُّنيا ۖ ثُمَّ يَومَ القِيامَةِ يَكفُرُ بَعضُكُم بِبَعضٍ وَيَلعَنُ بَعضُكُم بَعضًا وَمَأواكُمُ النّارُ وَما لَكُم مِن ناصِرينَ",
    "۞ فَآمَنَ لَهُ لوطٌ ۘ وَقالَ إِنّي مُهاجِرٌ إِلىٰ رَبّي ۖ إِنَّهُ هُوَ العَزيزُ الحَكيمُ",
    "وَوَهَبنا لَهُ إِسحاقَ وَيَعقوبَ وَجَعَلنا في ذُرِّيَّتِهِ النُّبُوَّةَ وَالكِتابَ وَآتَيناهُ أَجرَهُ فِي الدُّنيا ۖ وَإِنَّهُ فِي الآخِرَةِ لَمِنَ الصّالِحينَ",
    "وَلوطًا إِذ قالَ لِقَومِهِ إِنَّكُم لَتَأتونَ الفاحِشَةَ ما سَبَقَكُم بِها مِن أَحَدٍ مِنَ العالَمينَ",
    "أَئِنَّكُم لَتَأتونَ الرِّجالَ وَتَقطَعونَ السَّبيلَ وَتَأتونَ في ناديكُمُ المُنكَرَ ۖ فَما كانَ جَوابَ قَومِهِ إِلّا أَن قالُوا ائتِنا بِعَذابِ اللَّهِ إِن كُنتَ مِنَ الصّادِقينَ",
    "قالَ رَبِّ انصُرني عَلَى القَومِ المُفسِدينَ",
    "وَلَمّا جاءَت رُسُلُنا إِبراهيمَ بِالبُشرىٰ قالوا إِنّا مُهلِكو أَهلِ هٰذِهِ القَريَةِ ۖ إِنَّ أَهلَها كانوا ظالِمينَ",
    "قالَ إِنَّ فيها لوطًا ۚ قالوا نَحنُ أَعلَمُ بِمَن فيها ۖ لَنُنَجِّيَنَّهُ وَأَهلَهُ إِلَّا امرَأَتَهُ كانَت مِنَ الغابِرينَ",
    "وَلَمّا أَن جاءَت رُسُلُنا لوطًا سيءَ بِهِم وَضاقَ بِهِم ذَرعًا وَقالوا لا تَخَف وَلا تَحزَن ۖ إِنّا مُنَجّوكَ وَأَهلَكَ إِلَّا امرَأَتَكَ كانَت مِنَ الغابِرينَ",
    "إِنّا مُنزِلونَ عَلىٰ أَهلِ هٰذِهِ القَريَةِ رِجزًا مِنَ السَّماءِ بِما كانوا يَفسُقونَ",
    "وَلَقَد تَرَكنا مِنها آيَةً بَيِّنَةً لِقَومٍ يَعقِلونَ",
    "وَإِلىٰ مَديَنَ أَخاهُم شُعَيبًا فَقالَ يا قَومِ اعبُدُوا اللَّهَ وَارجُوا اليَومَ الآخِرَ وَلا تَعثَوا فِي الأَرضِ مُفسِدينَ",
    "فَكَذَّبوهُ فَأَخَذَتهُمُ الرَّجفَةُ فَأَصبَحوا في دارِهِم جاثِمينَ",
    "وَعادًا وَثَمودَ وَقَد تَبَيَّنَ لَكُم مِن مَساكِنِهِم ۖ وَزَيَّنَ لَهُمُ الشَّيطانُ أَعمالَهُم فَصَدَّهُم عَنِ السَّبيلِ وَكانوا مُستَبصِرينَ",
    "وَقارونَ وَفِرعَونَ وَهامانَ ۖ وَلَقَد جاءَهُم موسىٰ بِالبَيِّناتِ فَاستَكبَروا فِي الأَرضِ وَما كانوا سابِقينَ",
    "فَكُلًّا أَخَذنا بِذَنبِهِ ۖ فَمِنهُم مَن أَرسَلنا عَلَيهِ حاصِبًا وَمِنهُم مَن أَخَذَتهُ الصَّيحَةُ وَمِنهُم مَن خَسَفنا بِهِ الأَرضَ وَمِنهُم مَن أَغرَقنا ۚ وَما كانَ اللَّهُ لِيَظلِمَهُم وَلٰكِن كانوا أَنفُسَهُم يَظلِمونَ",
    "مَثَلُ الَّذينَ اتَّخَذوا مِن دونِ اللَّهِ أَولِياءَ كَمَثَلِ العَنكَبوتِ اتَّخَذَت بَيتًا ۖ وَإِنَّ أَوهَنَ البُيوتِ لَبَيتُ العَنكَبوتِ ۖ لَو كانوا يَعلَمونَ",
    "إِنَّ اللَّهَ يَعلَمُ ما يَدعونَ مِن دونِهِ مِن شَيءٍ ۚ وَهُوَ العَزيزُ الحَكيمُ",
    "وَتِلكَ الأَمثالُ نَضرِبُها لِلنّاسِ ۖ وَما يَعقِلُها إِلَّا العالِمونَ",
    "خَلَقَ اللَّهُ السَّماواتِ وَالأَرضَ بِالحَقِّ ۚ إِنَّ في ذٰلِكَ لَآيَةً لِلمُؤمِنينَ",
    "اتلُ ما أوحِيَ إِلَيكَ مِنَ الكِتابِ وَأَقِمِ الصَّلاةَ ۖ إِنَّ الصَّلاةَ تَنهىٰ عَنِ الفَحشاءِ وَالمُنكَرِ ۗ وَلَذِكرُ اللَّهِ أَكبَرُ ۗ وَاللَّهُ يَعلَمُ ما تَصنَعونَ",
    "۞ وَلا تُجادِلوا أَهلَ الكِتابِ إِلّا بِالَّتي هِيَ أَحسَنُ إِلَّا الَّذينَ ظَلَموا مِنهُم ۖ وَقولوا آمَنّا بِالَّذي أُنزِلَ إِلَينا وَأُنزِلَ إِلَيكُم وَإِلٰهُنا وَإِلٰهُكُم واحِدٌ وَنَحنُ لَهُ مُسلِمونَ",
    "وَكَذٰلِكَ أَنزَلنا إِلَيكَ الكِتابَ ۚ فَالَّذينَ آتَيناهُمُ الكِتابَ يُؤمِنونَ بِهِ ۖ وَمِن هٰؤُلاءِ مَن يُؤمِنُ بِهِ ۚ وَما يَجحَدُ بِآياتِنا إِلَّا الكافِرونَ",
    "وَما كُنتَ تَتلو مِن قَبلِهِ مِن كِتابٍ وَلا تَخُطُّهُ بِيَمينِكَ ۖ إِذًا لَارتابَ المُبطِلونَ",
    "بَل هُوَ آياتٌ بَيِّناتٌ في صُدورِ الَّذينَ أوتُوا العِلمَ ۚ وَما يَجحَدُ بِآياتِنا إِلَّا الظّالِمونَ",
    "وَقالوا لَولا أُنزِلَ عَلَيهِ آياتٌ مِن رَبِّهِ ۖ قُل إِنَّمَا الآياتُ عِندَ اللَّهِ وَإِنَّما أَنا نَذيرٌ مُبينٌ",
    "أَوَلَم يَكفِهِم أَنّا أَنزَلنا عَلَيكَ الكِتابَ يُتلىٰ عَلَيهِم ۚ إِنَّ في ذٰلِكَ لَرَحمَةً وَذِكرىٰ لِقَومٍ يُؤمِنونَ",
    "قُل كَفىٰ بِاللَّهِ بَيني وَبَينَكُم شَهيدًا ۖ يَعلَمُ ما فِي السَّماواتِ وَالأَرضِ ۗ وَالَّذينَ آمَنوا بِالباطِلِ وَكَفَروا بِاللَّهِ أُولٰئِكَ هُمُ الخاسِرونَ",
    "وَيَستَعجِلونَكَ بِالعَذابِ ۚ وَلَولا أَجَلٌ مُسَمًّى لَجاءَهُمُ العَذابُ وَلَيَأتِيَنَّهُم بَغتَةً وَهُم لا يَشعُرونَ",
    "يَستَعجِلونَكَ بِالعَذابِ وَإِنَّ جَهَنَّمَ لَمُحيطَةٌ بِالكافِرينَ",
    "يَومَ يَغشاهُمُ العَذابُ مِن فَوقِهِم وَمِن تَحتِ أَرجُلِهِم وَيَقولُ ذوقوا ما كُنتُم تَعمَلونَ",
    "يا عِبادِيَ الَّذينَ آمَنوا إِنَّ أَرضي واسِعَةٌ فَإِيّايَ فَاعبُدونِ",
    "كُلُّ نَفسٍ ذائِقَةُ المَوتِ ۖ ثُمَّ إِلَينا تُرجَعونَ",
    "وَالَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ لَنُبَوِّئَنَّهُم مِنَ الجَنَّةِ غُرَفًا تَجري مِن تَحتِهَا الأَنهارُ خالِدينَ فيها ۚ نِعمَ أَجرُ العامِلينَ",
    "الَّذينَ صَبَروا وَعَلىٰ رَبِّهِم يَتَوَكَّلونَ",
    "وَكَأَيِّن مِن دابَّةٍ لا تَحمِلُ رِزقَهَا اللَّهُ يَرزُقُها وَإِيّاكُم ۚ وَهُوَ السَّميعُ العَليمُ",
    "وَلَئِن سَأَلتَهُم مَن خَلَقَ السَّماواتِ وَالأَرضَ وَسَخَّرَ الشَّمسَ وَالقَمَرَ لَيَقولُنَّ اللَّهُ ۖ فَأَنّىٰ يُؤفَكونَ",
    "اللَّهُ يَبسُطُ الرِّزقَ لِمَن يَشاءُ مِن عِبادِهِ وَيَقدِرُ لَهُ ۚ إِنَّ اللَّهَ بِكُلِّ شَيءٍ عَليمٌ",
    "وَلَئِن سَأَلتَهُم مَن نَزَّلَ مِنَ السَّماءِ ماءً فَأَحيا بِهِ الأَرضَ مِن بَعدِ مَوتِها لَيَقولُنَّ اللَّهُ ۚ قُلِ الحَمدُ لِلَّهِ ۚ بَل أَكثَرُهُم لا يَعقِلونَ",
    "وَما هٰذِهِ الحَياةُ الدُّنيا إِلّا لَهوٌ وَلَعِبٌ ۚ وَإِنَّ الدّارَ الآخِرَةَ لَهِيَ الحَيَوانُ ۚ لَو كانوا يَعلَمونَ",
    "فَإِذا رَكِبوا فِي الفُلكِ دَعَوُا اللَّهَ مُخلِصينَ لَهُ الدّينَ فَلَمّا نَجّاهُم إِلَى البَرِّ إِذا هُم يُشرِكونَ",
    "لِيَكفُروا بِما آتَيناهُم وَلِيَتَمَتَّعوا ۖ فَسَوفَ يَعلَمونَ",
    "أَوَلَم يَرَوا أَنّا جَعَلنا حَرَمًا آمِنًا وَيُتَخَطَّفُ النّاسُ مِن حَولِهِم ۚ أَفَبِالباطِلِ يُؤمِنونَ وَبِنِعمَةِ اللَّهِ يَكفُرونَ",
    "وَمَن أَظلَمُ مِمَّنِ افتَرىٰ عَلَى اللَّهِ كَذِبًا أَو كَذَّبَ بِالحَقِّ لَمّا جاءَهُ ۚ أَلَيسَ في جَهَنَّمَ مَثوًى لِلكافِرينَ",
    "وَالَّذينَ جاهَدوا فينا لَنَهدِيَنَّهُم سُبُلَنا ۚ وَإِنَّ اللَّهَ لَمَعَ المُحسِنينَ"
  ]
}