{
  "id": 30,
  "name": "الروم",
  "transliteration": "Ar-Rum",
  "translation": "The Romans",
  "verses": [
    "الم",
    "غُلِبَتِ الرّومُ",
    "في أَدنَى الأَرضِ وَهُم مِن بَعدِ غَلَبِهِم سَيَغلِبونَ",
    "في بِضعِ سِنينَ ۗ لِلَّهِ الأَمرُ مِن قَبلُ وَمِن بَعدُ ۚ وَيَومَئِذٍ يَفرَحُ المُؤمِنونَ",
    "بِنَصرِ اللَّهِ ۚ يَنصُرُ مَن يَشاءُ ۖ وَهُوَ العَزيزُ الرَّحيمُ",
    "وَعدَ اللَّهِ ۖ لا يُخلِفُ اللَّهُ وَعدَهُ وَلٰكِنَّ أَكثَرَ النّاسِ لا يَعلَمونَ",
    "يَعلَمونَ ظاهِرًا مِنَ الحَياةِ الدُّنيا وَهُم عَنِ الآخِرَةِ هُم غافِلونَ",
    "أَوَلَم يَتَفَكَّروا في أَنفُسِهِم ۗ ما خَلَقَ اللَّهُ السَّماواتِ وَالأَرضَ وَما بَينَهُما إِلّا بِالحَقِّ وَأَجَلٍ مُسَمًّى ۗ وَإِنَّ كَثيرًا مِنَ النّاسِ بِلِقاءِ رَبِّهِم لَكافِرونَ",
    "أَوَلَم يَسيروا فِي الأَرضِ فَيَنظُروا كَيفَ كانَ عاقِبَةُ الَّذينَ مِن قَبلِهِم ۚ كانوا أَشَدَّ مِنهُم قُوَّةً وَأَثارُوا الأَرضَ وَعَمَروها أَكثَرَ مِمّا عَمَروها وَجاءَتهُم رُسُلُهُم بِالبَيِّناتِ ۖ فَما كانَ اللَّهُ لِيَظلِمَهُم وَلٰكِن كانوا أَنفُسَهُم يَظلِمونَ",
    "ثُمَّ كانَ عاقِبَةَ الَّذينَ أَساءُوا السّوأىٰ أَن كَذَّبوا بِآياتِ اللَّهِ وَكانوا بِها يَستَهزِئونَ",
    "اللَّهُ يَبدَأُ الخَلقَ ثُمَّ يُعيدُهُ ثُمَّ إِلَيهِ تُرجَعونَ",
    "وَيَومَ تَقومُ السّاعَةُ يُبلِسُ المُجرِمونَ",
    "وَلَم يَكُن لَهُم مِن شُرَكائِهِم شُفَعاءُ وَكانوا بِشُرَكائِهِم كافِرينَ",
    "وَيَومَ تَقومُ السّاعَةُ يَومَئِذٍ يَتَفَرَّقونَ",
    "فَأَمَّا الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ فَهُم في رَوضَةٍ يُحبَرونَ",
    "وَأَمَّا الَّذينَ كَفَروا وَكَذَّبوا بِآياتِنا وَلِقاءِ الآخِرَةِ فَأُولٰئِكَ فِي العَذابِ مُحضَرونَ",
    "فَسُبحانَ اللَّهِ حينَ تُمسونَ وَحينَ تُصبِحونَ",
    "وَلَهُ الحَمدُ فِي السَّماواتِ وَالأَرضِ وَعَشِيًّا وَحينَ تُظهِرونَ",
    "يُخرِجُ الحَيَّ مِنَ المَيِّتِ وَيُخرِجُ المَيِّتَ مِنَ الحَيِّ وَيُحيِي الأَرضَ بَعدَ مَوتِها ۚ وَكَذٰلِكَ تُخرَجونَ",
    "وَمِن آياتِهِ أَن خَلَقَكُم مِن تُرابٍ ثُمَّ إِذا أَنتُم بَشَرٌ تَنتَشِرونَ",
    "وَمِن آياتِهِ أَن خَلَقَ لَكُم مِن أَنفُسِكُم أَزواجًا لِتَسكُنوا إِلَيها وَجَعَلَ بَينَكُم مَوَدَّةً وَرَحمَةً ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يَتَفَكَّرونَ",
    "وَمِن آياتِهِ خَلقُ السَّماواتِ وَالأَرضِ وَاختِلافُ أَلسِنَتِكُم وَأَلوانِكُم ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِلعالِمينَ",
    "وَمِن آياتِهِ مَنامُكُم بِاللَّيلِ وَالنَّهارِ وَابتِغاؤُكُم مِن فَضلِهِ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يَسمَعونَ",
    "وَمِن آياتِهِ يُريكُمُ البَرقَ خَوفًا وَطَمَعًا وَيُنَزِّلُ مِنَ السَّماءِ ماءً فَيُحيي بِهِ الأَرضَ بَعدَ مَوتِها ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يَعقِلونَ",
    "وَمِن آياتِهِ أَن تَقومَ السَّماءُ وَالأَرضُ بِأَمرِهِ ۚ ثُمَّ إِذا دَعاكُم دَعوَةً مِنَ الأَرضِ إِذا أَنتُم تَخرُجونَ",
    "وَلَهُ مَن فِي السَّماواتِ وَالأَرضِ ۖ كُلٌّ لَهُ قانِتونَ",
    "وَهُوَ الَّذي يَبدَأُ الخَلقَ ثُمَّ يُعيدُهُ وَهُوَ أَهوَنُ عَلَيهِ ۚ وَلَهُ المَثَلُ الأَعلىٰ فِي السَّماواتِ وَالأَرضِ ۚ وَهُوَ العَزيزُ الحَكيمُ",
    "ضَرَبَ لَكُم مَثَلًا مِن أَنفُسِكُم ۖ هَل لَكُم مِن ما مَلَكَت أَيمانُكُم مِن شُرَكاءَ في ما رَزَقناكُم فَأَنتُم فيهِ سَواءٌ تَخافونَهُم كَخيفَتِكُم أَنفُسَكُم ۚ كَذٰلِكَ نُفَصِّلُ الآياتِ لِقَومٍ يَعقِلونَ",
    "بَلِ اتَّبَعَ الَّذينَ ظَلَموا أَهواءَهُم بِغَيرِ عِلمٍ ۖ فَمَن يَهدي مَن أَضَلَّ اللَّهُ ۖ وَما لَهُم مِن ناصِرينَ",
    "فَأَقِم وَجهَكَ لِلدّينِ حَنيفًا ۚ فِطرَتَ اللَّهِ الَّتي فَطَرَ النّاسَ عَلَيها ۚ لا تَبديلَ لِخَلقِ اللَّهِ ۚ ذٰلِكَ الدّينُ القَيِّمُ وَلٰكِنَّ أَكثَرَ النّاسِ لا يَعلَمونَ",
    "۞ مُنيبينَ إِلَيهِ وَاتَّقوهُ وَأَقيمُوا الصَّلاةَ وَلا تَكونوا مِنَ المُشرِكينَ",
    "مِنَ الَّذينَ فَرَّقوا دينَهُم وَكانوا شِيَعًا ۖ كُلُّ حِزبٍ بِما لَدَيهِم فَرِحونَ",
    "وَإِذا مَسَّ النّاسَ ضُرٌّ دَعَوا رَبَّهُم مُنيبينَ إِلَيهِ ثُمَّ إِذا أَذاقَهُم مِنهُ رَحمَةً إِذا فَريقٌ مِنهُم بِرَبِّهِم يُشرِكونَ",
    "لِيَكفُروا بِما آتَيناهُم ۚ فَتَمَتَّعوا فَسَوفَ تَعلَمونَ",
    "أَم أَنزَلنا عَلَيهِم سُلطانًا فَهُوَ يَتَكَلَّمُ بِما كانوا بِهِ يُشرِكونَ",
    "وَإِذا أَذَقنَا النّاسَ رَحمَةً فَرِحوا بِها ۖ وَإِن تُصِبهُم سَيِّئَةٌ بِما قَدَّمَت أَيديهِم إِذا هُم يَقنَطونَ",
    "أَوَلَم يَرَوا أَنَّ اللَّهَ يَبسُطُ الرِّزقَ لِمَن يَشاءُ وَيَقدِرُ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يُؤمِنونَ",
    "فَآتِ ذَا القُربىٰ حَقَّهُ وَالمِسكينَ وَابنَ السَّبيلِ ۚ ذٰلِكَ خَيرٌ لِلَّذينَ يُريدونَ وَجهَ اللَّهِ ۖ وَأُولٰئِكَ هُمُ المُفلِحونَ",
    "وَما آتَيتُم مِن رِبًا لِيَربُوَ في أَموالِ النّاسِ فَلا يَربو عِندَ اللَّهِ ۖ وَما آتَيتُم مِن زَكاةٍ تُريدونَ وَجهَ اللَّهِ فَأُولٰئِكَ هُمُ المُضعِفونَ",
    "اللَّهُ الَّذي خَلَقَكُم ثُمَّ رَزَقَكُم ثُمَّ يُميتُكُم ثُمَّ يُحييكُم ۖ هَل مِن شُرَكائِكُم مَن يَفعَلُ مِن ذٰلِكُم مِن شَيءٍ ۚ سُبحانَهُ وَتَعالىٰ عَمّا يُشرِكونَ",
    "ظَهَرَ الفَسادُ فِي البَرِّ وَالبَحرِ بِما كَسَبَت أَيدِي النّاسِ لِيُذيقَهُم بَعضَ الَّذي عَمِلوا لَعَلَّهُم يَرجِعونَ",
    "قُل سيروا فِي الأَرضِ فَانظُروا كَيفَ كانَ عاقِبَةُ الَّذينَ مِن قَبلُ ۚ كانَ أَكثَرُهُم مُشرِكينَ",
    "فَأَقِم وَجهَكَ لِلدّينِ القَيِّمِ مِن قَبلِ أَن يَأتِيَ يَومٌ لا مَرَدَّ لَهُ مِنَ اللَّهِ ۖ يَومَئِذٍ يَصَّدَّعونَ",
    "مَن كَفَرَ فَعَلَيهِ كُفرُهُ ۖ وَمَن عَمِلَ صالِحًا فَلِأَنفُسِهِم يَمهَدونَ",
    "لِيَجزِيَ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ مِن فَضلِهِ ۚ إِنَّهُ لا يُحِبُّ الكافِرينَ",
    "وَمِن آياتِهِ أَن يُرسِلَ الرِّياحَ مُبَشِّراتٍ وَلِيُذيقَكُم مِن رَحمَتِهِ وَلِتَجرِيَ الفُلكُ بِأَمرِهِ وَلِتَبتَغوا مِن فَضلِهِ وَلَعَلَّكُم تَشكُرونَ",
    "وَلَقَد أَرسَلنا مِن قَبلِكَ رُسُلًا إِلىٰ قَومِهِم فَجاءوهُم بِالبَيِّناتِ فَانتَقَمنا مِنَ الَّذينَ أَجرَموا ۖ وَكانَ حَقًّا عَلَينا نَصرُ المُؤمِنينَ",
    "اللَّهُ الَّذي يُرسِلُ الرِّياحَ فَتُثيرُ سَحابًا فَيَبسُطُهُ فِي السَّماءِ كَيفَ يَشاءُ وَيَجعَلُهُ كِسَفًا فَتَرَى الوَدقَ يَخرُجُ مِن خِلالِهِ ۖ فَإِذا أَصابَ بِهِ مَن يَشاءُ مِن عِبادِهِ إِذا هُم يَستَبشِرونَ",
    "وَإِن كانوا مِن قَبلِ أَن يُنَزَّلَ عَلَيهِم مِن قَبلِهِ لَمُبلِسينَ",
    "فَانظُر إِلىٰ آثارِ رَحمَتِ اللَّهِ كَيفَ يُحيِي الأَرضَ بَعدَ مَوتِها ۚ إِنَّ ذٰلِكَ لَمُحيِي المَوتىٰ ۖ وَهُوَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "وَلَئِن أَرسَلنا ريحًا فَرَأَوهُ مُصفَرًّا لَظَلّوا مِن بَعدِهِ يَكفُرونَ",
    "فَإِنَّكَ لا تُسمِعُ المَوتىٰ وَلا تُسمِعُ الصُّمَّ الدُّعاءَ إِذا وَلَّوا مُدبِرينَ",
    "وَما أَنتَ بِهادِ العُميِ عَن ضَلالَتِهِم ۖ إِن تُسمِعُ إِلّا مَن يُؤمِنُ بِآياتِنا فَهُم مُسلِمونَ",
    "۞ اللَّهُ الَّذي خَلَقَكُم مِن ضَعفٍ ثُمَّ جَعَلَ مِن بَعدِ ضَعفٍ قُوَّةً ثُمَّ جَعَلَ مِن بَعدِ قُوَّةٍ ضَعفًا وَشَيبَةً ۚ يَخلُقُ ما يَشاءُ ۖ وَهُوَ العَليمُ القَديرُ",
    "وَيَومَ تَقومُ السّاعَةُ يُقسِمُ المُجرِمونَ ما لَبِثوا غَيرَ ساعَةٍ ۚ كَذٰلِكَ كانوا يُؤفَكونَ",
    "وَقالَ الَّذينَ أوتُوا العِلمَ وَالإيمانَ لَقَد لَبِثتُم في كِتابِ اللَّهِ إِلىٰ يَومِ البَعثِ ۖ فَهٰذا يَومُ البَعثِ وَلٰكِنَّكُم كُنتُم لا تَعلَمونَ",
    "فَيَومَئِذٍ لا يَنفَعُ الَّذينَ ظَلَموا مَعذِرَتُهُم وَلا هُم يُستَعتَبونَ",
    "وَلَقَد ضَرَبنا لِلنّاسِ في هٰذَا القُرآنِ مِن كُلِّ مَثَلٍ ۚ وَلَئِن جِئتَهُم بِآيَةٍ لَيَقولَنَّ الَّذينَ كَفَروا إِن أَنتُم إِلّا مُبطِلونَ",
    "كَذٰلِكَ يَطبَعُ اللَّهُ عَلىٰ قُلوبِ الَّذينَ لا يَعلَمونَ",
    "فَاصبِر إِنَّ وَعدَ اللَّهِ حَقٌّ ۖ وَلا يَستَخِفَّنَّكَ الَّذينَ لا يوقِنونَ"
  ]
}