{
  "id": 31,
  "name": "لقمان",
  "transliteration": "Luqman",
  "translation": "Luqman",
  "verses": [
    "الم",
    "تِلكَ آياتُ الكِتابِ الحَكيمِ",
    "هُدًى وَرَحمَةً لِلمُحسِنينَ",
    "الَّذينَ يُقيمونَ الصَّلاةَ وَيُؤتونَ الزَّكاةَ وَهُم بِالآخِرَةِ هُم يوقِنونَ",
    "أُولٰئِكَ عَلىٰ هُدًى مِن رَبِّهِم ۖ وَأُولٰئِكَ هُمُ المُفلِحونَ",
    "وَمِنَ النّاسِ مَن يَشتَري لَهوَ الحَديثِ لِيُضِلَّ عَن سَبيلِ اللَّهِ بِغَيرِ عِلمٍ وَيَتَّخِذَها هُزُوًا ۚ أُولٰئِكَ لَهُم عَذابٌ مُهينٌ",
    "وَإِذا تُتلىٰ عَلَيهِ آياتُنا وَلّىٰ مُستَكبِرًا كَأَن لَم يَسمَعها كَأَنَّ في أُذُنَيهِ وَقرًا ۖ فَبَشِّرهُ بِعَذابٍ أَليمٍ",
    "إِنَّ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ لَهُم جَنّاتُ النَّعيمِ",
    "خالِدينَ فيها ۖ وَعدَ اللَّهِ حَقًّا ۚ وَهُوَ العَزيزُ الحَكيمُ",
    "خَلَقَ السَّماواتِ بِغَيرِ عَمَدٍ تَرَونَها ۖ وَأَلقىٰ فِي الأَرضِ رَواسِيَ أَن تَميدَ بِكُم وَبَثَّ فيها مِن كُلِّ دابَّةٍ ۚ وَأَنزَلنا مِنَ السَّماءِ ماءً فَأَنبَتنا فيها مِن كُلِّ زَوجٍ كَريمٍ",
    "هٰذا خَلقُ اللَّهِ فَأَروني ماذا خَلَقَ الَّذينَ مِن دونِهِ ۚ بَلِ الظّالِمونَ في ضَلالٍ مُبينٍ",
    "وَلَقَد آتَينا لُقمانَ الحِكمَةَ أَنِ اشكُر لِلَّهِ ۚ وَمَن يَشكُر فَإِنَّما يَشكُرُ لِنَفسِهِ ۖ وَمَن كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ حَميدٌ",
    "وَإِذ قالَ لُقمانُ لِابنِهِ وَهُوَ يَعِظُهُ يا بُنَيَّ لا تُشرِك بِاللَّهِ ۖ إِنَّ الشِّركَ لَظُلمٌ عَظيمٌ",
    "وَوَصَّينَا الإِنسانَ بِوالِدَيهِ حَمَلَتهُ أُمُّهُ وَهنًا عَلىٰ وَهنٍ وَفِصالُهُ في عامَينِ أَنِ اشكُر لي وَلِوالِدَيكَ إِلَيَّ المَصيرُ",
    "وَإِن جاهَداكَ عَلىٰ أَن تُشرِكَ بي ما لَيسَ لَكَ بِهِ عِلمٌ فَلا تُطِعهُما ۖ وَصاحِبهُما فِي الدُّنيا مَعروفًا ۖ وَاتَّبِع سَبيلَ مَن أَنابَ إِلَيَّ ۚ ثُمَّ إِلَيَّ مَرجِعُكُم فَأُنَبِّئُكُم بِما كُنتُم تَعمَلونَ",
    "يا بُنَيَّ إِنَّها إِن تَكُ مِثقالَ حَبَّةٍ مِن خَردَلٍ فَتَكُن في صَخرَةٍ أَو فِي السَّماواتِ أَو فِي الأَرضِ يَأتِ بِهَا اللَّهُ ۚ إِنَّ اللَّهَ لَطيفٌ خَبيرٌ",
    "يا بُنَيَّ أَقِمِ الصَّلاةَ وَأمُر بِالمَعروفِ وَانهَ عَنِ المُنكَرِ وَاصبِر عَلىٰ ما أَصابَكَ ۖ إِنَّ ذٰلِكَ مِن عَزمِ الأُمورِ",
    "وَلا تُصَعِّر خَدَّكَ لِلنّاسِ وَلا تَمشِ فِي الأَرضِ مَرَحًا ۖ إِنَّ اللَّهَ لا يُحِبُّ كُلَّ مُختالٍ فَخورٍ",
    "وَاقصِد في مَشيِكَ وَاغضُض مِن صَوتِكَ ۚ إِنَّ أَنكَرَ الأَصواتِ لَصَوتُ الحَميرِ",
    "أَلَم تَرَوا أَنَّ اللَّهَ سَخَّرَ لَكُم ما فِي السَّماواتِ وَما فِي الأَرضِ وَأَسبَغَ عَلَيكُم نِعَمَهُ ظاهِرَةً وَباطِنَةً ۗ وَمِنَ النّاسِ مَن يُجادِلُ فِي اللَّهِ بِغَيرِ عِلمٍ وَلا هُدًى وَلا كِتابٍ مُنيرٍ",
    "وَإِذا قيلَ لَهُمُ اتَّبِعوا ما أَنزَلَ اللَّهُ قالوا بَل نَتَّبِعُ ما وَجَدنا عَلَيهِ آباءَنا ۚ أَوَلَو كانَ الشَّيطانُ يَدعوهُم إِلىٰ عَذابِ السَّعيرِ",
    "۞ وَمَن يُسلِم وَجهَهُ إِلَى اللَّهِ وَهُوَ مُحسِنٌ فَقَدِ استَمسَكَ بِالعُروَةِ الوُثقىٰ ۗ وَإِلَى اللَّهِ عاقِبَةُ الأُمورِ",
    "وَمَن كَفَرَ فَلا يَحزُنكَ كُفرُهُ ۚ إِلَينا مَرجِعُهُم فَنُنَبِّئُهُم بِما عَمِلوا ۚ إِنَّ اللَّهَ عَليمٌ بِذاتِ الصُّدورِ",
    "نُمَتِّعُهُم قَليلًا ثُمَّ نَضطَرُّهُم إِلىٰ عَذابٍ غَليظٍ",
    "وَلَئِن سَأَلتَهُم مَن خَلَقَ السَّماواتِ وَالأَرضَ لَيَقولُنَّ اللَّهُ ۚ قُلِ الحَمدُ لِلَّهِ ۚ بَل أَكثَرُهُم لا يَعلَمونَ",
    "لِلَّهِ ما فِي السَّماواتِ وَالأَرضِ ۚ إِنَّ اللَّهَ هُوَ الغَنِيُّ الحَميدُ",
    "وَلَو أَنَّما فِي الأَرضِ مِن شَجَرَةٍ أَقلامٌ وَالبَحرُ يَمُدُّهُ مِن بَعدِهِ سَبعَةُ أَبحُرٍ ما نَفِدَت كَلِماتُ اللَّهِ ۗ إِنَّ اللَّهَ عَزيزٌ حَكيمٌ",
    "ما خَلقُكُم وَلا بَعثُكُم إِلّا كَنَفسٍ واحِدَةٍ ۗ إِنَّ اللَّهَ سَميعٌ بَصيرٌ",
    "أَلَم تَرَ أَنَّ اللَّهَ يولِجُ اللَّيلَ فِي النَّهارِ وَيولِجُ النَّهارَ فِي اللَّيلِ وَسَخَّرَ الشَّمسَ وَالقَمَرَ كُلٌّ يَجري إِلىٰ أَجَلٍ مُسَمًّى وَأَنَّ اللَّهَ بِما تَعمَلونَ خَبيرٌ",
    "ذٰلِكَ بِأَنَّ اللَّهَ هُوَ الحَقُّ وَأَنَّ ما يَدعونَ مِن دونِهِ الباطِلُ وَأَنَّ اللَّهَ هُوَ العَلِيُّ الكَبيرُ",
    "أَلَم تَرَ أَنَّ الفُلكَ تَجري فِي البَحرِ بِنِعمَتِ اللَّهِ لِيُرِيَكُم مِن آياتِهِ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِكُلِّ صَبّارٍ شَكورٍ",
    "وَإِذا غَشِيَهُم مَوجٌ كَالظُّلَلِ دَعَوُا اللَّهَ مُخلِصينَ لَهُ الدّينَ فَلَمّا نَجّاهُم إِلَى البَرِّ فَمِنهُم مُقتَصِدٌ ۚ وَما يَجحَدُ بِآياتِنا إِلّا كُلُّ خَتّارٍ كَفورٍ",
    "يا أَيُّهَا النّاسُ اتَّقوا رَبَّكُم وَاخشَوا يَومًا لا يَجزي والِدٌ عَن وَلَدِهِ وَلا مَولودٌ هُوَ جازٍ عَن والِدِهِ شَيئًا ۚ إِنَّ وَعدَ اللَّهِ حَقٌّ ۖ فَلا تَغُرَّنَّكُمُ الحَياةُ الدُّنيا وَلا يَغُرَّنَّكُم بِاللَّهِ الغَرورُ",
    "إِنَّ اللَّهَ عِندَهُ عِلمُ السّاعَةِ وَيُنَزِّلُ الغَيثَ وَيَعلَمُ ما فِي الأَرحامِ ۖ وَما تَدري نَفسٌ ماذا تَكسِبُ غَدًا ۖ وَما تَدري نَفسٌ بِأَيِّ أَرضٍ تَموتُ ۚ إِنَّ اللَّهَ عَليمٌ خَبيرٌ"
  ]
}