{
  "id": 32,
  "name": "السجدة",
  "transliteration": "As-Sajdah",
  "translation": "The Prostration",
  "verses": [
    "الم",
    "تَنزيلُ الكِتابِ لا رَيبَ فيهِ مِن رَبِّ العالَمينَ",
    "أَم يَقولونَ افتَراهُ ۚ بَل هُوَ الحَقُّ مِن رَبِّكَ لِتُنذِرَ قَومًا ما أَتاهُم مِن نَذيرٍ مِن قَبلِكَ لَعَلَّهُم يَهتَدونَ",
    "اللَّهُ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ وَما بَينَهُما في سِتَّةِ أَيّامٍ ثُمَّ استَوىٰ عَلَى العَرشِ ۖ ما لَكُم مِن دونِهِ مِن وَلِيٍّ وَلا شَفيعٍ ۚ أَفَلا تَتَذَكَّرونَ",
    "يُدَبِّرُ الأَمرَ مِنَ السَّماءِ إِلَى الأَرضِ ثُمَّ يَعرُجُ إِلَيهِ في يَومٍ كانَ مِقدارُهُ أَلفَ سَنَةٍ مِمّا تَعُدّونَ",
    "ذٰلِكَ عالِمُ الغَيبِ وَالشَّهادَةِ العَزيزُ الرَّحيمُ",
    "الَّذي أَحسَنَ كُلَّ شَيءٍ خَلَقَهُ ۖ وَبَدَأَ خَلقَ الإِنسانِ مِن طينٍ",
    "ثُمَّ جَعَلَ نَسلَهُ مِن سُلالَةٍ مِن ماءٍ مَهينٍ",
    "ثُمَّ سَوّاهُ وَنَفَخَ فيهِ مِن روحِهِ ۖ وَجَعَلَ لَكُمُ السَّمعَ وَالأَبصارَ وَالأَفئِدَةَ ۚ قَليلًا ما تَشكُرونَ",
    "وَقالوا أَإِذا ضَلَلنا فِي الأَرضِ أَإِنّا لَفي خَلقٍ جَديدٍ ۚ بَل هُم بِلِقاءِ رَبِّهِم كافِرونَ",
    "۞ قُل يَتَوَفّاكُم مَلَكُ المَوتِ الَّذي وُكِّلَ بِكُم ثُمَّ إِلىٰ رَبِّكُم تُرجَعونَ",
    "وَلَو تَرىٰ إِذِ المُجرِمونَ ناكِسو رُءوسِهِم عِندَ رَبِّهِم رَبَّنا أَبصَرنا وَسَمِعنا فَارجِعنا نَعمَل صالِحًا إِنّا موقِنونَ",
    "وَلَو شِئنا لَآتَينا كُلَّ نَفسٍ هُداها وَلٰكِن حَقَّ القَولُ مِنّي لَأَملَأَنَّ جَهَنَّمَ مِنَ الجِنَّةِ وَالنّاسِ أَجمَعينَ",
    "فَذوقوا بِما نَسيتُم لِقاءَ يَومِكُم هٰذا إِنّا نَسيناكُم ۖ وَذوقوا عَذابَ الخُلدِ بِما كُنتُم تَعمَلونَ",
    "إِنَّما يُؤمِنُ بِآياتِنَا الَّذينَ إِذا ذُكِّروا بِها خَرّوا سُجَّدًا وَسَبَّحوا بِحَمدِ رَبِّهِم وَهُم لا يَستَكبِرونَ ۩",
    "تَتَجافىٰ جُنوبُهُم عَنِ المَضاجِعِ يَدعونَ رَبَّهُم خَوفًا وَطَمَعًا وَمِمّا رَزَقناهُم يُنفِقونَ",
    "فَلا تَعلَمُ نَفسٌ ما أُخفِيَ لَهُم مِن قُرَّةِ أَعيُنٍ جَزاءً بِما كانوا يَعمَلونَ",
    "أَفَمَن كانَ مُؤمِنًا كَمَن كانَ فاسِقًا ۚ لا يَستَوونَ",
    "أَمَّا الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ فَلَهُم جَنّاتُ المَأوىٰ نُزُلًا بِما كانوا يَعمَلونَ",
    "وَأَمَّا الَّذينَ فَسَقوا فَمَأواهُمُ النّارُ ۖ كُلَّما أَرادوا أَن يَخرُجوا مِنها أُعيدوا فيها وَقيلَ لَهُم ذوقوا عَذابَ النّارِ الَّذي كُنتُم بِهِ تُكَذِّبونَ",
    "وَلَنُذيقَنَّهُم مِنَ العَذابِ الأَدنىٰ دونَ العَذابِ الأَكبَرِ لَعَلَّهُم يَرجِعونَ",
    "وَمَن أَظلَمُ مِمَّن ذُكِّرَ بِآياتِ رَبِّهِ ثُمَّ أَعرَضَ عَنها ۚ إِنّا مِنَ المُجرِمينَ مُنتَقِمونَ",
    "وَلَقَد آتَينا موسَى الكِتابَ فَلا تَكُن في مِريَةٍ مِن لِقائِهِ ۖ وَجَعَلناهُ هُدًى لِبَني إِسرائيلَ",
    "وَجَعَلنا مِنهُم أَئِمَّةً يَهدونَ بِأَمرِنا لَمّا صَبَروا ۖ وَكانوا بِآياتِنا يوقِنونَ",
    "إِنَّ رَبَّكَ هُوَ يَفصِلُ بَينَهُم يَومَ القِيامَةِ فيما كانوا فيهِ يَختَلِفونَ",
    "أَوَلَم يَهدِ لَهُم كَم أَهلَكنا مِن قَبلِهِم مِنَ القُرونِ يَمشونَ في مَساكِنِهِم ۚ إِنَّ في ذٰلِكَ لَآياتٍ ۖ أَفَلا يَسمَعونَ",
    "أَوَلَم يَرَوا أَنّا نَسوقُ الماءَ إِلَى الأَرضِ الجُرُزِ فَنُخرِجُ بِهِ زَرعًا تَأكُلُ مِنهُ أَنعامُهُم وَأَنفُسُهُم ۖ أَفَلا يُبصِرونَ",
    "وَيَقولونَ مَتىٰ هٰذَا الفَتحُ إِن كُنتُم صادِقينَ",
    "قُل يَومَ الفَتحِ لا يَنفَعُ الَّذينَ كَفَروا إيمانُهُم وَلا هُم يُنظَرونَ",
    "فَأَعرِض عَنهُم وَانتَظِر إِنَّهُم مُنتَظِرونَ"
  ]
}