{
  "id": 35,
  "name": "فاطر",
  "transliteration": "Fatir",
  "translation": "Originator",
  "verses": [
    "الحَمدُ لِلَّهِ فاطِرِ السَّماواتِ وَالأَرضِ جاعِلِ المَلائِكَةِ رُسُلًا أُولي أَجنِحَةٍ مَثنىٰ وَثُلاثَ وَرُباعَ ۚ يَزيدُ فِي الخَلقِ ما يَشاءُ ۚ إِنَّ اللَّهَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "ما يَفتَحِ اللَّهُ لِلنّاسِ مِن رَحمَةٍ فَلا مُمسِكَ لَها ۖ وَما يُمسِك فَلا مُرسِلَ لَهُ مِن بَعدِهِ ۚ وَهُوَ العَزيزُ الحَكيمُ",
    "يا أَيُّهَا النّاسُ اذكُروا نِعمَتَ اللَّهِ عَلَيكُم ۚ هَل مِن خالِقٍ غَيرُ اللَّهِ يَرزُقُكُم مِنَ السَّماءِ وَالأَرضِ ۚ لا إِلٰهَ إِلّا هُوَ ۖ فَأَنّىٰ تُؤفَكونَ",
    "وَإِن يُكَذِّبوكَ فَقَد كُذِّبَت رُسُلٌ مِن قَبلِكَ ۚ وَإِلَى اللَّهِ تُرجَعُ الأُمورُ",
    "يا أَيُّهَا النّاسُ إِنَّ وَعدَ اللَّهِ حَقٌّ ۖ فَلا تَغُرَّنَّكُمُ الحَياةُ الدُّنيا ۖ وَلا يَغُرَّنَّكُم بِاللَّهِ الغَرورُ",
    "إِنَّ الشَّيطانَ لَكُم عَدُوٌّ فَاتَّخِذوهُ عَدُوًّا ۚ إِنَّما يَدعو حِزبَهُ لِيَكونوا مِن أَصحابِ السَّعيرِ",
    "الَّذينَ كَفَروا لَهُم عَذابٌ شَديدٌ ۖ وَالَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ لَهُم مَغفِرَةٌ وَأَجرٌ كَبيرٌ",
    "أَفَمَن زُيِّنَ لَهُ سوءُ عَمَلِهِ فَرَآهُ حَسَنًا ۖ فَإِنَّ اللَّهَ يُضِلُّ مَن يَشاءُ وَيَهدي مَن يَشاءُ ۖ فَلا تَذهَب نَفسُكَ عَلَيهِم حَسَراتٍ ۚ إِنَّ اللَّهَ عَليمٌ بِما يَصنَعونَ",
    "وَاللَّهُ الَّذي أَرسَلَ الرِّياحَ فَتُثيرُ سَحابًا فَسُقناهُ إِلىٰ بَلَدٍ مَيِّتٍ فَأَحيَينا بِهِ الأَرضَ بَعدَ مَوتِها ۚ كَذٰلِكَ النُّشورُ",
    "مَن كانَ يُريدُ العِزَّةَ فَلِلَّهِ العِزَّةُ جَميعًا ۚ إِلَيهِ يَصعَدُ الكَلِمُ الطَّيِّبُ وَالعَمَلُ الصّالِحُ يَرفَعُهُ ۚ وَالَّذينَ يَمكُرونَ السَّيِّئَاتِ لَهُم عَذابٌ شَديدٌ ۖ وَمَكرُ أُولٰئِكَ هُوَ يَبورُ",
    "وَاللَّهُ خَلَقَكُم مِن تُرابٍ ثُمَّ مِن نُطفَةٍ ثُمَّ جَعَلَكُم أَزواجًا ۚ وَما تَحمِلُ مِن أُنثىٰ وَلا تَضَعُ إِلّا بِعِلمِهِ ۚ وَما يُعَمَّرُ مِن مُعَمَّرٍ وَلا يُنقَصُ مِن عُمُرِهِ إِلّا في كِتابٍ ۚ إِنَّ ذٰلِكَ عَلَى اللَّهِ يَسيرٌ",
    "وَما يَستَوِي البَحرانِ هٰذا عَذبٌ فُراتٌ سائِغٌ شَرابُهُ وَهٰذا مِلحٌ أُجاجٌ ۖ وَمِن كُلٍّ تَأكُلونَ لَحمًا طَرِيًّا وَتَستَخرِجونَ حِليَةً تَلبَسونَها ۖ وَتَرَى الفُلكَ فيهِ مَواخِرَ لِتَبتَغوا مِن فَضلِهِ وَلَعَلَّكُم تَشكُرونَ",
    "يولِجُ اللَّيلَ فِي النَّهارِ وَيولِجُ النَّهارَ فِي اللَّيلِ وَسَخَّرَ الشَّمسَ وَالقَمَرَ كُلٌّ يَجري لِأَجَلٍ مُسَمًّى ۚ ذٰلِكُمُ اللَّهُ رَبُّكُم لَهُ المُلكُ ۚ وَالَّذينَ تَدعونَ مِن دونِهِ ما يَملِكونَ مِن قِطميرٍ",
    "إِن تَدعوهُم لا يَسمَعوا دُعاءَكُم وَلَو سَمِعوا مَا استَجابوا لَكُم ۖ وَيَومَ القِيامَةِ يَكفُرونَ بِشِركِكُم ۚ وَلا يُنَبِّئُكَ مِثلُ خَبيرٍ",
    "۞ يا أَيُّهَا النّاسُ أَنتُمُ الفُقَراءُ إِلَى اللَّهِ ۖ وَاللَّهُ هُوَ الغَنِيُّ الحَميدُ",
    "إِن يَشَأ يُذهِبكُم وَيَأتِ بِخَلقٍ جَديدٍ",
    "وَما ذٰلِكَ عَلَى اللَّهِ بِعَزيزٍ",
    "وَلا تَزِرُ وازِرَةٌ وِزرَ أُخرىٰ ۚ وَإِن تَدعُ مُثقَلَةٌ إِلىٰ حِملِها لا يُحمَل مِنهُ شَيءٌ وَلَو كانَ ذا قُربىٰ ۗ إِنَّما تُنذِرُ الَّذينَ يَخشَونَ رَبَّهُم بِالغَيبِ وَأَقامُوا الصَّلاةَ ۚ وَمَن تَزَكّىٰ فَإِنَّما يَتَزَكّىٰ لِنَفسِهِ ۚ وَإِلَى اللَّهِ المَصيرُ",
    "وَما يَستَوِي الأَعمىٰ وَالبَصيرُ",
    "وَلَا الظُّلُماتُ وَلَا النّورُ",
    "وَلَا الظِّلُّ وَلَا الحَرورُ",
    "وَما يَستَوِي الأَحياءُ وَلَا الأَمواتُ ۚ إِنَّ اللَّهَ يُسمِعُ مَن يَشاءُ ۖ وَما أَنتَ بِمُسمِعٍ مَن فِي القُبورِ",
    "إِن أَنتَ إِلّا نَذيرٌ",
    "إِنّا أَرسَلناكَ بِالحَقِّ بَشيرًا وَنَذيرًا ۚ وَإِن مِن أُمَّةٍ إِلّا خَلا فيها نَذيرٌ",
    "وَإِن يُكَذِّبوكَ فَقَد كَذَّبَ الَّذينَ مِن قَبلِهِم جاءَتهُم رُسُلُهُم بِالبَيِّناتِ وَبِالزُّبُرِ وَبِالكِتابِ المُنيرِ",
    "ثُمَّ أَخَذتُ الَّذينَ كَفَروا ۖ فَكَيفَ كانَ نَكيرِ",
    "أَلَم تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّماءِ ماءً فَأَخرَجنا بِهِ ثَمَراتٍ مُختَلِفًا أَلوانُها ۚ وَمِنَ الجِبالِ جُدَدٌ بيضٌ وَحُمرٌ مُختَلِفٌ أَلوانُها وَغَرابيبُ سودٌ",
    "وَمِنَ النّاسِ وَالدَّوابِّ وَالأَنعامِ مُختَلِفٌ أَلوانُهُ كَذٰلِكَ ۗ إِنَّما يَخشَى اللَّهَ مِن عِبادِهِ العُلَماءُ ۗ إِنَّ اللَّهَ عَزيزٌ غَفورٌ",
    "إِنَّ الَّذينَ يَتلونَ كِتابَ اللَّهِ وَأَقامُوا الصَّلاةَ وَأَنفَقوا مِمّا رَزَقناهُم سِرًّا وَعَلانِيَةً يَرجونَ تِجارَةً لَن تَبورَ",
    "لِيُوَفِّيَهُم أُجورَهُم وَيَزيدَهُم مِن فَضلِهِ ۚ إِنَّهُ غَفورٌ شَكورٌ",
    "وَالَّذي أَوحَينا إِلَيكَ مِنَ الكِتابِ هُوَ الحَقُّ مُصَدِّقًا لِما بَينَ يَدَيهِ ۗ إِنَّ اللَّهَ بِعِبادِهِ لَخَبيرٌ بَصيرٌ",
    "ثُمَّ أَورَثنَا الكِتابَ الَّذينَ اصطَفَينا مِن عِبادِنا ۖ فَمِنهُم ظالِمٌ لِنَفسِهِ وَمِنهُم مُقتَصِدٌ وَمِنهُم سابِقٌ بِالخَيراتِ بِإِذنِ اللَّهِ ۚ ذٰلِكَ هُوَ الفَضلُ الكَبيرُ",
    "جَنّاتُ عَدنٍ يَدخُلونَها يُحَلَّونَ فيها مِن أَساوِرَ مِن ذَهَبٍ وَلُؤلُؤًا ۖ وَلِباسُهُم فيها حَريرٌ",
    "وَقالُوا الحَمدُ لِلَّهِ الَّذي أَذهَبَ عَنَّا الحَزَنَ ۖ إِنَّ رَبَّنا لَغَفورٌ شَكورٌ",
    "الَّذي أَحَلَّنا دارَ المُقامَةِ مِن فَضلِهِ لا يَمَسُّنا فيها نَصَبٌ وَلا يَمَسُّنا فيها لُغوبٌ",
    "وَالَّذينَ كَفَروا لَهُم نارُ جَهَنَّمَ لا يُقضىٰ عَلَيهِم فَيَموتوا وَلا يُخَفَّفُ عَنهُم مِن عَذابِها ۚ كَذٰلِكَ نَجزي كُلَّ كَفورٍ",
    "وَهُم يَصطَرِخونَ فيها رَبَّنا أَخرِجنا نَعمَل صالِحًا غَيرَ الَّذي كُنّا نَعمَلُ ۚ أَوَلَم نُعَمِّركُم ما يَتَذَكَّرُ فيهِ مَن تَذَكَّرَ وَجاءَكُمُ النَّذيرُ ۖ فَذوقوا فَما لِلظّالِمينَ مِن نَصيرٍ",
    "إِنَّ اللَّهَ عالِمُ غَيبِ السَّماواتِ وَالأَرضِ ۚ إِنَّهُ عَليمٌ بِذاتِ الصُّدورِ",
    "هُوَ الَّذي جَعَلَكُم خَلائِفَ فِي الأَرضِ ۚ فَمَن كَفَرَ فَعَلَيهِ كُفرُهُ ۖ وَلا يَزيدُ الكافِرينَ كُفرُهُم عِندَ رَبِّهِم إِلّا مَقتًا ۖ وَلا يَزيدُ الكافِرينَ كُفرُهُم إِلّا خَسارًا",
    "قُل أَرَأَيتُم شُرَكاءَكُمُ الَّذينَ تَدعونَ مِن دونِ اللَّهِ أَروني ماذا خَلَقوا مِنَ الأَرضِ أَم لَهُم شِركٌ فِي السَّماواتِ أَم آتَيناهُم كِتابًا فَهُم عَلىٰ بَيِّنَتٍ مِنهُ ۚ بَل إِن يَعِدُ الظّالِمونَ بَعضُهُم بَعضًا إِلّا غُرورًا",
    "۞ إِنَّ اللَّهَ يُمسِكُ السَّماواتِ وَالأَرضَ أَن تَزولا ۚ وَلَئِن زالَتا إِن أَمسَكَهُما مِن أَحَدٍ مِن بَعدِهِ ۚ إِنَّهُ كانَ حَليمًا غَفورًا",
    "وَأَقسَموا بِاللَّهِ جَهدَ أَيمانِهِم لَئِن جاءَهُم نَذيرٌ لَيَكونُنَّ أَهدىٰ مِن إِحدَى الأُمَمِ ۖ فَلَمّا جاءَهُم نَذيرٌ ما زادَهُم إِلّا نُفورًا",
    "استِكبارًا فِي الأَرضِ وَمَكرَ السَّيِّئِ ۚ وَلا يَحيقُ المَكرُ السَّيِّئُ إِلّا بِأَهلِهِ ۚ فَهَل يَنظُرونَ إِلّا سُنَّتَ الأَوَّلينَ ۚ فَلَن تَجِدَ لِسُنَّتِ اللَّهِ تَبديلًا ۖ وَلَن تَجِدَ لِسُنَّتِ اللَّهِ تَحويلًا",
    "أَوَلَم يَسيروا فِي الأَرضِ فَيَنظُروا كَيفَ كانَ عاقِبَةُ الَّذينَ مِن قَبلِهِم وَكانوا أَشَدَّ مِنهُم قُوَّةً ۚ وَما كانَ اللَّهُ لِيُعجِزَهُ مِن شَيءٍ فِي السَّماواتِ وَلا فِي الأَرضِ ۚ إِنَّهُ كانَ عَليمًا قَديرًا",
    "وَلَو يُؤاخِذُ اللَّهُ النّاسَ بِما كَسَبوا ما تَرَكَ عَلىٰ ظَهرِها مِن دابَّةٍ وَلٰكِن يُؤَخِّرُهُم إِلىٰ أَجَلٍ مُسَمًّى ۖ فَإِذا جاءَ أَجَلُهُم فَإِنَّ اللَّهَ كانَ بِعِبادِهِ بَصيرًا"
  ]
}