{
  "id": 36,
  "name": "يس",
  "transliteration": "Ya-Sin",
  "translation": "Ya Sin",
  "verses": [
    "يس",
    "وَالقُرآنِ الحَكيمِ",
    "إِنَّكَ لَمِنَ المُرسَلينَ",
    "عَلىٰ صِراطٍ مُستَقيمٍ",
    "تَنزيلَ العَزيزِ الرَّحيمِ",
    "لِتُنذِرَ قَومًا ما أُنذِرَ آباؤُهُم فَهُم غافِلونَ",
    "لَقَد حَقَّ القَولُ عَلىٰ أَكثَرِهِم فَهُم لا يُؤمِنونَ",
    "إِنّا جَعَلنا في أَعناقِهِم أَغلالًا فَهِيَ إِلَى الأَذقانِ فَهُم مُقمَحونَ",
    "وَجَعَلنا مِن بَينِ أَيديهِم سَدًّا وَمِن خَلفِهِم سَدًّا فَأَغشَيناهُم فَهُم لا يُبصِرونَ",
    "وَسَواءٌ عَلَيهِم أَأَنذَرتَهُم أَم لَم تُنذِرهُم لا يُؤمِنونَ",
    "إِنَّما تُنذِرُ مَنِ اتَّبَعَ الذِّكرَ وَخَشِيَ الرَّحمٰنَ بِالغَيبِ ۖ فَبَشِّرهُ بِمَغفِرَةٍ وَأَجرٍ كَريمٍ",
    "إِنّا نَحنُ نُحيِي المَوتىٰ وَنَكتُبُ ما قَدَّموا وَآثارَهُم ۚ وَكُلَّ شَيءٍ أَحصَيناهُ في إِمامٍ مُبينٍ",
    "وَاضرِب لَهُم مَثَلًا أَصحابَ القَريَةِ إِذ جاءَهَا المُرسَلونَ",
    "إِذ أَرسَلنا إِلَيهِمُ اثنَينِ فَكَذَّبوهُما فَعَزَّزنا بِثالِثٍ فَقالوا إِنّا إِلَيكُم مُرسَلونَ",
    "قالوا ما أَنتُم إِلّا بَشَرٌ مِثلُنا وَما أَنزَلَ الرَّحمٰنُ مِن شَيءٍ إِن أَنتُم إِلّا تَكذِبونَ",
    "قالوا رَبُّنا يَعلَمُ إِنّا إِلَيكُم لَمُرسَلونَ",
    "وَما عَلَينا إِلَّا البَلاغُ المُبينُ",
    "قالوا إِنّا تَطَيَّرنا بِكُم ۖ لَئِن لَم تَنتَهوا لَنَرجُمَنَّكُم وَلَيَمَسَّنَّكُم مِنّا عَذابٌ أَليمٌ",
    "قالوا طائِرُكُم مَعَكُم ۚ أَئِن ذُكِّرتُم ۚ بَل أَنتُم قَومٌ مُسرِفونَ",
    "وَجاءَ مِن أَقصَى المَدينَةِ رَجُلٌ يَسعىٰ قالَ يا قَومِ اتَّبِعُوا المُرسَلينَ",
    "اتَّبِعوا مَن لا يَسأَلُكُم أَجرًا وَهُم مُهتَدونَ",
    "وَما لِيَ لا أَعبُدُ الَّذي فَطَرَني وَإِلَيهِ تُرجَعونَ",
    "أَأَتَّخِذُ مِن دونِهِ آلِهَةً إِن يُرِدنِ الرَّحمٰنُ بِضُرٍّ لا تُغنِ عَنّي شَفاعَتُهُم شَيئًا وَلا يُنقِذونِ",
    "إِنّي إِذًا لَفي ضَلالٍ مُبينٍ",
    "إِنّي آمَنتُ بِرَبِّكُم فَاسمَعونِ",
    "قيلَ ادخُلِ الجَنَّةَ ۖ قالَ يا لَيتَ قَومي يَعلَمونَ",
    "بِما غَفَرَ لي رَبّي وَجَعَلَني مِنَ المُكرَمينَ",
    "۞ وَما أَنزَلنا عَلىٰ قَومِهِ مِن بَعدِهِ مِن جُندٍ مِنَ السَّماءِ وَما كُنّا مُنزِلينَ",
    "إِن كانَت إِلّا صَيحَةً واحِدَةً فَإِذا هُم خامِدونَ",
    "يا حَسرَةً عَلَى العِبادِ ۚ ما يَأتيهِم مِن رَسولٍ إِلّا كانوا بِهِ يَستَهزِئونَ",
    "أَلَم يَرَوا كَم أَهلَكنا قَبلَهُم مِنَ القُرونِ أَنَّهُم إِلَيهِم لا يَرجِعونَ",
    "وَإِن كُلٌّ لَمّا جَميعٌ لَدَينا مُحضَرونَ",
    "وَآيَةٌ لَهُمُ الأَرضُ المَيتَةُ أَحيَيناها وَأَخرَجنا مِنها حَبًّا فَمِنهُ يَأكُلونَ",
    "وَجَعَلنا فيها جَنّاتٍ مِن نَخيلٍ وَأَعنابٍ وَفَجَّرنا فيها مِنَ العُيونِ",
    "لِيَأكُلوا مِن ثَمَرِهِ وَما عَمِلَتهُ أَيديهِم ۖ أَفَلا يَشكُرونَ",
    "سُبحانَ الَّذي خَلَقَ الأَزواجَ كُلَّها مِمّا تُنبِتُ الأَرضُ وَمِن أَنفُسِهِم وَمِمّا لا يَعلَمونَ",
    "وَآيَةٌ لَهُمُ اللَّيلُ نَسلَخُ مِنهُ النَّهارَ فَإِذا هُم مُظلِمونَ",
    "وَالشَّمسُ تَجري لِمُستَقَرٍّ لَها ۚ ذٰلِكَ تَقديرُ العَزيزِ العَليمِ",
    "وَالقَمَرَ قَدَّرناهُ مَنازِلَ حَتّىٰ عادَ كَالعُرجونِ القَديمِ",
    "لَا الشَّمسُ يَنبَغي لَها أَن تُدرِكَ القَمَرَ وَلَا اللَّيلُ سابِقُ النَّهارِ ۚ وَكُلٌّ في فَلَكٍ يَسبَحونَ",
    "وَآيَةٌ لَهُم أَنّا حَمَلنا ذُرِّيَّتَهُم فِي الفُلكِ المَشحونِ",
    "وَخَلَقنا لَهُم مِن مِثلِهِ ما يَركَبونَ",
    "وَإِن نَشَأ نُغرِقهُم فَلا صَريخَ لَهُم وَلا هُم يُنقَذونَ",
    "إِلّا رَحمَةً مِنّا وَمَتاعًا إِلىٰ حينٍ",
    "وَإِذا قيلَ لَهُمُ اتَّقوا ما بَينَ أَيديكُم وَما خَلفَكُم لَعَلَّكُم تُرحَمونَ",
    "وَما تَأتيهِم مِن آيَةٍ مِن آياتِ رَبِّهِم إِلّا كانوا عَنها مُعرِضينَ",
    "وَإِذا قيلَ لَهُم أَنفِقوا مِمّا رَزَقَكُمُ اللَّهُ قالَ الَّذينَ كَفَروا لِلَّذينَ آمَنوا أَنُطعِمُ مَن لَو يَشاءُ اللَّهُ أَطعَمَهُ إِن أَنتُم إِلّا في ضَلالٍ مُبينٍ",
    "وَيَقولونَ مَتىٰ هٰذَا الوَعدُ إِن كُنتُم صادِقينَ",
    "ما يَنظُرونَ إِلّا صَيحَةً واحِدَةً تَأخُذُهُم وَهُم يَخِصِّمونَ",
    "فَلا يَستَطيعونَ تَوصِيَةً وَلا إِلىٰ أَهلِهِم يَرجِعونَ",
    "وَنُفِخَ فِي الصّورِ فَإِذا هُم مِنَ الأَجداثِ إِلىٰ رَبِّهِم يَنسِلونَ",
    "قالوا يا وَيلَنا مَن بَعَثَنا مِن مَرقَدِنا ۜ ۗ هٰذا ما وَعَدَ الرَّحمٰنُ وَصَدَقَ المُرسَلونَ",
    "إِن كانَت إِلّا صَيحَةً واحِدَةً فَإِذا هُم جَميعٌ لَدَينا مُحضَرونَ",
    "فَاليَومَ لا تُظلَمُ نَفسٌ شَيئًا وَلا تُجزَونَ إِلّا ما كُنتُم تَعمَلونَ",
    "إِنَّ أَصحابَ الجَنَّةِ اليَومَ في شُغُلٍ فاكِهونَ",
    "هُم وَأَزواجُهُم في ظِلالٍ عَلَى الأَرائِكِ مُتَّكِئونَ",
    "لَهُم فيها فاكِهَةٌ وَلَهُم ما يَدَّعونَ",
    "سَلامٌ قَولًا مِن رَبٍّ رَحيمٍ",
    "وَامتازُوا اليَومَ أَيُّهَا المُجرِمونَ",
    "۞ أَلَم أَعهَد إِلَيكُم يا بَني آدَمَ أَن لا تَعبُدُوا الشَّيطانَ ۖ إِنَّهُ لَكُم عَدُوٌّ مُبينٌ",
    "وَأَنِ اعبُدوني ۚ هٰذا صِراطٌ مُستَقيمٌ",
    "وَلَقَد أَضَلَّ مِنكُم جِبِلًّا كَثيرًا ۖ أَفَلَم تَكونوا تَعقِلونَ",
    "هٰذِهِ جَهَنَّمُ الَّتي كُنتُم توعَدونَ",
    "اصلَوهَا اليَومَ بِما كُنتُم تَكفُرونَ",
    "اليَومَ نَختِمُ عَلىٰ أَفواهِهِم وَتُكَلِّمُنا أَيديهِم وَتَشهَدُ أَرجُلُهُم بِما كانوا يَكسِبونَ",
    "وَلَو نَشاءُ لَطَمَسنا عَلىٰ أَعيُنِهِم فَاستَبَقُوا الصِّراطَ فَأَنّىٰ يُبصِرونَ",
    "وَلَو نَشاءُ لَمَسَخناهُم عَلىٰ مَكانَتِهِم فَمَا استَطاعوا مُضِيًّا وَلا يَرجِعونَ",
    "وَمَن نُعَمِّرهُ نُنَكِّسهُ فِي الخَلقِ ۖ أَفَلا يَعقِلونَ",
    "وَما عَلَّمناهُ الشِّعرَ وَما يَنبَغي لَهُ ۚ إِن هُوَ إِلّا ذِكرٌ وَقُرآنٌ مُبينٌ",
    "لِيُنذِرَ مَن كانَ حَيًّا وَيَحِقَّ القَولُ عَلَى الكافِرينَ",
    "أَوَلَم يَرَوا أَنّا خَلَقنا لَهُم مِمّا عَمِلَت أَيدينا أَنعامًا فَهُم لَها مالِكونَ",
    "وَذَلَّلناها لَهُم فَمِنها رَكوبُهُم وَمِنها يَأكُلونَ",
    "وَلَهُم فيها مَنافِعُ وَمَشارِبُ ۖ أَفَلا يَشكُرونَ",
    "وَاتَّخَذوا مِن دونِ اللَّهِ آلِهَةً لَعَلَّهُم يُنصَرونَ",
    "لا يَستَطيعونَ نَصرَهُم وَهُم لَهُم جُندٌ مُحضَرونَ",
    "فَلا يَحزُنكَ قَولُهُم ۘ إِنّا نَعلَمُ ما يُسِرّونَ وَما يُعلِنونَ",
    "أَوَلَم يَرَ الإِنسانُ أَنّا خَلَقناهُ مِن نُطفَةٍ فَإِذا هُوَ خَصيمٌ مُبينٌ",
    "وَضَرَبَ لَنا مَثَلًا وَنَسِيَ خَلقَهُ ۖ قالَ مَن يُحيِي العِظامَ وَهِيَ رَميمٌ",
    "قُل يُحييهَا الَّذي أَنشَأَها أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلقٍ عَليمٌ",
    "الَّذي جَعَلَ لَكُم مِنَ الشَّجَرِ الأَخضَرِ نارًا فَإِذا أَنتُم مِنهُ توقِدونَ",
    "أَوَلَيسَ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ بِقادِرٍ عَلىٰ أَن يَخلُقَ مِثلَهُم ۚ بَلىٰ وَهُوَ الخَلّاقُ العَليمُ",
    "إِنَّما أَمرُهُ إِذا أَرادَ شَيئًا أَن يَقولَ لَهُ كُن فَيَكونُ",
    "فَسُبحانَ الَّذي بِيَدِهِ مَلَكوتُ كُلِّ شَيءٍ وَإِلَيهِ تُرجَعونَ"
  ]
}