{
  "id": 38,
  "name": "ص",
  "transliteration": "Sad",
  "translation": "The Letter \"Saad\"",
  "verses": [
    "ص ۚ وَالقُرآنِ ذِي الذِّكرِ",
    "بَلِ الَّذينَ كَفَروا في عِزَّةٍ وَشِقاقٍ",
    "كَم أَهلَكنا مِن قَبلِهِم مِن قَرنٍ فَنادَوا وَلاتَ حينَ مَناصٍ",
    "وَعَجِبوا أَن جاءَهُم مُنذِرٌ مِنهُم ۖ وَقالَ الكافِرونَ هٰذا ساحِرٌ كَذّابٌ",
    "أَجَعَلَ الآلِهَةَ إِلٰهًا واحِدًا ۖ إِنَّ هٰذا لَشَيءٌ عُجابٌ",
    "وَانطَلَقَ المَلَأُ مِنهُم أَنِ امشوا وَاصبِروا عَلىٰ آلِهَتِكُم ۖ إِنَّ هٰذا لَشَيءٌ يُرادُ",
    "ما سَمِعنا بِهٰذا فِي المِلَّةِ الآخِرَةِ إِن هٰذا إِلَّا اختِلاقٌ",
    "أَأُنزِلَ عَلَيهِ الذِّكرُ مِن بَينِنا ۚ بَل هُم في شَكٍّ مِن ذِكري ۖ بَل لَمّا يَذوقوا عَذابِ",
    "أَم عِندَهُم خَزائِنُ رَحمَةِ رَبِّكَ العَزيزِ الوَهّابِ",
    "أَم لَهُم مُلكُ السَّماواتِ وَالأَرضِ وَما بَينَهُما ۖ فَليَرتَقوا فِي الأَسبابِ",
    "جُندٌ ما هُنالِكَ مَهزومٌ مِنَ الأَحزابِ",
    "كَذَّبَت قَبلَهُم قَومُ نوحٍ وَعادٌ وَفِرعَونُ ذُو الأَوتادِ",
    "وَثَمودُ وَقَومُ لوطٍ وَأَصحابُ الأَيكَةِ ۚ أُولٰئِكَ الأَحزابُ",
    "إِن كُلٌّ إِلّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقابِ",
    "وَما يَنظُرُ هٰؤُلاءِ إِلّا صَيحَةً واحِدَةً ما لَها مِن فَواقٍ",
    "وَقالوا رَبَّنا عَجِّل لَنا قِطَّنا قَبلَ يَومِ الحِسابِ",
    "اصبِر عَلىٰ ما يَقولونَ وَاذكُر عَبدَنا داوودَ ذَا الأَيدِ ۖ إِنَّهُ أَوّابٌ",
    "إِنّا سَخَّرنَا الجِبالَ مَعَهُ يُسَبِّحنَ بِالعَشِيِّ وَالإِشراقِ",
    "وَالطَّيرَ مَحشورَةً ۖ كُلٌّ لَهُ أَوّابٌ",
    "وَشَدَدنا مُلكَهُ وَآتَيناهُ الحِكمَةَ وَفَصلَ الخِطابِ",
    "۞ وَهَل أَتاكَ نَبَأُ الخَصمِ إِذ تَسَوَّرُوا المِحرابَ",
    "إِذ دَخَلوا عَلىٰ داوودَ فَفَزِعَ مِنهُم ۖ قالوا لا تَخَف ۖ خَصمانِ بَغىٰ بَعضُنا عَلىٰ بَعضٍ فَاحكُم بَينَنا بِالحَقِّ وَلا تُشطِط وَاهدِنا إِلىٰ سَواءِ الصِّراطِ",
    "إِنَّ هٰذا أَخي لَهُ تِسعٌ وَتِسعونَ نَعجَةً وَلِيَ نَعجَةٌ واحِدَةٌ فَقالَ أَكفِلنيها وَعَزَّني فِي الخِطابِ",
    "قالَ لَقَد ظَلَمَكَ بِسُؤالِ نَعجَتِكَ إِلىٰ نِعاجِهِ ۖ وَإِنَّ كَثيرًا مِنَ الخُلَطاءِ لَيَبغي بَعضُهُم عَلىٰ بَعضٍ إِلَّا الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ وَقَليلٌ ما هُم ۗ وَظَنَّ داوودُ أَنَّما فَتَنّاهُ فَاستَغفَرَ رَبَّهُ وَخَرَّ راكِعًا وَأَنابَ ۩",
    "فَغَفَرنا لَهُ ذٰلِكَ ۖ وَإِنَّ لَهُ عِندَنا لَزُلفىٰ وَحُسنَ مَآبٍ",
    "يا داوودُ إِنّا جَعَلناكَ خَليفَةً فِي الأَرضِ فَاحكُم بَينَ النّاسِ بِالحَقِّ وَلا تَتَّبِعِ الهَوىٰ فَيُضِلَّكَ عَن سَبيلِ اللَّهِ ۚ إِنَّ الَّذينَ يَضِلّونَ عَن سَبيلِ اللَّهِ لَهُم عَذابٌ شَديدٌ بِما نَسوا يَومَ الحِسابِ",
    "وَما خَلَقنَا السَّماءَ وَالأَرضَ وَما بَينَهُما باطِلًا ۚ ذٰلِكَ ظَنُّ الَّذينَ كَفَروا ۚ فَوَيلٌ لِلَّذينَ كَفَروا مِنَ النّارِ",
    "أَم نَجعَلُ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ كَالمُفسِدينَ فِي الأَرضِ أَم نَجعَلُ المُتَّقينَ كَالفُجّارِ",
    "كِتابٌ أَنزَلناهُ إِلَيكَ مُبارَكٌ لِيَدَّبَّروا آياتِهِ وَلِيَتَذَكَّرَ أُولُو الأَلبابِ",
    "وَوَهَبنا لِداوودَ سُلَيمانَ ۚ نِعمَ العَبدُ ۖ إِنَّهُ أَوّابٌ",
    "إِذ عُرِضَ عَلَيهِ بِالعَشِيِّ الصّافِناتُ الجِيادُ",
    "فَقالَ إِنّي أَحبَبتُ حُبَّ الخَيرِ عَن ذِكرِ رَبّي حَتّىٰ تَوارَت بِالحِجابِ",
    "رُدّوها عَلَيَّ ۖ فَطَفِقَ مَسحًا بِالسّوقِ وَالأَعناقِ",
    "وَلَقَد فَتَنّا سُلَيمانَ وَأَلقَينا عَلىٰ كُرسِيِّهِ جَسَدًا ثُمَّ أَنابَ",
    "قالَ رَبِّ اغفِر لي وَهَب لي مُلكًا لا يَنبَغي لِأَحَدٍ مِن بَعدي ۖ إِنَّكَ أَنتَ الوَهّابُ",
    "فَسَخَّرنا لَهُ الرّيحَ تَجري بِأَمرِهِ رُخاءً حَيثُ أَصابَ",
    "وَالشَّياطينَ كُلَّ بَنّاءٍ وَغَوّاصٍ",
    "وَآخَرينَ مُقَرَّنينَ فِي الأَصفادِ",
    "هٰذا عَطاؤُنا فَامنُن أَو أَمسِك بِغَيرِ حِسابٍ",
    "وَإِنَّ لَهُ عِندَنا لَزُلفىٰ وَحُسنَ مَآبٍ",
    "وَاذكُر عَبدَنا أَيّوبَ إِذ نادىٰ رَبَّهُ أَنّي مَسَّنِيَ الشَّيطانُ بِنُصبٍ وَعَذابٍ",
    "اركُض بِرِجلِكَ ۖ هٰذا مُغتَسَلٌ بارِدٌ وَشَرابٌ",
    "وَوَهَبنا لَهُ أَهلَهُ وَمِثلَهُم مَعَهُم رَحمَةً مِنّا وَذِكرىٰ لِأُولِي الأَلبابِ",
    "وَخُذ بِيَدِكَ ضِغثًا فَاضرِب بِهِ وَلا تَحنَث ۗ إِنّا وَجَدناهُ صابِرًا ۚ نِعمَ العَبدُ ۖ إِنَّهُ أَوّابٌ",
    "وَاذكُر عِبادَنا إِبراهيمَ وَإِسحاقَ وَيَعقوبَ أُولِي الأَيدي وَالأَبصارِ",
    "إِنّا أَخلَصناهُم بِخالِصَةٍ ذِكرَى الدّارِ",
    "وَإِنَّهُم عِندَنا لَمِنَ المُصطَفَينَ الأَخيارِ",
    "وَاذكُر إِسماعيلَ وَاليَسَعَ وَذَا الكِفلِ ۖ وَكُلٌّ مِنَ الأَخيارِ",
    "هٰذا ذِكرٌ ۚ وَإِنَّ لِلمُتَّقينَ لَحُسنَ مَآبٍ",
    "جَنّاتِ عَدنٍ مُفَتَّحَةً لَهُمُ الأَبوابُ",
    "مُتَّكِئينَ فيها يَدعونَ فيها بِفاكِهَةٍ كَثيرَةٍ وَشَرابٍ",
    "۞ وَعِندَهُم قاصِراتُ الطَّرفِ أَترابٌ",
    "هٰذا ما توعَدونَ لِيَومِ الحِسابِ",
    "إِنَّ هٰذا لَرِزقُنا ما لَهُ مِن نَفادٍ",
    "هٰذا ۚ وَإِنَّ لِلطّاغينَ لَشَرَّ مَآبٍ",
    "جَهَنَّمَ يَصلَونَها فَبِئسَ المِهادُ",
    "هٰذا فَليَذوقوهُ حَميمٌ وَغَسّاقٌ",
    "وَآخَرُ مِن شَكلِهِ أَزواجٌ",
    "هٰذا فَوجٌ مُقتَحِمٌ مَعَكُم ۖ لا مَرحَبًا بِهِم ۚ إِنَّهُم صالُو النّارِ",
    "قالوا بَل أَنتُم لا مَرحَبًا بِكُم ۖ أَنتُم قَدَّمتُموهُ لَنا ۖ فَبِئسَ القَرارُ",
    "قالوا رَبَّنا مَن قَدَّمَ لَنا هٰذا فَزِدهُ عَذابًا ضِعفًا فِي النّارِ",
    "وَقالوا ما لَنا لا نَرىٰ رِجالًا كُنّا نَعُدُّهُم مِنَ الأَشرارِ",
    "أَتَّخَذناهُم سِخرِيًّا أَم زاغَت عَنهُمُ الأَبصارُ",
    "إِنَّ ذٰلِكَ لَحَقٌّ تَخاصُمُ أَهلِ النّارِ",
    "قُل إِنَّما أَنا مُنذِرٌ ۖ وَما مِن إِلٰهٍ إِلَّا اللَّهُ الواحِدُ القَهّارُ",
    "رَبُّ السَّماواتِ وَالأَرضِ وَما بَينَهُمَا العَزيزُ الغَفّارُ",
    "قُل هُوَ نَبَأٌ عَظيمٌ",
    "أَنتُم عَنهُ مُعرِضونَ",
    "ما كانَ لِيَ مِن عِلمٍ بِالمَلَإِ الأَعلىٰ إِذ يَختَصِمونَ",
    "إِن يوحىٰ إِلَيَّ إِلّا أَنَّما أَنا نَذيرٌ مُبينٌ",
    "إِذ قالَ رَبُّكَ لِلمَلائِكَةِ إِنّي خالِقٌ بَشَرًا مِن طينٍ",
    "فَإِذا سَوَّيتُهُ وَنَفَختُ فيهِ مِن روحي فَقَعوا لَهُ ساجِدينَ",
    "فَسَجَدَ المَلائِكَةُ كُلُّهُم أَجمَعونَ",
    "إِلّا إِبليسَ استَكبَرَ وَكانَ مِنَ الكافِرينَ",
    "قالَ يا إِبليسُ ما مَنَعَكَ أَن تَسجُدَ لِما خَلَقتُ بِيَدَيَّ ۖ أَستَكبَرتَ أَم كُنتَ مِنَ العالينَ",
    "قالَ أَنا خَيرٌ مِنهُ ۖ خَلَقتَني مِن نارٍ وَخَلَقتَهُ مِن طينٍ",
    "قالَ فَاخرُج مِنها فَإِنَّكَ رَجيمٌ",
    "وَإِنَّ عَلَيكَ لَعنَتي إِلىٰ يَومِ الدّينِ",
    "قالَ رَبِّ فَأَنظِرني إِلىٰ يَومِ يُبعَثونَ",
    "قالَ فَإِنَّكَ مِنَ المُنظَرينَ",
    "إِلىٰ يَومِ الوَقتِ المَعلومِ",
    "قالَ فَبِعِزَّتِكَ لَأُغوِيَنَّهُم أَجمَعينَ",
    "إِلّا عِبادَكَ مِنهُمُ المُخلَصينَ",
    "قالَ فَالحَقُّ وَالحَقَّ أَقولُ",
    "لَأَملَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنهُم أَجمَعينَ",
    "قُل ما أَسأَلُكُم عَلَيهِ مِن أَجرٍ وَما أَنا مِنَ المُتَكَلِّفينَ",
    "إِن هُوَ إِلّا ذِكرٌ لِلعالَمينَ",
    "وَلَتَعلَمُنَّ نَبَأَهُ بَعدَ حينٍ"
  ]
}