{
  "id": 39,
  "name": "الزمر",
  "transliteration": "Az-Zumar",
  "translation": "The Troops",
  "verses": [
    "تَنزيلُ الكِتابِ مِنَ اللَّهِ العَزيزِ الحَكيمِ",
    "إِنّا أَنزَلنا إِلَيكَ الكِتابَ بِالحَقِّ فَاعبُدِ اللَّهَ مُخلِصًا لَهُ الدّينَ",
    "أَلا لِلَّهِ الدّينُ الخالِصُ ۚ وَالَّذينَ اتَّخَذوا مِن دونِهِ أَولِياءَ ما نَعبُدُهُم إِلّا لِيُقَرِّبونا إِلَى اللَّهِ زُلفىٰ إِنَّ اللَّهَ يَحكُمُ بَينَهُم في ما هُم فيهِ يَختَلِفونَ ۗ إِنَّ اللَّهَ لا يَهدي مَن هُوَ كاذِبٌ كَفّارٌ",
    "لَو أَرادَ اللَّهُ أَن يَتَّخِذَ وَلَدًا لَاصطَفىٰ مِمّا يَخلُقُ ما يَشاءُ ۚ سُبحانَهُ ۖ هُوَ اللَّهُ الواحِدُ القَهّارُ",
    "خَلَقَ السَّماواتِ وَالأَرضَ بِالحَقِّ ۖ يُكَوِّرُ اللَّيلَ عَلَى النَّهارِ وَيُكَوِّرُ النَّهارَ عَلَى اللَّيلِ ۖ وَسَخَّرَ الشَّمسَ وَالقَمَرَ ۖ كُلٌّ يَجري لِأَجَلٍ مُسَمًّى ۗ أَلا هُوَ العَزيزُ الغَفّارُ",
    "خَلَقَكُم مِن نَفسٍ واحِدَةٍ ثُمَّ جَعَلَ مِنها زَوجَها وَأَنزَلَ لَكُم مِنَ الأَنعامِ ثَمانِيَةَ أَزواجٍ ۚ يَخلُقُكُم في بُطونِ أُمَّهاتِكُم خَلقًا مِن بَعدِ خَلقٍ في ظُلُماتٍ ثَلاثٍ ۚ ذٰلِكُمُ اللَّهُ رَبُّكُم لَهُ المُلكُ ۖ لا إِلٰهَ إِلّا هُوَ ۖ فَأَنّىٰ تُصرَفونَ",
    "إِن تَكفُروا فَإِنَّ اللَّهَ غَنِيٌّ عَنكُم ۖ وَلا يَرضىٰ لِعِبادِهِ الكُفرَ ۖ وَإِن تَشكُروا يَرضَهُ لَكُم ۗ وَلا تَزِرُ وازِرَةٌ وِزرَ أُخرىٰ ۗ ثُمَّ إِلىٰ رَبِّكُم مَرجِعُكُم فَيُنَبِّئُكُم بِما كُنتُم تَعمَلونَ ۚ إِنَّهُ عَليمٌ بِذاتِ الصُّدورِ",
    "۞ وَإِذا مَسَّ الإِنسانَ ضُرٌّ دَعا رَبَّهُ مُنيبًا إِلَيهِ ثُمَّ إِذا خَوَّلَهُ نِعمَةً مِنهُ نَسِيَ ما كانَ يَدعو إِلَيهِ مِن قَبلُ وَجَعَلَ لِلَّهِ أَندادًا لِيُضِلَّ عَن سَبيلِهِ ۚ قُل تَمَتَّع بِكُفرِكَ قَليلًا ۖ إِنَّكَ مِن أَصحابِ النّارِ",
    "أَمَّن هُوَ قانِتٌ آناءَ اللَّيلِ ساجِدًا وَقائِمًا يَحذَرُ الآخِرَةَ وَيَرجو رَحمَةَ رَبِّهِ ۗ قُل هَل يَستَوِي الَّذينَ يَعلَمونَ وَالَّذينَ لا يَعلَمونَ ۗ إِنَّما يَتَذَكَّرُ أُولُو الأَلبابِ",
    "قُل يا عِبادِ الَّذينَ آمَنُوا اتَّقوا رَبَّكُم ۚ لِلَّذينَ أَحسَنوا في هٰذِهِ الدُّنيا حَسَنَةٌ ۗ وَأَرضُ اللَّهِ واسِعَةٌ ۗ إِنَّما يُوَفَّى الصّابِرونَ أَجرَهُم بِغَيرِ حِسابٍ",
    "قُل إِنّي أُمِرتُ أَن أَعبُدَ اللَّهَ مُخلِصًا لَهُ الدّينَ",
    "وَأُمِرتُ لِأَن أَكونَ أَوَّلَ المُسلِمينَ",
    "قُل إِنّي أَخافُ إِن عَصَيتُ رَبّي عَذابَ يَومٍ عَظيمٍ",
    "قُلِ اللَّهَ أَعبُدُ مُخلِصًا لَهُ ديني",
    "فَاعبُدوا ما شِئتُم مِن دونِهِ ۗ قُل إِنَّ الخاسِرينَ الَّذينَ خَسِروا أَنفُسَهُم وَأَهليهِم يَومَ القِيامَةِ ۗ أَلا ذٰلِكَ هُوَ الخُسرانُ المُبينُ",
    "لَهُم مِن فَوقِهِم ظُلَلٌ مِنَ النّارِ وَمِن تَحتِهِم ظُلَلٌ ۚ ذٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبادَهُ ۚ يا عِبادِ فَاتَّقونِ",
    "وَالَّذينَ اجتَنَبُوا الطّاغوتَ أَن يَعبُدوها وَأَنابوا إِلَى اللَّهِ لَهُمُ البُشرىٰ ۚ فَبَشِّر عِبادِ",
    "الَّذينَ يَستَمِعونَ القَولَ فَيَتَّبِعونَ أَحسَنَهُ ۚ أُولٰئِكَ الَّذينَ هَداهُمُ اللَّهُ ۖ وَأُولٰئِكَ هُم أُولُو الأَلبابِ",
    "أَفَمَن حَقَّ عَلَيهِ كَلِمَةُ العَذابِ أَفَأَنتَ تُنقِذُ مَن فِي النّارِ",
    "لٰكِنِ الَّذينَ اتَّقَوا رَبَّهُم لَهُم غُرَفٌ مِن فَوقِها غُرَفٌ مَبنِيَّةٌ تَجري مِن تَحتِهَا الأَنهارُ ۖ وَعدَ اللَّهِ ۖ لا يُخلِفُ اللَّهُ الميعادَ",
    "أَلَم تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّماءِ ماءً فَسَلَكَهُ يَنابيعَ فِي الأَرضِ ثُمَّ يُخرِجُ بِهِ زَرعًا مُختَلِفًا أَلوانُهُ ثُمَّ يَهيجُ فَتَراهُ مُصفَرًّا ثُمَّ يَجعَلُهُ حُطامًا ۚ إِنَّ في ذٰلِكَ لَذِكرىٰ لِأُولِي الأَلبابِ",
    "أَفَمَن شَرَحَ اللَّهُ صَدرَهُ لِلإِسلامِ فَهُوَ عَلىٰ نورٍ مِن رَبِّهِ ۚ فَوَيلٌ لِلقاسِيَةِ قُلوبُهُم مِن ذِكرِ اللَّهِ ۚ أُولٰئِكَ في ضَلالٍ مُبينٍ",
    "اللَّهُ نَزَّلَ أَحسَنَ الحَديثِ كِتابًا مُتَشابِهًا مَثانِيَ تَقشَعِرُّ مِنهُ جُلودُ الَّذينَ يَخشَونَ رَبَّهُم ثُمَّ تَلينُ جُلودُهُم وَقُلوبُهُم إِلىٰ ذِكرِ اللَّهِ ۚ ذٰلِكَ هُدَى اللَّهِ يَهدي بِهِ مَن يَشاءُ ۚ وَمَن يُضلِلِ اللَّهُ فَما لَهُ مِن هادٍ",
    "أَفَمَن يَتَّقي بِوَجهِهِ سوءَ العَذابِ يَومَ القِيامَةِ ۚ وَقيلَ لِلظّالِمينَ ذوقوا ما كُنتُم تَكسِبونَ",
    "كَذَّبَ الَّذينَ مِن قَبلِهِم فَأَتاهُمُ العَذابُ مِن حَيثُ لا يَشعُرونَ",
    "فَأَذاقَهُمُ اللَّهُ الخِزيَ فِي الحَياةِ الدُّنيا ۖ وَلَعَذابُ الآخِرَةِ أَكبَرُ ۚ لَو كانوا يَعلَمونَ",
    "وَلَقَد ضَرَبنا لِلنّاسِ في هٰذَا القُرآنِ مِن كُلِّ مَثَلٍ لَعَلَّهُم يَتَذَكَّرونَ",
    "قُرآنًا عَرَبِيًّا غَيرَ ذي عِوَجٍ لَعَلَّهُم يَتَّقونَ",
    "ضَرَبَ اللَّهُ مَثَلًا رَجُلًا فيهِ شُرَكاءُ مُتَشاكِسونَ وَرَجُلًا سَلَمًا لِرَجُلٍ هَل يَستَوِيانِ مَثَلًا ۚ الحَمدُ لِلَّهِ ۚ بَل أَكثَرُهُم لا يَعلَمونَ",
    "إِنَّكَ مَيِّتٌ وَإِنَّهُم مَيِّتونَ",
    "ثُمَّ إِنَّكُم يَومَ القِيامَةِ عِندَ رَبِّكُم تَختَصِمونَ",
    "۞ فَمَن أَظلَمُ مِمَّن كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدقِ إِذ جاءَهُ ۚ أَلَيسَ في جَهَنَّمَ مَثوًى لِلكافِرينَ",
    "وَالَّذي جاءَ بِالصِّدقِ وَصَدَّقَ بِهِ ۙ أُولٰئِكَ هُمُ المُتَّقونَ",
    "لَهُم ما يَشاءونَ عِندَ رَبِّهِم ۚ ذٰلِكَ جَزاءُ المُحسِنينَ",
    "لِيُكَفِّرَ اللَّهُ عَنهُم أَسوَأَ الَّذي عَمِلوا وَيَجزِيَهُم أَجرَهُم بِأَحسَنِ الَّذي كانوا يَعمَلونَ",
    "أَلَيسَ اللَّهُ بِكافٍ عَبدَهُ ۖ وَيُخَوِّفونَكَ بِالَّذينَ مِن دونِهِ ۚ وَمَن يُضلِلِ اللَّهُ فَما لَهُ مِن هادٍ",
    "وَمَن يَهدِ اللَّهُ فَما لَهُ مِن مُضِلٍّ ۗ أَلَيسَ اللَّهُ بِعَزيزٍ ذِي انتِقامٍ",
    "وَلَئِن سَأَلتَهُم مَن خَلَقَ السَّماواتِ وَالأَرضَ لَيَقولُنَّ اللَّهُ ۚ قُل أَفَرَأَيتُم ما تَدعونَ مِن دونِ اللَّهِ إِن أَرادَنِيَ اللَّهُ بِضُرٍّ هَل هُنَّ كاشِفاتُ ضُرِّهِ أَو أَرادَني بِرَحمَةٍ هَل هُنَّ مُمسِكاتُ رَحمَتِهِ ۚ قُل حَسبِيَ اللَّهُ ۖ عَلَيهِ يَتَوَكَّلُ المُتَوَكِّلونَ",
    "قُل يا قَومِ اعمَلوا عَلىٰ مَكانَتِكُم إِنّي عامِلٌ ۖ فَسَوفَ تَعلَمونَ",
    "مَن يَأتيهِ عَذابٌ يُخزيهِ وَيَحِلُّ عَلَيهِ عَذابٌ مُقيمٌ",
    "إِنّا أَنزَلنا عَلَيكَ الكِتابَ لِلنّاسِ بِالحَقِّ ۖ فَمَنِ اهتَدىٰ فَلِنَفسِهِ ۖ وَمَن ضَلَّ فَإِنَّما يَضِلُّ عَلَيها ۖ وَما أَنتَ عَلَيهِم بِوَكيلٍ",
    "اللَّهُ يَتَوَفَّى الأَنفُسَ حينَ مَوتِها وَالَّتي لَم تَمُت في مَنامِها ۖ فَيُمسِكُ الَّتي قَضىٰ عَلَيهَا المَوتَ وَيُرسِلُ الأُخرىٰ إِلىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يَتَفَكَّرونَ",
    "أَمِ اتَّخَذوا مِن دونِ اللَّهِ شُفَعاءَ ۚ قُل أَوَلَو كانوا لا يَملِكونَ شَيئًا وَلا يَعقِلونَ",
    "قُل لِلَّهِ الشَّفاعَةُ جَميعًا ۖ لَهُ مُلكُ السَّماواتِ وَالأَرضِ ۖ ثُمَّ إِلَيهِ تُرجَعونَ",
    "وَإِذا ذُكِرَ اللَّهُ وَحدَهُ اشمَأَزَّت قُلوبُ الَّذينَ لا يُؤمِنونَ بِالآخِرَةِ ۖ وَإِذا ذُكِرَ الَّذينَ مِن دونِهِ إِذا هُم يَستَبشِرونَ",
    "قُلِ اللَّهُمَّ فاطِرَ السَّماواتِ وَالأَرضِ عالِمَ الغَيبِ وَالشَّهادَةِ أَنتَ تَحكُمُ بَينَ عِبادِكَ في ما كانوا فيهِ يَختَلِفونَ",
    "وَلَو أَنَّ لِلَّذينَ ظَلَموا ما فِي الأَرضِ جَميعًا وَمِثلَهُ مَعَهُ لَافتَدَوا بِهِ مِن سوءِ العَذابِ يَومَ القِيامَةِ ۚ وَبَدا لَهُم مِنَ اللَّهِ ما لَم يَكونوا يَحتَسِبونَ",
    "وَبَدا لَهُم سَيِّئَاتُ ما كَسَبوا وَحاقَ بِهِم ما كانوا بِهِ يَستَهزِئونَ",
    "فَإِذا مَسَّ الإِنسانَ ضُرٌّ دَعانا ثُمَّ إِذا خَوَّلناهُ نِعمَةً مِنّا قالَ إِنَّما أوتيتُهُ عَلىٰ عِلمٍ ۚ بَل هِيَ فِتنَةٌ وَلٰكِنَّ أَكثَرَهُم لا يَعلَمونَ",
    "قَد قالَهَا الَّذينَ مِن قَبلِهِم فَما أَغنىٰ عَنهُم ما كانوا يَكسِبونَ",
    "فَأَصابَهُم سَيِّئَاتُ ما كَسَبوا ۚ وَالَّذينَ ظَلَموا مِن هٰؤُلاءِ سَيُصيبُهُم سَيِّئَاتُ ما كَسَبوا وَما هُم بِمُعجِزينَ",
    "أَوَلَم يَعلَموا أَنَّ اللَّهَ يَبسُطُ الرِّزقَ لِمَن يَشاءُ وَيَقدِرُ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِقَومٍ يُؤمِنونَ",
    "۞ قُل يا عِبادِيَ الَّذينَ أَسرَفوا عَلىٰ أَنفُسِهِم لا تَقنَطوا مِن رَحمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغفِرُ الذُّنوبَ جَميعًا ۚ إِنَّهُ هُوَ الغَفورُ الرَّحيمُ",
    "وَأَنيبوا إِلىٰ رَبِّكُم وَأَسلِموا لَهُ مِن قَبلِ أَن يَأتِيَكُمُ العَذابُ ثُمَّ لا تُنصَرونَ",
    "وَاتَّبِعوا أَحسَنَ ما أُنزِلَ إِلَيكُم مِن رَبِّكُم مِن قَبلِ أَن يَأتِيَكُمُ العَذابُ بَغتَةً وَأَنتُم لا تَشعُرونَ",
    "أَن تَقولَ نَفسٌ يا حَسرَتا عَلىٰ ما فَرَّطتُ في جَنبِ اللَّهِ وَإِن كُنتُ لَمِنَ السّاخِرينَ",
    "أَو تَقولَ لَو أَنَّ اللَّهَ هَداني لَكُنتُ مِنَ المُتَّقينَ",
    "أَو تَقولَ حينَ تَرَى العَذابَ لَو أَنَّ لي كَرَّةً فَأَكونَ مِنَ المُحسِنينَ",
    "بَلىٰ قَد جاءَتكَ آياتي فَكَذَّبتَ بِها وَاستَكبَرتَ وَكُنتَ مِنَ الكافِرينَ",
    "وَيَومَ القِيامَةِ تَرَى الَّذينَ كَذَبوا عَلَى اللَّهِ وُجوهُهُم مُسوَدَّةٌ ۚ أَلَيسَ في جَهَنَّمَ مَثوًى لِلمُتَكَبِّرينَ",
    "وَيُنَجِّي اللَّهُ الَّذينَ اتَّقَوا بِمَفازَتِهِم لا يَمَسُّهُمُ السّوءُ وَلا هُم يَحزَنونَ",
    "اللَّهُ خالِقُ كُلِّ شَيءٍ ۖ وَهُوَ عَلىٰ كُلِّ شَيءٍ وَكيلٌ",
    "لَهُ مَقاليدُ السَّماواتِ وَالأَرضِ ۗ وَالَّذينَ كَفَروا بِآياتِ اللَّهِ أُولٰئِكَ هُمُ الخاسِرونَ",
    "قُل أَفَغَيرَ اللَّهِ تَأمُرونّي أَعبُدُ أَيُّهَا الجاهِلونَ",
    "وَلَقَد أوحِيَ إِلَيكَ وَإِلَى الَّذينَ مِن قَبلِكَ لَئِن أَشرَكتَ لَيَحبَطَنَّ عَمَلُكَ وَلَتَكونَنَّ مِنَ الخاسِرينَ",
    "بَلِ اللَّهَ فَاعبُد وَكُن مِنَ الشّاكِرينَ",
    "وَما قَدَرُوا اللَّهَ حَقَّ قَدرِهِ وَالأَرضُ جَميعًا قَبضَتُهُ يَومَ القِيامَةِ وَالسَّماواتُ مَطوِيّاتٌ بِيَمينِهِ ۚ سُبحانَهُ وَتَعالىٰ عَمّا يُشرِكونَ",
    "وَنُفِخَ فِي الصّورِ فَصَعِقَ مَن فِي السَّماواتِ وَمَن فِي الأَرضِ إِلّا مَن شاءَ اللَّهُ ۖ ثُمَّ نُفِخَ فيهِ أُخرىٰ فَإِذا هُم قِيامٌ يَنظُرونَ",
    "وَأَشرَقَتِ الأَرضُ بِنورِ رَبِّها وَوُضِعَ الكِتابُ وَجِيءَ بِالنَّبِيّينَ وَالشُّهَداءِ وَقُضِيَ بَينَهُم بِالحَقِّ وَهُم لا يُظلَمونَ",
    "وَوُفِّيَت كُلُّ نَفسٍ ما عَمِلَت وَهُوَ أَعلَمُ بِما يَفعَلونَ",
    "وَسيقَ الَّذينَ كَفَروا إِلىٰ جَهَنَّمَ زُمَرًا ۖ حَتّىٰ إِذا جاءوها فُتِحَت أَبوابُها وَقالَ لَهُم خَزَنَتُها أَلَم يَأتِكُم رُسُلٌ مِنكُم يَتلونَ عَلَيكُم آياتِ رَبِّكُم وَيُنذِرونَكُم لِقاءَ يَومِكُم هٰذا ۚ قالوا بَلىٰ وَلٰكِن حَقَّت كَلِمَةُ العَذابِ عَلَى الكافِرينَ",
    "قيلَ ادخُلوا أَبوابَ جَهَنَّمَ خالِدينَ فيها ۖ فَبِئسَ مَثوَى المُتَكَبِّرينَ",
    "وَسيقَ الَّذينَ اتَّقَوا رَبَّهُم إِلَى الجَنَّةِ زُمَرًا ۖ حَتّىٰ إِذا جاءوها وَفُتِحَت أَبوابُها وَقالَ لَهُم خَزَنَتُها سَلامٌ عَلَيكُم طِبتُم فَادخُلوها خالِدينَ",
    "وَقالُوا الحَمدُ لِلَّهِ الَّذي صَدَقَنا وَعدَهُ وَأَورَثَنَا الأَرضَ نَتَبَوَّأُ مِنَ الجَنَّةِ حَيثُ نَشاءُ ۖ فَنِعمَ أَجرُ العامِلينَ",
    "وَتَرَى المَلائِكَةَ حافّينَ مِن حَولِ العَرشِ يُسَبِّحونَ بِحَمدِ رَبِّهِم ۖ وَقُضِيَ بَينَهُم بِالحَقِّ وَقيلَ الحَمدُ لِلَّهِ رَبِّ العالَمينَ"
  ]
}