{
  "id": 40,
  "name": "غافر",
  "transliteration": "Ghafir",
  "translation": "The Forgiver",
  "verses": [
    "حم",
    "تَنزيلُ الكِتابِ مِنَ اللَّهِ العَزيزِ العَليمِ",
    "غافِرِ الذَّنبِ وَقابِلِ التَّوبِ شَديدِ العِقابِ ذِي الطَّولِ ۖ لا إِلٰهَ إِلّا هُوَ ۖ إِلَيهِ المَصيرُ",
    "ما يُجادِلُ في آياتِ اللَّهِ إِلَّا الَّذينَ كَفَروا فَلا يَغرُركَ تَقَلُّبُهُم فِي البِلادِ",
    "كَذَّبَت قَبلَهُم قَومُ نوحٍ وَالأَحزابُ مِن بَعدِهِم ۖ وَهَمَّت كُلُّ أُمَّةٍ بِرَسولِهِم لِيَأخُذوهُ ۖ وَجادَلوا بِالباطِلِ لِيُدحِضوا بِهِ الحَقَّ فَأَخَذتُهُم ۖ فَكَيفَ كانَ عِقابِ",
    "وَكَذٰلِكَ حَقَّت كَلِمَتُ رَبِّكَ عَلَى الَّذينَ كَفَروا أَنَّهُم أَصحابُ النّارِ",
    "الَّذينَ يَحمِلونَ العَرشَ وَمَن حَولَهُ يُسَبِّحونَ بِحَمدِ رَبِّهِم وَيُؤمِنونَ بِهِ وَيَستَغفِرونَ لِلَّذينَ آمَنوا رَبَّنا وَسِعتَ كُلَّ شَيءٍ رَحمَةً وَعِلمًا فَاغفِر لِلَّذينَ تابوا وَاتَّبَعوا سَبيلَكَ وَقِهِم عَذابَ الجَحيمِ",
    "رَبَّنا وَأَدخِلهُم جَنّاتِ عَدنٍ الَّتي وَعَدتَهُم وَمَن صَلَحَ مِن آبائِهِم وَأَزواجِهِم وَذُرِّيّاتِهِم ۚ إِنَّكَ أَنتَ العَزيزُ الحَكيمُ",
    "وَقِهِمُ السَّيِّئَاتِ ۚ وَمَن تَقِ السَّيِّئَاتِ يَومَئِذٍ فَقَد رَحِمتَهُ ۚ وَذٰلِكَ هُوَ الفَوزُ العَظيمُ",
    "إِنَّ الَّذينَ كَفَروا يُنادَونَ لَمَقتُ اللَّهِ أَكبَرُ مِن مَقتِكُم أَنفُسَكُم إِذ تُدعَونَ إِلَى الإيمانِ فَتَكفُرونَ",
    "قالوا رَبَّنا أَمَتَّنَا اثنَتَينِ وَأَحيَيتَنَا اثنَتَينِ فَاعتَرَفنا بِذُنوبِنا فَهَل إِلىٰ خُروجٍ مِن سَبيلٍ",
    "ذٰلِكُم بِأَنَّهُ إِذا دُعِيَ اللَّهُ وَحدَهُ كَفَرتُم ۖ وَإِن يُشرَك بِهِ تُؤمِنوا ۚ فَالحُكمُ لِلَّهِ العَلِيِّ الكَبيرِ",
    "هُوَ الَّذي يُريكُم آياتِهِ وَيُنَزِّلُ لَكُم مِنَ السَّماءِ رِزقًا ۚ وَما يَتَذَكَّرُ إِلّا مَن يُنيبُ",
    "فَادعُوا اللَّهَ مُخلِصينَ لَهُ الدّينَ وَلَو كَرِهَ الكافِرونَ",
    "رَفيعُ الدَّرَجاتِ ذُو العَرشِ يُلقِي الرّوحَ مِن أَمرِهِ عَلىٰ مَن يَشاءُ مِن عِبادِهِ لِيُنذِرَ يَومَ التَّلاقِ",
    "يَومَ هُم بارِزونَ ۖ لا يَخفىٰ عَلَى اللَّهِ مِنهُم شَيءٌ ۚ لِمَنِ المُلكُ اليَومَ ۖ لِلَّهِ الواحِدِ القَهّارِ",
    "اليَومَ تُجزىٰ كُلُّ نَفسٍ بِما كَسَبَت ۚ لا ظُلمَ اليَومَ ۚ إِنَّ اللَّهَ سَريعُ الحِسابِ",
    "وَأَنذِرهُم يَومَ الآزِفَةِ إِذِ القُلوبُ لَدَى الحَناجِرِ كاظِمينَ ۚ ما لِلظّالِمينَ مِن حَميمٍ وَلا شَفيعٍ يُطاعُ",
    "يَعلَمُ خائِنَةَ الأَعيُنِ وَما تُخفِي الصُّدورُ",
    "وَاللَّهُ يَقضي بِالحَقِّ ۖ وَالَّذينَ يَدعونَ مِن دونِهِ لا يَقضونَ بِشَيءٍ ۗ إِنَّ اللَّهَ هُوَ السَّميعُ البَصيرُ",
    "۞ أَوَلَم يَسيروا فِي الأَرضِ فَيَنظُروا كَيفَ كانَ عاقِبَةُ الَّذينَ كانوا مِن قَبلِهِم ۚ كانوا هُم أَشَدَّ مِنهُم قُوَّةً وَآثارًا فِي الأَرضِ فَأَخَذَهُمُ اللَّهُ بِذُنوبِهِم وَما كانَ لَهُم مِنَ اللَّهِ مِن واقٍ",
    "ذٰلِكَ بِأَنَّهُم كانَت تَأتيهِم رُسُلُهُم بِالبَيِّناتِ فَكَفَروا فَأَخَذَهُمُ اللَّهُ ۚ إِنَّهُ قَوِيٌّ شَديدُ العِقابِ",
    "وَلَقَد أَرسَلنا موسىٰ بِآياتِنا وَسُلطانٍ مُبينٍ",
    "إِلىٰ فِرعَونَ وَهامانَ وَقارونَ فَقالوا ساحِرٌ كَذّابٌ",
    "فَلَمّا جاءَهُم بِالحَقِّ مِن عِندِنا قالُوا اقتُلوا أَبناءَ الَّذينَ آمَنوا مَعَهُ وَاستَحيوا نِساءَهُم ۚ وَما كَيدُ الكافِرينَ إِلّا في ضَلالٍ",
    "وَقالَ فِرعَونُ ذَروني أَقتُل موسىٰ وَليَدعُ رَبَّهُ ۖ إِنّي أَخافُ أَن يُبَدِّلَ دينَكُم أَو أَن يُظهِرَ فِي الأَرضِ الفَسادَ",
    "وَقالَ موسىٰ إِنّي عُذتُ بِرَبّي وَرَبِّكُم مِن كُلِّ مُتَكَبِّرٍ لا يُؤمِنُ بِيَومِ الحِسابِ",
    "وَقالَ رَجُلٌ مُؤمِنٌ مِن آلِ فِرعَونَ يَكتُمُ إيمانَهُ أَتَقتُلونَ رَجُلًا أَن يَقولَ رَبِّيَ اللَّهُ وَقَد جاءَكُم بِالبَيِّناتِ مِن رَبِّكُم ۖ وَإِن يَكُ كاذِبًا فَعَلَيهِ كَذِبُهُ ۖ وَإِن يَكُ صادِقًا يُصِبكُم بَعضُ الَّذي يَعِدُكُم ۖ إِنَّ اللَّهَ لا يَهدي مَن هُوَ مُسرِفٌ كَذّابٌ",
    "يا قَومِ لَكُمُ المُلكُ اليَومَ ظاهِرينَ فِي الأَرضِ فَمَن يَنصُرُنا مِن بَأسِ اللَّهِ إِن جاءَنا ۚ قالَ فِرعَونُ ما أُريكُم إِلّا ما أَرىٰ وَما أَهديكُم إِلّا سَبيلَ الرَّشادِ",
    "وَقالَ الَّذي آمَنَ يا قَومِ إِنّي أَخافُ عَلَيكُم مِثلَ يَومِ الأَحزابِ",
    "مِثلَ دَأبِ قَومِ نوحٍ وَعادٍ وَثَمودَ وَالَّذينَ مِن بَعدِهِم ۚ وَمَا اللَّهُ يُريدُ ظُلمًا لِلعِبادِ",
    "وَيا قَومِ إِنّي أَخافُ عَلَيكُم يَومَ التَّنادِ",
    "يَومَ تُوَلّونَ مُدبِرينَ ما لَكُم مِنَ اللَّهِ مِن عاصِمٍ ۗ وَمَن يُضلِلِ اللَّهُ فَما لَهُ مِن هادٍ",
    "وَلَقَد جاءَكُم يوسُفُ مِن قَبلُ بِالبَيِّناتِ فَما زِلتُم في شَكٍّ مِمّا جاءَكُم بِهِ ۖ حَتّىٰ إِذا هَلَكَ قُلتُم لَن يَبعَثَ اللَّهُ مِن بَعدِهِ رَسولًا ۚ كَذٰلِكَ يُضِلُّ اللَّهُ مَن هُوَ مُسرِفٌ مُرتابٌ",
    "الَّذينَ يُجادِلونَ في آياتِ اللَّهِ بِغَيرِ سُلطانٍ أَتاهُم ۖ كَبُرَ مَقتًا عِندَ اللَّهِ وَعِندَ الَّذينَ آمَنوا ۚ كَذٰلِكَ يَطبَعُ اللَّهُ عَلىٰ كُلِّ قَلبِ مُتَكَبِّرٍ جَبّارٍ",
    "وَقالَ فِرعَونُ يا هامانُ ابنِ لي صَرحًا لَعَلّي أَبلُغُ الأَسبابَ",
    "أَسبابَ السَّماواتِ فَأَطَّلِعَ إِلىٰ إِلٰهِ موسىٰ وَإِنّي لَأَظُنُّهُ كاذِبًا ۚ وَكَذٰلِكَ زُيِّنَ لِفِرعَونَ سوءُ عَمَلِهِ وَصُدَّ عَنِ السَّبيلِ ۚ وَما كَيدُ فِرعَونَ إِلّا في تَبابٍ",
    "وَقالَ الَّذي آمَنَ يا قَومِ اتَّبِعونِ أَهدِكُم سَبيلَ الرَّشادِ",
    "يا قَومِ إِنَّما هٰذِهِ الحَياةُ الدُّنيا مَتاعٌ وَإِنَّ الآخِرَةَ هِيَ دارُ القَرارِ",
    "مَن عَمِلَ سَيِّئَةً فَلا يُجزىٰ إِلّا مِثلَها ۖ وَمَن عَمِلَ صالِحًا مِن ذَكَرٍ أَو أُنثىٰ وَهُوَ مُؤمِنٌ فَأُولٰئِكَ يَدخُلونَ الجَنَّةَ يُرزَقونَ فيها بِغَيرِ حِسابٍ",
    "۞ وَيا قَومِ ما لي أَدعوكُم إِلَى النَّجاةِ وَتَدعونَني إِلَى النّارِ",
    "تَدعونَني لِأَكفُرَ بِاللَّهِ وَأُشرِكَ بِهِ ما لَيسَ لي بِهِ عِلمٌ وَأَنا أَدعوكُم إِلَى العَزيزِ الغَفّارِ",
    "لا جَرَمَ أَنَّما تَدعونَني إِلَيهِ لَيسَ لَهُ دَعوَةٌ فِي الدُّنيا وَلا فِي الآخِرَةِ وَأَنَّ مَرَدَّنا إِلَى اللَّهِ وَأَنَّ المُسرِفينَ هُم أَصحابُ النّارِ",
    "فَسَتَذكُرونَ ما أَقولُ لَكُم ۚ وَأُفَوِّضُ أَمري إِلَى اللَّهِ ۚ إِنَّ اللَّهَ بَصيرٌ بِالعِبادِ",
    "فَوَقاهُ اللَّهُ سَيِّئَاتِ ما مَكَروا ۖ وَحاقَ بِآلِ فِرعَونَ سوءُ العَذابِ",
    "النّارُ يُعرَضونَ عَلَيها غُدُوًّا وَعَشِيًّا ۖ وَيَومَ تَقومُ السّاعَةُ أَدخِلوا آلَ فِرعَونَ أَشَدَّ العَذابِ",
    "وَإِذ يَتَحاجّونَ فِي النّارِ فَيَقولُ الضُّعَفاءُ لِلَّذينَ استَكبَروا إِنّا كُنّا لَكُم تَبَعًا فَهَل أَنتُم مُغنونَ عَنّا نَصيبًا مِنَ النّارِ",
    "قالَ الَّذينَ استَكبَروا إِنّا كُلٌّ فيها إِنَّ اللَّهَ قَد حَكَمَ بَينَ العِبادِ",
    "وَقالَ الَّذينَ فِي النّارِ لِخَزَنَةِ جَهَنَّمَ ادعوا رَبَّكُم يُخَفِّف عَنّا يَومًا مِنَ العَذابِ",
    "قالوا أَوَلَم تَكُ تَأتيكُم رُسُلُكُم بِالبَيِّناتِ ۖ قالوا بَلىٰ ۚ قالوا فَادعوا ۗ وَما دُعاءُ الكافِرينَ إِلّا في ضَلالٍ",
    "إِنّا لَنَنصُرُ رُسُلَنا وَالَّذينَ آمَنوا فِي الحَياةِ الدُّنيا وَيَومَ يَقومُ الأَشهادُ",
    "يَومَ لا يَنفَعُ الظّالِمينَ مَعذِرَتُهُم ۖ وَلَهُمُ اللَّعنَةُ وَلَهُم سوءُ الدّارِ",
    "وَلَقَد آتَينا موسَى الهُدىٰ وَأَورَثنا بَني إِسرائيلَ الكِتابَ",
    "هُدًى وَذِكرىٰ لِأُولِي الأَلبابِ",
    "فَاصبِر إِنَّ وَعدَ اللَّهِ حَقٌّ وَاستَغفِر لِذَنبِكَ وَسَبِّح بِحَمدِ رَبِّكَ بِالعَشِيِّ وَالإِبكارِ",
    "إِنَّ الَّذينَ يُجادِلونَ في آياتِ اللَّهِ بِغَيرِ سُلطانٍ أَتاهُم ۙ إِن في صُدورِهِم إِلّا كِبرٌ ما هُم بِبالِغيهِ ۚ فَاستَعِذ بِاللَّهِ ۖ إِنَّهُ هُوَ السَّميعُ البَصيرُ",
    "لَخَلقُ السَّماواتِ وَالأَرضِ أَكبَرُ مِن خَلقِ النّاسِ وَلٰكِنَّ أَكثَرَ النّاسِ لا يَعلَمونَ",
    "وَما يَستَوِي الأَعمىٰ وَالبَصيرُ وَالَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ وَلَا المُسيءُ ۚ قَليلًا ما تَتَذَكَّرونَ",
    "إِنَّ السّاعَةَ لَآتِيَةٌ لا رَيبَ فيها وَلٰكِنَّ أَكثَرَ النّاسِ لا يُؤمِنونَ",
    "وَقالَ رَبُّكُمُ ادعوني أَستَجِب لَكُم ۚ إِنَّ الَّذينَ يَستَكبِرونَ عَن عِبادَتي سَيَدخُلونَ جَهَنَّمَ داخِرينَ",
    "اللَّهُ الَّذي جَعَلَ لَكُمُ اللَّيلَ لِتَسكُنوا فيهِ وَالنَّهارَ مُبصِرًا ۚ إِنَّ اللَّهَ لَذو فَضلٍ عَلَى النّاسِ وَلٰكِنَّ أَكثَرَ النّاسِ لا يَشكُرونَ",
    "ذٰلِكُمُ اللَّهُ رَبُّكُم خالِقُ كُلِّ شَيءٍ لا إِلٰهَ إِلّا هُوَ ۖ فَأَنّىٰ تُؤفَكونَ",
    "كَذٰلِكَ يُؤفَكُ الَّذينَ كانوا بِآياتِ اللَّهِ يَجحَدونَ",
    "اللَّهُ الَّذي جَعَلَ لَكُمُ الأَرضَ قَرارًا وَالسَّماءَ بِناءً وَصَوَّرَكُم فَأَحسَنَ صُوَرَكُم وَرَزَقَكُم مِنَ الطَّيِّباتِ ۚ ذٰلِكُمُ اللَّهُ رَبُّكُم ۖ فَتَبارَكَ اللَّهُ رَبُّ العالَمينَ",
    "هُوَ الحَيُّ لا إِلٰهَ إِلّا هُوَ فَادعوهُ مُخلِصينَ لَهُ الدّينَ ۗ الحَمدُ لِلَّهِ رَبِّ العالَمينَ",
    "۞ قُل إِنّي نُهيتُ أَن أَعبُدَ الَّذينَ تَدعونَ مِن دونِ اللَّهِ لَمّا جاءَنِيَ البَيِّناتُ مِن رَبّي وَأُمِرتُ أَن أُسلِمَ لِرَبِّ العالَمينَ",
    "هُوَ الَّذي خَلَقَكُم مِن تُرابٍ ثُمَّ مِن نُطفَةٍ ثُمَّ مِن عَلَقَةٍ ثُمَّ يُخرِجُكُم طِفلًا ثُمَّ لِتَبلُغوا أَشُدَّكُم ثُمَّ لِتَكونوا شُيوخًا ۚ وَمِنكُم مَن يُتَوَفّىٰ مِن قَبلُ ۖ وَلِتَبلُغوا أَجَلًا مُسَمًّى وَلَعَلَّكُم تَعقِلونَ",
    "هُوَ الَّذي يُحيي وَيُميتُ ۖ فَإِذا قَضىٰ أَمرًا فَإِنَّما يَقولُ لَهُ كُن فَيَكونُ",
    "أَلَم تَرَ إِلَى الَّذينَ يُجادِلونَ في آياتِ اللَّهِ أَنّىٰ يُصرَفونَ",
    "الَّذينَ كَذَّبوا بِالكِتابِ وَبِما أَرسَلنا بِهِ رُسُلَنا ۖ فَسَوفَ يَعلَمونَ",
    "إِذِ الأَغلالُ في أَعناقِهِم وَالسَّلاسِلُ يُسحَبونَ",
    "فِي الحَميمِ ثُمَّ فِي النّارِ يُسجَرونَ",
    "ثُمَّ قيلَ لَهُم أَينَ ما كُنتُم تُشرِكونَ",
    "مِن دونِ اللَّهِ ۖ قالوا ضَلّوا عَنّا بَل لَم نَكُن نَدعو مِن قَبلُ شَيئًا ۚ كَذٰلِكَ يُضِلُّ اللَّهُ الكافِرينَ",
    "ذٰلِكُم بِما كُنتُم تَفرَحونَ فِي الأَرضِ بِغَيرِ الحَقِّ وَبِما كُنتُم تَمرَحونَ",
    "ادخُلوا أَبوابَ جَهَنَّمَ خالِدينَ فيها ۖ فَبِئسَ مَثوَى المُتَكَبِّرينَ",
    "فَاصبِر إِنَّ وَعدَ اللَّهِ حَقٌّ ۚ فَإِمّا نُرِيَنَّكَ بَعضَ الَّذي نَعِدُهُم أَو نَتَوَفَّيَنَّكَ فَإِلَينا يُرجَعونَ",
    "وَلَقَد أَرسَلنا رُسُلًا مِن قَبلِكَ مِنهُم مَن قَصَصنا عَلَيكَ وَمِنهُم مَن لَم نَقصُص عَلَيكَ ۗ وَما كانَ لِرَسولٍ أَن يَأتِيَ بِآيَةٍ إِلّا بِإِذنِ اللَّهِ ۚ فَإِذا جاءَ أَمرُ اللَّهِ قُضِيَ بِالحَقِّ وَخَسِرَ هُنالِكَ المُبطِلونَ",
    "اللَّهُ الَّذي جَعَلَ لَكُمُ الأَنعامَ لِتَركَبوا مِنها وَمِنها تَأكُلونَ",
    "وَلَكُم فيها مَنافِعُ وَلِتَبلُغوا عَلَيها حاجَةً في صُدورِكُم وَعَلَيها وَعَلَى الفُلكِ تُحمَلونَ",
    "وَيُريكُم آياتِهِ فَأَيَّ آياتِ اللَّهِ تُنكِرونَ",
    "أَفَلَم يَسيروا فِي الأَرضِ فَيَنظُروا كَيفَ كانَ عاقِبَةُ الَّذينَ مِن قَبلِهِم ۚ كانوا أَكثَرَ مِنهُم وَأَشَدَّ قُوَّةً وَآثارًا فِي الأَرضِ فَما أَغنىٰ عَنهُم ما كانوا يَكسِبونَ",
    "فَلَمّا جاءَتهُم رُسُلُهُم بِالبَيِّناتِ فَرِحوا بِما عِندَهُم مِنَ العِلمِ وَحاقَ بِهِم ما كانوا بِهِ يَستَهزِئونَ",
    "فَلَمّا رَأَوا بَأسَنا قالوا آمَنّا بِاللَّهِ وَحدَهُ وَكَفَرنا بِما كُنّا بِهِ مُشرِكينَ",
    "فَلَم يَكُ يَنفَعُهُم إيمانُهُم لَمّا رَأَوا بَأسَنا ۖ سُنَّتَ اللَّهِ الَّتي قَد خَلَت في عِبادِهِ ۖ وَخَسِرَ هُنالِكَ الكافِرونَ"
  ]
}