{
  "id": 42,
  "name": "الشورى",
  "transliteration": "Ash-Shuraa",
  "translation": "The Consultation",
  "verses": [
    "حم",
    "عسق",
    "كَذٰلِكَ يوحي إِلَيكَ وَإِلَى الَّذينَ مِن قَبلِكَ اللَّهُ العَزيزُ الحَكيمُ",
    "لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۖ وَهُوَ العَلِيُّ العَظيمُ",
    "تَكادُ السَّماواتُ يَتَفَطَّرنَ مِن فَوقِهِنَّ ۚ وَالمَلائِكَةُ يُسَبِّحونَ بِحَمدِ رَبِّهِم وَيَستَغفِرونَ لِمَن فِي الأَرضِ ۗ أَلا إِنَّ اللَّهَ هُوَ الغَفورُ الرَّحيمُ",
    "وَالَّذينَ اتَّخَذوا مِن دونِهِ أَولِياءَ اللَّهُ حَفيظٌ عَلَيهِم وَما أَنتَ عَلَيهِم بِوَكيلٍ",
    "وَكَذٰلِكَ أَوحَينا إِلَيكَ قُرآنًا عَرَبِيًّا لِتُنذِرَ أُمَّ القُرىٰ وَمَن حَولَها وَتُنذِرَ يَومَ الجَمعِ لا رَيبَ فيهِ ۚ فَريقٌ فِي الجَنَّةِ وَفَريقٌ فِي السَّعيرِ",
    "وَلَو شاءَ اللَّهُ لَجَعَلَهُم أُمَّةً واحِدَةً وَلٰكِن يُدخِلُ مَن يَشاءُ في رَحمَتِهِ ۚ وَالظّالِمونَ ما لَهُم مِن وَلِيٍّ وَلا نَصيرٍ",
    "أَمِ اتَّخَذوا مِن دونِهِ أَولِياءَ ۖ فَاللَّهُ هُوَ الوَلِيُّ وَهُوَ يُحيِي المَوتىٰ وَهُوَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "وَمَا اختَلَفتُم فيهِ مِن شَيءٍ فَحُكمُهُ إِلَى اللَّهِ ۚ ذٰلِكُمُ اللَّهُ رَبّي عَلَيهِ تَوَكَّلتُ وَإِلَيهِ أُنيبُ",
    "فاطِرُ السَّماواتِ وَالأَرضِ ۚ جَعَلَ لَكُم مِن أَنفُسِكُم أَزواجًا وَمِنَ الأَنعامِ أَزواجًا ۖ يَذرَؤُكُم فيهِ ۚ لَيسَ كَمِثلِهِ شَيءٌ ۖ وَهُوَ السَّميعُ البَصيرُ",
    "لَهُ مَقاليدُ السَّماواتِ وَالأَرضِ ۖ يَبسُطُ الرِّزقَ لِمَن يَشاءُ وَيَقدِرُ ۚ إِنَّهُ بِكُلِّ شَيءٍ عَليمٌ",
    "۞ شَرَعَ لَكُم مِنَ الدّينِ ما وَصّىٰ بِهِ نوحًا وَالَّذي أَوحَينا إِلَيكَ وَما وَصَّينا بِهِ إِبراهيمَ وَموسىٰ وَعيسىٰ ۖ أَن أَقيمُوا الدّينَ وَلا تَتَفَرَّقوا فيهِ ۚ كَبُرَ عَلَى المُشرِكينَ ما تَدعوهُم إِلَيهِ ۚ اللَّهُ يَجتَبي إِلَيهِ مَن يَشاءُ وَيَهدي إِلَيهِ مَن يُنيبُ",
    "وَما تَفَرَّقوا إِلّا مِن بَعدِ ما جاءَهُمُ العِلمُ بَغيًا بَينَهُم ۚ وَلَولا كَلِمَةٌ سَبَقَت مِن رَبِّكَ إِلىٰ أَجَلٍ مُسَمًّى لَقُضِيَ بَينَهُم ۚ وَإِنَّ الَّذينَ أورِثُوا الكِتابَ مِن بَعدِهِم لَفي شَكٍّ مِنهُ مُريبٍ",
    "فَلِذٰلِكَ فَادعُ ۖ وَاستَقِم كَما أُمِرتَ ۖ وَلا تَتَّبِع أَهواءَهُم ۖ وَقُل آمَنتُ بِما أَنزَلَ اللَّهُ مِن كِتابٍ ۖ وَأُمِرتُ لِأَعدِلَ بَينَكُمُ ۖ اللَّهُ رَبُّنا وَرَبُّكُم ۖ لَنا أَعمالُنا وَلَكُم أَعمالُكُم ۖ لا حُجَّةَ بَينَنا وَبَينَكُمُ ۖ اللَّهُ يَجمَعُ بَينَنا ۖ وَإِلَيهِ المَصيرُ",
    "وَالَّذينَ يُحاجّونَ فِي اللَّهِ مِن بَعدِ مَا استُجيبَ لَهُ حُجَّتُهُم داحِضَةٌ عِندَ رَبِّهِم وَعَلَيهِم غَضَبٌ وَلَهُم عَذابٌ شَديدٌ",
    "اللَّهُ الَّذي أَنزَلَ الكِتابَ بِالحَقِّ وَالميزانَ ۗ وَما يُدريكَ لَعَلَّ السّاعَةَ قَريبٌ",
    "يَستَعجِلُ بِهَا الَّذينَ لا يُؤمِنونَ بِها ۖ وَالَّذينَ آمَنوا مُشفِقونَ مِنها وَيَعلَمونَ أَنَّهَا الحَقُّ ۗ أَلا إِنَّ الَّذينَ يُمارونَ فِي السّاعَةِ لَفي ضَلالٍ بَعيدٍ",
    "اللَّهُ لَطيفٌ بِعِبادِهِ يَرزُقُ مَن يَشاءُ ۖ وَهُوَ القَوِيُّ العَزيزُ",
    "مَن كانَ يُريدُ حَرثَ الآخِرَةِ نَزِد لَهُ في حَرثِهِ ۖ وَمَن كانَ يُريدُ حَرثَ الدُّنيا نُؤتِهِ مِنها وَما لَهُ فِي الآخِرَةِ مِن نَصيبٍ",
    "أَم لَهُم شُرَكاءُ شَرَعوا لَهُم مِنَ الدّينِ ما لَم يَأذَن بِهِ اللَّهُ ۚ وَلَولا كَلِمَةُ الفَصلِ لَقُضِيَ بَينَهُم ۗ وَإِنَّ الظّالِمينَ لَهُم عَذابٌ أَليمٌ",
    "تَرَى الظّالِمينَ مُشفِقينَ مِمّا كَسَبوا وَهُوَ واقِعٌ بِهِم ۗ وَالَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ في رَوضاتِ الجَنّاتِ ۖ لَهُم ما يَشاءونَ عِندَ رَبِّهِم ۚ ذٰلِكَ هُوَ الفَضلُ الكَبيرُ",
    "ذٰلِكَ الَّذي يُبَشِّرُ اللَّهُ عِبادَهُ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ ۗ قُل لا أَسأَلُكُم عَلَيهِ أَجرًا إِلَّا المَوَدَّةَ فِي القُربىٰ ۗ وَمَن يَقتَرِف حَسَنَةً نَزِد لَهُ فيها حُسنًا ۚ إِنَّ اللَّهَ غَفورٌ شَكورٌ",
    "أَم يَقولونَ افتَرىٰ عَلَى اللَّهِ كَذِبًا ۖ فَإِن يَشَإِ اللَّهُ يَختِم عَلىٰ قَلبِكَ ۗ وَيَمحُ اللَّهُ الباطِلَ وَيُحِقُّ الحَقَّ بِكَلِماتِهِ ۚ إِنَّهُ عَليمٌ بِذاتِ الصُّدورِ",
    "وَهُوَ الَّذي يَقبَلُ التَّوبَةَ عَن عِبادِهِ وَيَعفو عَنِ السَّيِّئَاتِ وَيَعلَمُ ما تَفعَلونَ",
    "وَيَستَجيبُ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ وَيَزيدُهُم مِن فَضلِهِ ۚ وَالكافِرونَ لَهُم عَذابٌ شَديدٌ",
    "۞ وَلَو بَسَطَ اللَّهُ الرِّزقَ لِعِبادِهِ لَبَغَوا فِي الأَرضِ وَلٰكِن يُنَزِّلُ بِقَدَرٍ ما يَشاءُ ۚ إِنَّهُ بِعِبادِهِ خَبيرٌ بَصيرٌ",
    "وَهُوَ الَّذي يُنَزِّلُ الغَيثَ مِن بَعدِ ما قَنَطوا وَيَنشُرُ رَحمَتَهُ ۚ وَهُوَ الوَلِيُّ الحَميدُ",
    "وَمِن آياتِهِ خَلقُ السَّماواتِ وَالأَرضِ وَما بَثَّ فيهِما مِن دابَّةٍ ۚ وَهُوَ عَلىٰ جَمعِهِم إِذا يَشاءُ قَديرٌ",
    "وَما أَصابَكُم مِن مُصيبَةٍ فَبِما كَسَبَت أَيديكُم وَيَعفو عَن كَثيرٍ",
    "وَما أَنتُم بِمُعجِزينَ فِي الأَرضِ ۖ وَما لَكُم مِن دونِ اللَّهِ مِن وَلِيٍّ وَلا نَصيرٍ",
    "وَمِن آياتِهِ الجَوارِ فِي البَحرِ كَالأَعلامِ",
    "إِن يَشَأ يُسكِنِ الرّيحَ فَيَظلَلنَ رَواكِدَ عَلىٰ ظَهرِهِ ۚ إِنَّ في ذٰلِكَ لَآياتٍ لِكُلِّ صَبّارٍ شَكورٍ",
    "أَو يوبِقهُنَّ بِما كَسَبوا وَيَعفُ عَن كَثيرٍ",
    "وَيَعلَمَ الَّذينَ يُجادِلونَ في آياتِنا ما لَهُم مِن مَحيصٍ",
    "فَما أوتيتُم مِن شَيءٍ فَمَتاعُ الحَياةِ الدُّنيا ۖ وَما عِندَ اللَّهِ خَيرٌ وَأَبقىٰ لِلَّذينَ آمَنوا وَعَلىٰ رَبِّهِم يَتَوَكَّلونَ",
    "وَالَّذينَ يَجتَنِبونَ كَبائِرَ الإِثمِ وَالفَواحِشَ وَإِذا ما غَضِبوا هُم يَغفِرونَ",
    "وَالَّذينَ استَجابوا لِرَبِّهِم وَأَقامُوا الصَّلاةَ وَأَمرُهُم شورىٰ بَينَهُم وَمِمّا رَزَقناهُم يُنفِقونَ",
    "وَالَّذينَ إِذا أَصابَهُمُ البَغيُ هُم يَنتَصِرونَ",
    "وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثلُها ۖ فَمَن عَفا وَأَصلَحَ فَأَجرُهُ عَلَى اللَّهِ ۚ إِنَّهُ لا يُحِبُّ الظّالِمينَ",
    "وَلَمَنِ انتَصَرَ بَعدَ ظُلمِهِ فَأُولٰئِكَ ما عَلَيهِم مِن سَبيلٍ",
    "إِنَّمَا السَّبيلُ عَلَى الَّذينَ يَظلِمونَ النّاسَ وَيَبغونَ فِي الأَرضِ بِغَيرِ الحَقِّ ۚ أُولٰئِكَ لَهُم عَذابٌ أَليمٌ",
    "وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذٰلِكَ لَمِن عَزمِ الأُمورِ",
    "وَمَن يُضلِلِ اللَّهُ فَما لَهُ مِن وَلِيٍّ مِن بَعدِهِ ۗ وَتَرَى الظّالِمينَ لَمّا رَأَوُا العَذابَ يَقولونَ هَل إِلىٰ مَرَدٍّ مِن سَبيلٍ",
    "وَتَراهُم يُعرَضونَ عَلَيها خاشِعينَ مِنَ الذُّلِّ يَنظُرونَ مِن طَرفٍ خَفِيٍّ ۗ وَقالَ الَّذينَ آمَنوا إِنَّ الخاسِرينَ الَّذينَ خَسِروا أَنفُسَهُم وَأَهليهِم يَومَ القِيامَةِ ۗ أَلا إِنَّ الظّالِمينَ في عَذابٍ مُقيمٍ",
    "وَما كانَ لَهُم مِن أَولِياءَ يَنصُرونَهُم مِن دونِ اللَّهِ ۗ وَمَن يُضلِلِ اللَّهُ فَما لَهُ مِن سَبيلٍ",
    "استَجيبوا لِرَبِّكُم مِن قَبلِ أَن يَأتِيَ يَومٌ لا مَرَدَّ لَهُ مِنَ اللَّهِ ۚ ما لَكُم مِن مَلجَإٍ يَومَئِذٍ وَما لَكُم مِن نَكيرٍ",
    "فَإِن أَعرَضوا فَما أَرسَلناكَ عَلَيهِم حَفيظًا ۖ إِن عَلَيكَ إِلَّا البَلاغُ ۗ وَإِنّا إِذا أَذَقنَا الإِنسانَ مِنّا رَحمَةً فَرِحَ بِها ۖ وَإِن تُصِبهُم سَيِّئَةٌ بِما قَدَّمَت أَيديهِم فَإِنَّ الإِنسانَ كَفورٌ",
    "لِلَّهِ مُلكُ السَّماواتِ وَالأَرضِ ۚ يَخلُقُ ما يَشاءُ ۚ يَهَبُ لِمَن يَشاءُ إِناثًا وَيَهَبُ لِمَن يَشاءُ الذُّكورَ",
    "أَو يُزَوِّجُهُم ذُكرانًا وَإِناثًا ۖ وَيَجعَلُ مَن يَشاءُ عَقيمًا ۚ إِنَّهُ عَليمٌ قَديرٌ",
    "۞ وَما كانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلّا وَحيًا أَو مِن وَراءِ حِجابٍ أَو يُرسِلَ رَسولًا فَيوحِيَ بِإِذنِهِ ما يَشاءُ ۚ إِنَّهُ عَلِيٌّ حَكيمٌ",
    "وَكَذٰلِكَ أَوحَينا إِلَيكَ روحًا مِن أَمرِنا ۚ ما كُنتَ تَدري مَا الكِتابُ وَلَا الإيمانُ وَلٰكِن جَعَلناهُ نورًا نَهدي بِهِ مَن نَشاءُ مِن عِبادِنا ۚ وَإِنَّكَ لَتَهدي إِلىٰ صِراطٍ مُستَقيمٍ",
    "صِراطِ اللَّهِ الَّذي لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ أَلا إِلَى اللَّهِ تَصيرُ الأُمورُ"
  ]
}