{
  "id": 46,
  "name": "الأحقاف",
  "transliteration": "Al-Ahqaf",
  "translation": "The Wind-Curved Sandhills",
  "verses": [
    "حم",
    "تَنزيلُ الكِتابِ مِنَ اللَّهِ العَزيزِ الحَكيمِ",
    "ما خَلَقنَا السَّماواتِ وَالأَرضَ وَما بَينَهُما إِلّا بِالحَقِّ وَأَجَلٍ مُسَمًّى ۚ وَالَّذينَ كَفَروا عَمّا أُنذِروا مُعرِضونَ",
    "قُل أَرَأَيتُم ما تَدعونَ مِن دونِ اللَّهِ أَروني ماذا خَلَقوا مِنَ الأَرضِ أَم لَهُم شِركٌ فِي السَّماواتِ ۖ ائتوني بِكِتابٍ مِن قَبلِ هٰذا أَو أَثارَةٍ مِن عِلمٍ إِن كُنتُم صادِقينَ",
    "وَمَن أَضَلُّ مِمَّن يَدعو مِن دونِ اللَّهِ مَن لا يَستَجيبُ لَهُ إِلىٰ يَومِ القِيامَةِ وَهُم عَن دُعائِهِم غافِلونَ",
    "وَإِذا حُشِرَ النّاسُ كانوا لَهُم أَعداءً وَكانوا بِعِبادَتِهِم كافِرينَ",
    "وَإِذا تُتلىٰ عَلَيهِم آياتُنا بَيِّناتٍ قالَ الَّذينَ كَفَروا لِلحَقِّ لَمّا جاءَهُم هٰذا سِحرٌ مُبينٌ",
    "أَم يَقولونَ افتَراهُ ۖ قُل إِنِ افتَرَيتُهُ فَلا تَملِكونَ لي مِنَ اللَّهِ شَيئًا ۖ هُوَ أَعلَمُ بِما تُفيضونَ فيهِ ۖ كَفىٰ بِهِ شَهيدًا بَيني وَبَينَكُم ۖ وَهُوَ الغَفورُ الرَّحيمُ",
    "قُل ما كُنتُ بِدعًا مِنَ الرُّسُلِ وَما أَدري ما يُفعَلُ بي وَلا بِكُم ۖ إِن أَتَّبِعُ إِلّا ما يوحىٰ إِلَيَّ وَما أَنا إِلّا نَذيرٌ مُبينٌ",
    "قُل أَرَأَيتُم إِن كانَ مِن عِندِ اللَّهِ وَكَفَرتُم بِهِ وَشَهِدَ شاهِدٌ مِن بَني إِسرائيلَ عَلىٰ مِثلِهِ فَآمَنَ وَاستَكبَرتُم ۖ إِنَّ اللَّهَ لا يَهدِي القَومَ الظّالِمينَ",
    "وَقالَ الَّذينَ كَفَروا لِلَّذينَ آمَنوا لَو كانَ خَيرًا ما سَبَقونا إِلَيهِ ۚ وَإِذ لَم يَهتَدوا بِهِ فَسَيَقولونَ هٰذا إِفكٌ قَديمٌ",
    "وَمِن قَبلِهِ كِتابُ موسىٰ إِمامًا وَرَحمَةً ۚ وَهٰذا كِتابٌ مُصَدِّقٌ لِسانًا عَرَبِيًّا لِيُنذِرَ الَّذينَ ظَلَموا وَبُشرىٰ لِلمُحسِنينَ",
    "إِنَّ الَّذينَ قالوا رَبُّنَا اللَّهُ ثُمَّ استَقاموا فَلا خَوفٌ عَلَيهِم وَلا هُم يَحزَنونَ",
    "أُولٰئِكَ أَصحابُ الجَنَّةِ خالِدينَ فيها جَزاءً بِما كانوا يَعمَلونَ",
    "وَوَصَّينَا الإِنسانَ بِوالِدَيهِ إِحسانًا ۖ حَمَلَتهُ أُمُّهُ كُرهًا وَوَضَعَتهُ كُرهًا ۖ وَحَملُهُ وَفِصالُهُ ثَلاثونَ شَهرًا ۚ حَتّىٰ إِذا بَلَغَ أَشُدَّهُ وَبَلَغَ أَربَعينَ سَنَةً قالَ رَبِّ أَوزِعني أَن أَشكُرَ نِعمَتَكَ الَّتي أَنعَمتَ عَلَيَّ وَعَلىٰ والِدَيَّ وَأَن أَعمَلَ صالِحًا تَرضاهُ وَأَصلِح لي في ذُرِّيَّتي ۖ إِنّي تُبتُ إِلَيكَ وَإِنّي مِنَ المُسلِمينَ",
    "أُولٰئِكَ الَّذينَ نَتَقَبَّلُ عَنهُم أَحسَنَ ما عَمِلوا وَنَتَجاوَزُ عَن سَيِّئَاتِهِم في أَصحابِ الجَنَّةِ ۖ وَعدَ الصِّدقِ الَّذي كانوا يوعَدونَ",
    "وَالَّذي قالَ لِوالِدَيهِ أُفٍّ لَكُما أَتَعِدانِني أَن أُخرَجَ وَقَد خَلَتِ القُرونُ مِن قَبلي وَهُما يَستَغيثانِ اللَّهَ وَيلَكَ آمِن إِنَّ وَعدَ اللَّهِ حَقٌّ فَيَقولُ ما هٰذا إِلّا أَساطيرُ الأَوَّلينَ",
    "أُولٰئِكَ الَّذينَ حَقَّ عَلَيهِمُ القَولُ في أُمَمٍ قَد خَلَت مِن قَبلِهِم مِنَ الجِنِّ وَالإِنسِ ۖ إِنَّهُم كانوا خاسِرينَ",
    "وَلِكُلٍّ دَرَجاتٌ مِمّا عَمِلوا ۖ وَلِيُوَفِّيَهُم أَعمالَهُم وَهُم لا يُظلَمونَ",
    "وَيَومَ يُعرَضُ الَّذينَ كَفَروا عَلَى النّارِ أَذهَبتُم طَيِّباتِكُم في حَياتِكُمُ الدُّنيا وَاستَمتَعتُم بِها فَاليَومَ تُجزَونَ عَذابَ الهونِ بِما كُنتُم تَستَكبِرونَ فِي الأَرضِ بِغَيرِ الحَقِّ وَبِما كُنتُم تَفسُقونَ",
    "۞ وَاذكُر أَخا عادٍ إِذ أَنذَرَ قَومَهُ بِالأَحقافِ وَقَد خَلَتِ النُّذُرُ مِن بَينِ يَدَيهِ وَمِن خَلفِهِ أَلّا تَعبُدوا إِلَّا اللَّهَ إِنّي أَخافُ عَلَيكُم عَذابَ يَومٍ عَظيمٍ",
    "قالوا أَجِئتَنا لِتَأفِكَنا عَن آلِهَتِنا فَأتِنا بِما تَعِدُنا إِن كُنتَ مِنَ الصّادِقينَ",
    "قالَ إِنَّمَا العِلمُ عِندَ اللَّهِ وَأُبَلِّغُكُم ما أُرسِلتُ بِهِ وَلٰكِنّي أَراكُم قَومًا تَجهَلونَ",
    "فَلَمّا رَأَوهُ عارِضًا مُستَقبِلَ أَودِيَتِهِم قالوا هٰذا عارِضٌ مُمطِرُنا ۚ بَل هُوَ مَا استَعجَلتُم بِهِ ۖ ريحٌ فيها عَذابٌ أَليمٌ",
    "تُدَمِّرُ كُلَّ شَيءٍ بِأَمرِ رَبِّها فَأَصبَحوا لا يُرىٰ إِلّا مَساكِنُهُم ۚ كَذٰلِكَ نَجزِي القَومَ المُجرِمينَ",
    "وَلَقَد مَكَّنّاهُم فيما إِن مَكَّنّاكُم فيهِ وَجَعَلنا لَهُم سَمعًا وَأَبصارًا وَأَفئِدَةً فَما أَغنىٰ عَنهُم سَمعُهُم وَلا أَبصارُهُم وَلا أَفئِدَتُهُم مِن شَيءٍ إِذ كانوا يَجحَدونَ بِآياتِ اللَّهِ وَحاقَ بِهِم ما كانوا بِهِ يَستَهزِئونَ",
    "وَلَقَد أَهلَكنا ما حَولَكُم مِنَ القُرىٰ وَصَرَّفنَا الآياتِ لَعَلَّهُم يَرجِعونَ",
    "فَلَولا نَصَرَهُمُ الَّذينَ اتَّخَذوا مِن دونِ اللَّهِ قُربانًا آلِهَةً ۖ بَل ضَلّوا عَنهُم ۚ وَذٰلِكَ إِفكُهُم وَما كانوا يَفتَرونَ",
    "وَإِذ صَرَفنا إِلَيكَ نَفَرًا مِنَ الجِنِّ يَستَمِعونَ القُرآنَ فَلَمّا حَضَروهُ قالوا أَنصِتوا ۖ فَلَمّا قُضِيَ وَلَّوا إِلىٰ قَومِهِم مُنذِرينَ",
    "قالوا يا قَومَنا إِنّا سَمِعنا كِتابًا أُنزِلَ مِن بَعدِ موسىٰ مُصَدِّقًا لِما بَينَ يَدَيهِ يَهدي إِلَى الحَقِّ وَإِلىٰ طَريقٍ مُستَقيمٍ",
    "يا قَومَنا أَجيبوا داعِيَ اللَّهِ وَآمِنوا بِهِ يَغفِر لَكُم مِن ذُنوبِكُم وَيُجِركُم مِن عَذابٍ أَليمٍ",
    "وَمَن لا يُجِب داعِيَ اللَّهِ فَلَيسَ بِمُعجِزٍ فِي الأَرضِ وَلَيسَ لَهُ مِن دونِهِ أَولِياءُ ۚ أُولٰئِكَ في ضَلالٍ مُبينٍ",
    "أَوَلَم يَرَوا أَنَّ اللَّهَ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ وَلَم يَعيَ بِخَلقِهِنَّ بِقادِرٍ عَلىٰ أَن يُحيِيَ المَوتىٰ ۚ بَلىٰ إِنَّهُ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "وَيَومَ يُعرَضُ الَّذينَ كَفَروا عَلَى النّارِ أَلَيسَ هٰذا بِالحَقِّ ۖ قالوا بَلىٰ وَرَبِّنا ۚ قالَ فَذوقُوا العَذابَ بِما كُنتُم تَكفُرونَ",
    "فَاصبِر كَما صَبَرَ أُولُو العَزمِ مِنَ الرُّسُلِ وَلا تَستَعجِل لَهُم ۚ كَأَنَّهُم يَومَ يَرَونَ ما يوعَدونَ لَم يَلبَثوا إِلّا ساعَةً مِن نَهارٍ ۚ بَلاغٌ ۚ فَهَل يُهلَكُ إِلَّا القَومُ الفاسِقونَ"
  ]
}