{
  "id": 48,
  "name": "الفتح",
  "transliteration": "Al-Fath",
  "translation": "The Victory",
  "verses": [
    "إِنّا فَتَحنا لَكَ فَتحًا مُبينًا",
    "لِيَغفِرَ لَكَ اللَّهُ ما تَقَدَّمَ مِن ذَنبِكَ وَما تَأَخَّرَ وَيُتِمَّ نِعمَتَهُ عَلَيكَ وَيَهدِيَكَ صِراطًا مُستَقيمًا",
    "وَيَنصُرَكَ اللَّهُ نَصرًا عَزيزًا",
    "هُوَ الَّذي أَنزَلَ السَّكينَةَ في قُلوبِ المُؤمِنينَ لِيَزدادوا إيمانًا مَعَ إيمانِهِم ۗ وَلِلَّهِ جُنودُ السَّماواتِ وَالأَرضِ ۚ وَكانَ اللَّهُ عَليمًا حَكيمًا",
    "لِيُدخِلَ المُؤمِنينَ وَالمُؤمِناتِ جَنّاتٍ تَجري مِن تَحتِهَا الأَنهارُ خالِدينَ فيها وَيُكَفِّرَ عَنهُم سَيِّئَاتِهِم ۚ وَكانَ ذٰلِكَ عِندَ اللَّهِ فَوزًا عَظيمًا",
    "وَيُعَذِّبَ المُنافِقينَ وَالمُنافِقاتِ وَالمُشرِكينَ وَالمُشرِكاتِ الظّانّينَ بِاللَّهِ ظَنَّ السَّوءِ ۚ عَلَيهِم دائِرَةُ السَّوءِ ۖ وَغَضِبَ اللَّهُ عَلَيهِم وَلَعَنَهُم وَأَعَدَّ لَهُم جَهَنَّمَ ۖ وَساءَت مَصيرًا",
    "وَلِلَّهِ جُنودُ السَّماواتِ وَالأَرضِ ۚ وَكانَ اللَّهُ عَزيزًا حَكيمًا",
    "إِنّا أَرسَلناكَ شاهِدًا وَمُبَشِّرًا وَنَذيرًا",
    "لِتُؤمِنوا بِاللَّهِ وَرَسولِهِ وَتُعَزِّروهُ وَتُوَقِّروهُ وَتُسَبِّحوهُ بُكرَةً وَأَصيلًا",
    "إِنَّ الَّذينَ يُبايِعونَكَ إِنَّما يُبايِعونَ اللَّهَ يَدُ اللَّهِ فَوقَ أَيديهِم ۚ فَمَن نَكَثَ فَإِنَّما يَنكُثُ عَلىٰ نَفسِهِ ۖ وَمَن أَوفىٰ بِما عاهَدَ عَلَيهُ اللَّهَ فَسَيُؤتيهِ أَجرًا عَظيمًا",
    "سَيَقولُ لَكَ المُخَلَّفونَ مِنَ الأَعرابِ شَغَلَتنا أَموالُنا وَأَهلونا فَاستَغفِر لَنا ۚ يَقولونَ بِأَلسِنَتِهِم ما لَيسَ في قُلوبِهِم ۚ قُل فَمَن يَملِكُ لَكُم مِنَ اللَّهِ شَيئًا إِن أَرادَ بِكُم ضَرًّا أَو أَرادَ بِكُم نَفعًا ۚ بَل كانَ اللَّهُ بِما تَعمَلونَ خَبيرًا",
    "بَل ظَنَنتُم أَن لَن يَنقَلِبَ الرَّسولُ وَالمُؤمِنونَ إِلىٰ أَهليهِم أَبَدًا وَزُيِّنَ ذٰلِكَ في قُلوبِكُم وَظَنَنتُم ظَنَّ السَّوءِ وَكُنتُم قَومًا بورًا",
    "وَمَن لَم يُؤمِن بِاللَّهِ وَرَسولِهِ فَإِنّا أَعتَدنا لِلكافِرينَ سَعيرًا",
    "وَلِلَّهِ مُلكُ السَّماواتِ وَالأَرضِ ۚ يَغفِرُ لِمَن يَشاءُ وَيُعَذِّبُ مَن يَشاءُ ۚ وَكانَ اللَّهُ غَفورًا رَحيمًا",
    "سَيَقولُ المُخَلَّفونَ إِذَا انطَلَقتُم إِلىٰ مَغانِمَ لِتَأخُذوها ذَرونا نَتَّبِعكُم ۖ يُريدونَ أَن يُبَدِّلوا كَلامَ اللَّهِ ۚ قُل لَن تَتَّبِعونا كَذٰلِكُم قالَ اللَّهُ مِن قَبلُ ۖ فَسَيَقولونَ بَل تَحسُدونَنا ۚ بَل كانوا لا يَفقَهونَ إِلّا قَليلًا",
    "قُل لِلمُخَلَّفينَ مِنَ الأَعرابِ سَتُدعَونَ إِلىٰ قَومٍ أُولي بَأسٍ شَديدٍ تُقاتِلونَهُم أَو يُسلِمونَ ۖ فَإِن تُطيعوا يُؤتِكُمُ اللَّهُ أَجرًا حَسَنًا ۖ وَإِن تَتَوَلَّوا كَما تَوَلَّيتُم مِن قَبلُ يُعَذِّبكُم عَذابًا أَليمًا",
    "لَيسَ عَلَى الأَعمىٰ حَرَجٌ وَلا عَلَى الأَعرَجِ حَرَجٌ وَلا عَلَى المَريضِ حَرَجٌ ۗ وَمَن يُطِعِ اللَّهَ وَرَسولَهُ يُدخِلهُ جَنّاتٍ تَجري مِن تَحتِهَا الأَنهارُ ۖ وَمَن يَتَوَلَّ يُعَذِّبهُ عَذابًا أَليمًا",
    "۞ لَقَد رَضِيَ اللَّهُ عَنِ المُؤمِنينَ إِذ يُبايِعونَكَ تَحتَ الشَّجَرَةِ فَعَلِمَ ما في قُلوبِهِم فَأَنزَلَ السَّكينَةَ عَلَيهِم وَأَثابَهُم فَتحًا قَريبًا",
    "وَمَغانِمَ كَثيرَةً يَأخُذونَها ۗ وَكانَ اللَّهُ عَزيزًا حَكيمًا",
    "وَعَدَكُمُ اللَّهُ مَغانِمَ كَثيرَةً تَأخُذونَها فَعَجَّلَ لَكُم هٰذِهِ وَكَفَّ أَيدِيَ النّاسِ عَنكُم وَلِتَكونَ آيَةً لِلمُؤمِنينَ وَيَهدِيَكُم صِراطًا مُستَقيمًا",
    "وَأُخرىٰ لَم تَقدِروا عَلَيها قَد أَحاطَ اللَّهُ بِها ۚ وَكانَ اللَّهُ عَلىٰ كُلِّ شَيءٍ قَديرًا",
    "وَلَو قاتَلَكُمُ الَّذينَ كَفَروا لَوَلَّوُا الأَدبارَ ثُمَّ لا يَجِدونَ وَلِيًّا وَلا نَصيرًا",
    "سُنَّةَ اللَّهِ الَّتي قَد خَلَت مِن قَبلُ ۖ وَلَن تَجِدَ لِسُنَّةِ اللَّهِ تَبديلًا",
    "وَهُوَ الَّذي كَفَّ أَيدِيَهُم عَنكُم وَأَيدِيَكُم عَنهُم بِبَطنِ مَكَّةَ مِن بَعدِ أَن أَظفَرَكُم عَلَيهِم ۚ وَكانَ اللَّهُ بِما تَعمَلونَ بَصيرًا",
    "هُمُ الَّذينَ كَفَروا وَصَدّوكُم عَنِ المَسجِدِ الحَرامِ وَالهَديَ مَعكوفًا أَن يَبلُغَ مَحِلَّهُ ۚ وَلَولا رِجالٌ مُؤمِنونَ وَنِساءٌ مُؤمِناتٌ لَم تَعلَموهُم أَن تَطَئوهُم فَتُصيبَكُم مِنهُم مَعَرَّةٌ بِغَيرِ عِلمٍ ۖ لِيُدخِلَ اللَّهُ في رَحمَتِهِ مَن يَشاءُ ۚ لَو تَزَيَّلوا لَعَذَّبنَا الَّذينَ كَفَروا مِنهُم عَذابًا أَليمًا",
    "إِذ جَعَلَ الَّذينَ كَفَروا في قُلوبِهِمُ الحَمِيَّةَ حَمِيَّةَ الجاهِلِيَّةِ فَأَنزَلَ اللَّهُ سَكينَتَهُ عَلىٰ رَسولِهِ وَعَلَى المُؤمِنينَ وَأَلزَمَهُم كَلِمَةَ التَّقوىٰ وَكانوا أَحَقَّ بِها وَأَهلَها ۚ وَكانَ اللَّهُ بِكُلِّ شَيءٍ عَليمًا",
    "لَقَد صَدَقَ اللَّهُ رَسولَهُ الرُّؤيا بِالحَقِّ ۖ لَتَدخُلُنَّ المَسجِدَ الحَرامَ إِن شاءَ اللَّهُ آمِنينَ مُحَلِّقينَ رُءوسَكُم وَمُقَصِّرينَ لا تَخافونَ ۖ فَعَلِمَ ما لَم تَعلَموا فَجَعَلَ مِن دونِ ذٰلِكَ فَتحًا قَريبًا",
    "هُوَ الَّذي أَرسَلَ رَسولَهُ بِالهُدىٰ وَدينِ الحَقِّ لِيُظهِرَهُ عَلَى الدّينِ كُلِّهِ ۚ وَكَفىٰ بِاللَّهِ شَهيدًا",
    "مُحَمَّدٌ رَسولُ اللَّهِ ۚ وَالَّذينَ مَعَهُ أَشِدّاءُ عَلَى الكُفّارِ رُحَماءُ بَينَهُم ۖ تَراهُم رُكَّعًا سُجَّدًا يَبتَغونَ فَضلًا مِنَ اللَّهِ وَرِضوانًا ۖ سيماهُم في وُجوهِهِم مِن أَثَرِ السُّجودِ ۚ ذٰلِكَ مَثَلُهُم فِي التَّوراةِ ۚ وَمَثَلُهُم فِي الإِنجيلِ كَزَرعٍ أَخرَجَ شَطأَهُ فَآزَرَهُ فَاستَغلَظَ فَاستَوىٰ عَلىٰ سوقِهِ يُعجِبُ الزُّرّاعَ لِيَغيظَ بِهِمُ الكُفّارَ ۗ وَعَدَ اللَّهُ الَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ مِنهُم مَغفِرَةً وَأَجرًا عَظيمًا"
  ]
}