{
  "id": 6,
  "name": "الأنعام",
  "transliteration": "Al-An'am",
  "translation": "The Cattle",
  "verses": [
    "الحَمدُ لِلَّهِ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ وَجَعَلَ الظُّلُماتِ وَالنّورَ ۖ ثُمَّ الَّذينَ كَفَروا بِرَبِّهِم يَعدِلونَ",
    "هُوَ الَّذي خَلَقَكُم مِن طينٍ ثُمَّ قَضىٰ أَجَلًا ۖ وَأَجَلٌ مُسَمًّى عِندَهُ ۖ ثُمَّ أَنتُم تَمتَرونَ",
    "وَهُوَ اللَّهُ فِي السَّماواتِ وَفِي الأَرضِ ۖ يَعلَمُ سِرَّكُم وَجَهرَكُم وَيَعلَمُ ما تَكسِبونَ",
    "وَما تَأتيهِم مِن آيَةٍ مِن آياتِ رَبِّهِم إِلّا كانوا عَنها مُعرِضينَ",
    "فَقَد كَذَّبوا بِالحَقِّ لَمّا جاءَهُم ۖ فَسَوفَ يَأتيهِم أَنباءُ ما كانوا بِهِ يَستَهزِئونَ",
    "أَلَم يَرَوا كَم أَهلَكنا مِن قَبلِهِم مِن قَرنٍ مَكَّنّاهُم فِي الأَرضِ ما لَم نُمَكِّن لَكُم وَأَرسَلنَا السَّماءَ عَلَيهِم مِدرارًا وَجَعَلنَا الأَنهارَ تَجري مِن تَحتِهِم فَأَهلَكناهُم بِذُنوبِهِم وَأَنشَأنا مِن بَعدِهِم قَرنًا آخَرينَ",
    "وَلَو نَزَّلنا عَلَيكَ كِتابًا في قِرطاسٍ فَلَمَسوهُ بِأَيديهِم لَقالَ الَّذينَ كَفَروا إِن هٰذا إِلّا سِحرٌ مُبينٌ",
    "وَقالوا لَولا أُنزِلَ عَلَيهِ مَلَكٌ ۖ وَلَو أَنزَلنا مَلَكًا لَقُضِيَ الأَمرُ ثُمَّ لا يُنظَرونَ",
    "وَلَو جَعَلناهُ مَلَكًا لَجَعَلناهُ رَجُلًا وَلَلَبَسنا عَلَيهِم ما يَلبِسونَ",
    "وَلَقَدِ استُهزِئَ بِرُسُلٍ مِن قَبلِكَ فَحاقَ بِالَّذينَ سَخِروا مِنهُم ما كانوا بِهِ يَستَهزِئونَ",
    "قُل سيروا فِي الأَرضِ ثُمَّ انظُروا كَيفَ كانَ عاقِبَةُ المُكَذِّبينَ",
    "قُل لِمَن ما فِي السَّماواتِ وَالأَرضِ ۖ قُل لِلَّهِ ۚ كَتَبَ عَلىٰ نَفسِهِ الرَّحمَةَ ۚ لَيَجمَعَنَّكُم إِلىٰ يَومِ القِيامَةِ لا رَيبَ فيهِ ۚ الَّذينَ خَسِروا أَنفُسَهُم فَهُم لا يُؤمِنونَ",
    "۞ وَلَهُ ما سَكَنَ فِي اللَّيلِ وَالنَّهارِ ۚ وَهُوَ السَّميعُ العَليمُ",
    "قُل أَغَيرَ اللَّهِ أَتَّخِذُ وَلِيًّا فاطِرِ السَّماواتِ وَالأَرضِ وَهُوَ يُطعِمُ وَلا يُطعَمُ ۗ قُل إِنّي أُمِرتُ أَن أَكونَ أَوَّلَ مَن أَسلَمَ ۖ وَلا تَكونَنَّ مِنَ المُشرِكينَ",
    "قُل إِنّي أَخافُ إِن عَصَيتُ رَبّي عَذابَ يَومٍ عَظيمٍ",
    "مَن يُصرَف عَنهُ يَومَئِذٍ فَقَد رَحِمَهُ ۚ وَذٰلِكَ الفَوزُ المُبينُ",
    "وَإِن يَمسَسكَ اللَّهُ بِضُرٍّ فَلا كاشِفَ لَهُ إِلّا هُوَ ۖ وَإِن يَمسَسكَ بِخَيرٍ فَهُوَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
    "وَهُوَ القاهِرُ فَوقَ عِبادِهِ ۚ وَهُوَ الحَكيمُ الخَبيرُ",
    "قُل أَيُّ شَيءٍ أَكبَرُ شَهادَةً ۖ قُلِ اللَّهُ ۖ شَهيدٌ بَيني وَبَينَكُم ۚ وَأوحِيَ إِلَيَّ هٰذَا القُرآنُ لِأُنذِرَكُم بِهِ وَمَن بَلَغَ ۚ أَئِنَّكُم لَتَشهَدونَ أَنَّ مَعَ اللَّهِ آلِهَةً أُخرىٰ ۚ قُل لا أَشهَدُ ۚ قُل إِنَّما هُوَ إِلٰهٌ واحِدٌ وَإِنَّني بَريءٌ مِمّا تُشرِكونَ",
    "الَّذينَ آتَيناهُمُ الكِتابَ يَعرِفونَهُ كَما يَعرِفونَ أَبناءَهُمُ ۘ الَّذينَ خَسِروا أَنفُسَهُم فَهُم لا يُؤمِنونَ",
    "وَمَن أَظلَمُ مِمَّنِ افتَرىٰ عَلَى اللَّهِ كَذِبًا أَو كَذَّبَ بِآياتِهِ ۗ إِنَّهُ لا يُفلِحُ الظّالِمونَ",
    "وَيَومَ نَحشُرُهُم جَميعًا ثُمَّ نَقولُ لِلَّذينَ أَشرَكوا أَينَ شُرَكاؤُكُمُ الَّذينَ كُنتُم تَزعُمونَ",
    "ثُمَّ لَم تَكُن فِتنَتُهُم إِلّا أَن قالوا وَاللَّهِ رَبِّنا ما كُنّا مُشرِكينَ",
    "انظُر كَيفَ كَذَبوا عَلىٰ أَنفُسِهِم ۚ وَضَلَّ عَنهُم ما كانوا يَفتَرونَ",
    "وَمِنهُم مَن يَستَمِعُ إِلَيكَ ۖ وَجَعَلنا عَلىٰ قُلوبِهِم أَكِنَّةً أَن يَفقَهوهُ وَفي آذانِهِم وَقرًا ۚ وَإِن يَرَوا كُلَّ آيَةٍ لا يُؤمِنوا بِها ۚ حَتّىٰ إِذا جاءوكَ يُجادِلونَكَ يَقولُ الَّذينَ كَفَروا إِن هٰذا إِلّا أَساطيرُ الأَوَّلينَ",
    "وَهُم يَنهَونَ عَنهُ وَيَنأَونَ عَنهُ ۖ وَإِن يُهلِكونَ إِلّا أَنفُسَهُم وَما يَشعُرونَ",
    "وَلَو تَرىٰ إِذ وُقِفوا عَلَى النّارِ فَقالوا يا لَيتَنا نُرَدُّ وَلا نُكَذِّبَ بِآياتِ رَبِّنا وَنَكونَ مِنَ المُؤمِنينَ",
    "بَل بَدا لَهُم ما كانوا يُخفونَ مِن قَبلُ ۖ وَلَو رُدّوا لَعادوا لِما نُهوا عَنهُ وَإِنَّهُم لَكاذِبونَ",
    "وَقالوا إِن هِيَ إِلّا حَياتُنَا الدُّنيا وَما نَحنُ بِمَبعوثينَ",
    "وَلَو تَرىٰ إِذ وُقِفوا عَلىٰ رَبِّهِم ۚ قالَ أَلَيسَ هٰذا بِالحَقِّ ۚ قالوا بَلىٰ وَرَبِّنا ۚ قالَ فَذوقُوا العَذابَ بِما كُنتُم تَكفُرونَ",
    "قَد خَسِرَ الَّذينَ كَذَّبوا بِلِقاءِ اللَّهِ ۖ حَتّىٰ إِذا جاءَتهُمُ السّاعَةُ بَغتَةً قالوا يا حَسرَتَنا عَلىٰ ما فَرَّطنا فيها وَهُم يَحمِلونَ أَوزارَهُم عَلىٰ ظُهورِهِم ۚ أَلا ساءَ ما يَزِرونَ",
    "وَمَا الحَياةُ الدُّنيا إِلّا لَعِبٌ وَلَهوٌ ۖ وَلَلدّارُ الآخِرَةُ خَيرٌ لِلَّذينَ يَتَّقونَ ۗ أَفَلا تَعقِلونَ",
    "قَد نَعلَمُ إِنَّهُ لَيَحزُنُكَ الَّذي يَقولونَ ۖ فَإِنَّهُم لا يُكَذِّبونَكَ وَلٰكِنَّ الظّالِمينَ بِآياتِ اللَّهِ يَجحَدونَ",
    "وَلَقَد كُذِّبَت رُسُلٌ مِن قَبلِكَ فَصَبَروا عَلىٰ ما كُذِّبوا وَأوذوا حَتّىٰ أَتاهُم نَصرُنا ۚ وَلا مُبَدِّلَ لِكَلِماتِ اللَّهِ ۚ وَلَقَد جاءَكَ مِن نَبَإِ المُرسَلينَ",
    "وَإِن كانَ كَبُرَ عَلَيكَ إِعراضُهُم فَإِنِ استَطَعتَ أَن تَبتَغِيَ نَفَقًا فِي الأَرضِ أَو سُلَّمًا فِي السَّماءِ فَتَأتِيَهُم بِآيَةٍ ۚ وَلَو شاءَ اللَّهُ لَجَمَعَهُم عَلَى الهُدىٰ ۚ فَلا تَكونَنَّ مِنَ الجاهِلينَ",
    "۞ إِنَّما يَستَجيبُ الَّذينَ يَسمَعونَ ۘ وَالمَوتىٰ يَبعَثُهُمُ اللَّهُ ثُمَّ إِلَيهِ يُرجَعونَ",
    "وَقالوا لَولا نُزِّلَ عَلَيهِ آيَةٌ مِن رَبِّهِ ۚ قُل إِنَّ اللَّهَ قادِرٌ عَلىٰ أَن يُنَزِّلَ آيَةً وَلٰكِنَّ أَكثَرَهُم لا يَعلَمونَ",
    "وَما مِن دابَّةٍ فِي الأَرضِ وَلا طائِرٍ يَطيرُ بِجَناحَيهِ إِلّا أُمَمٌ أَمثالُكُم ۚ ما فَرَّطنا فِي الكِتابِ مِن شَيءٍ ۚ ثُمَّ إِلىٰ رَبِّهِم يُحشَرونَ",
    "وَالَّذينَ كَذَّبوا بِآياتِنا صُمٌّ وَبُكمٌ فِي الظُّلُماتِ ۗ مَن يَشَإِ اللَّهُ يُضلِلهُ وَمَن يَشَأ يَجعَلهُ عَلىٰ صِراطٍ مُستَقيمٍ",
    "قُل أَرَأَيتَكُم إِن أَتاكُم عَذابُ اللَّهِ أَو أَتَتكُمُ السّاعَةُ أَغَيرَ اللَّهِ تَدعونَ إِن كُنتُم صادِقينَ",
    "بَل إِيّاهُ تَدعونَ فَيَكشِفُ ما تَدعونَ إِلَيهِ إِن شاءَ وَتَنسَونَ ما تُشرِكونَ",
    "وَلَقَد أَرسَلنا إِلىٰ أُمَمٍ مِن قَبلِكَ فَأَخَذناهُم بِالبَأساءِ وَالضَّرّاءِ لَعَلَّهُم يَتَضَرَّعونَ",
    "فَلَولا إِذ جاءَهُم بَأسُنا تَضَرَّعوا وَلٰكِن قَسَت قُلوبُهُم وَزَيَّنَ لَهُمُ الشَّيطانُ ما كانوا يَعمَلونَ",
    "فَلَمّا نَسوا ما ذُكِّروا بِهِ فَتَحنا عَلَيهِم أَبوابَ كُلِّ شَيءٍ حَتّىٰ إِذا فَرِحوا بِما أوتوا أَخَذناهُم بَغتَةً فَإِذا هُم مُبلِسونَ",
    "فَقُطِعَ دابِرُ القَومِ الَّذينَ ظَلَموا ۚ وَالحَمدُ لِلَّهِ رَبِّ العالَمينَ",
    "قُل أَرَأَيتُم إِن أَخَذَ اللَّهُ سَمعَكُم وَأَبصارَكُم وَخَتَمَ عَلىٰ قُلوبِكُم مَن إِلٰهٌ غَيرُ اللَّهِ يَأتيكُم بِهِ ۗ انظُر كَيفَ نُصَرِّفُ الآياتِ ثُمَّ هُم يَصدِفونَ",
    "قُل أَرَأَيتَكُم إِن أَتاكُم عَذابُ اللَّهِ بَغتَةً أَو جَهرَةً هَل يُهلَكُ إِلَّا القَومُ الظّالِمونَ",
    "وَما نُرسِلُ المُرسَلينَ إِلّا مُبَشِّرينَ وَمُنذِرينَ ۖ فَمَن آمَنَ وَأَصلَحَ فَلا خَوفٌ عَلَيهِم وَلا هُم يَحزَنونَ",
    "وَالَّذينَ كَذَّبوا بِآياتِنا يَمَسُّهُمُ العَذابُ بِما كانوا يَفسُقونَ",
    "قُل لا أَقولُ لَكُم عِندي خَزائِنُ اللَّهِ وَلا أَعلَمُ الغَيبَ وَلا أَقولُ لَكُم إِنّي مَلَكٌ ۖ إِن أَتَّبِعُ إِلّا ما يوحىٰ إِلَيَّ ۚ قُل هَل يَستَوِي الأَعمىٰ وَالبَصيرُ ۚ أَفَلا تَتَفَكَّرونَ",
    "وَأَنذِر بِهِ الَّذينَ يَخافونَ أَن يُحشَروا إِلىٰ رَبِّهِم ۙ لَيسَ لَهُم مِن دونِهِ وَلِيٌّ وَلا شَفيعٌ لَعَلَّهُم يَتَّقونَ",
    "وَلا تَطرُدِ الَّذينَ يَدعونَ رَبَّهُم بِالغَداةِ وَالعَشِيِّ يُريدونَ وَجهَهُ ۖ ما عَلَيكَ مِن حِسابِهِم مِن شَيءٍ وَما مِن حِسابِكَ عَلَيهِم مِن شَيءٍ فَتَطرُدَهُم فَتَكونَ مِنَ الظّالِمينَ",
    "وَكَذٰلِكَ فَتَنّا بَعضَهُم بِبَعضٍ لِيَقولوا أَهٰؤُلاءِ مَنَّ اللَّهُ عَلَيهِم مِن بَينِنا ۗ أَلَيسَ اللَّهُ بِأَعلَمَ بِالشّاكِرينَ",
    "وَإِذا جاءَكَ الَّذينَ يُؤمِنونَ بِآياتِنا فَقُل سَلامٌ عَلَيكُم ۖ كَتَبَ رَبُّكُم عَلىٰ نَفسِهِ الرَّحمَةَ ۖ أَنَّهُ مَن عَمِلَ مِنكُم سوءًا بِجَهالَةٍ ثُمَّ تابَ مِن بَعدِهِ وَأَصلَحَ فَأَنَّهُ غَفورٌ رَحيمٌ",
    "وَكَذٰلِكَ نُفَصِّلُ الآياتِ وَلِتَستَبينَ سَبيلُ المُجرِمينَ",
    "قُل إِنّي نُهيتُ أَن أَعبُدَ الَّذينَ تَدعونَ مِن دونِ اللَّهِ ۚ قُل لا أَتَّبِعُ أَهواءَكُم ۙ قَد ضَلَلتُ إِذًا وَما أَنا مِنَ المُهتَدينَ",
    "قُل إِنّي عَلىٰ بَيِّنَةٍ مِن رَبّي وَكَذَّبتُم بِهِ ۚ ما عِندي ما تَستَعجِلونَ بِهِ ۚ إِنِ الحُكمُ إِلّا لِلَّهِ ۖ يَقُصُّ الحَقَّ ۖ وَهُوَ خَيرُ الفاصِلينَ",
    "قُل لَو أَنَّ عِندي ما تَستَعجِلونَ بِهِ لَقُضِيَ الأَمرُ بَيني وَبَينَكُم ۗ وَاللَّهُ أَعلَمُ بِالظّالِمينَ",
    "۞ وَعِندَهُ مَفاتِحُ الغَيبِ لا يَعلَمُها إِلّا هُوَ ۚ وَيَعلَمُ ما فِي البَرِّ وَالبَحرِ ۚ وَما تَسقُطُ مِن وَرَقَةٍ إِلّا يَعلَمُها وَلا حَبَّةٍ في ظُلُماتِ الأَرضِ وَلا رَطبٍ وَلا يابِسٍ إِلّا في كِتابٍ مُبينٍ",
    "وَهُوَ الَّذي يَتَوَفّاكُم بِاللَّيلِ وَيَعلَمُ ما جَرَحتُم بِالنَّهارِ ثُمَّ يَبعَثُكُم فيهِ لِيُقضىٰ أَجَلٌ مُسَمًّى ۖ ثُمَّ إِلَيهِ مَرجِعُكُم ثُمَّ يُنَبِّئُكُم بِما كُنتُم تَعمَلونَ",
    "وَهُوَ القاهِرُ فَوقَ عِبادِهِ ۖ وَيُرسِلُ عَلَيكُم حَفَظَةً حَتّىٰ إِذا جاءَ أَحَدَكُمُ المَوتُ تَوَفَّتهُ رُسُلُنا وَهُم لا يُفَرِّطونَ",
    "ثُمَّ رُدّوا إِلَى اللَّهِ مَولاهُمُ الحَقِّ ۚ أَلا لَهُ الحُكمُ وَهُوَ أَسرَعُ الحاسِبينَ",
    "قُل مَن يُنَجّيكُم مِن ظُلُماتِ البَرِّ وَالبَحرِ تَدعونَهُ تَضَرُّعًا وَخُفيَةً لَئِن أَنجانا مِن هٰذِهِ لَنَكونَنَّ مِنَ الشّاكِرينَ",
    "قُلِ اللَّهُ يُنَجّيكُم مِنها وَمِن كُلِّ كَربٍ ثُمَّ أَنتُم تُشرِكونَ",
    "قُل هُوَ القادِرُ عَلىٰ أَن يَبعَثَ عَلَيكُم عَذابًا مِن فَوقِكُم أَو مِن تَحتِ أَرجُلِكُم أَو يَلبِسَكُم شِيَعًا وَيُذيقَ بَعضَكُم بَأسَ بَعضٍ ۗ انظُر كَيفَ نُصَرِّفُ الآياتِ لَعَلَّهُم يَفقَهونَ",
    "وَكَذَّبَ بِهِ قَومُكَ وَهُوَ الحَقُّ ۚ قُل لَستُ عَلَيكُم بِوَكيلٍ",
    "لِكُلِّ نَبَإٍ مُستَقَرٌّ ۚ وَسَوفَ تَعلَمونَ",
    "وَإِذا رَأَيتَ الَّذينَ يَخوضونَ في آياتِنا فَأَعرِض عَنهُم حَتّىٰ يَخوضوا في حَديثٍ غَيرِهِ ۚ وَإِمّا يُنسِيَنَّكَ الشَّيطانُ فَلا تَقعُد بَعدَ الذِّكرىٰ مَعَ القَومِ الظّالِمينَ",
    "وَما عَلَى الَّذينَ يَتَّقونَ مِن حِسابِهِم مِن شَيءٍ وَلٰكِن ذِكرىٰ لَعَلَّهُم يَتَّقونَ",
    "وَذَرِ الَّذينَ اتَّخَذوا دينَهُم لَعِبًا وَلَهوًا وَغَرَّتهُمُ الحَياةُ الدُّنيا ۚ وَذَكِّر بِهِ أَن تُبسَلَ نَفسٌ بِما كَسَبَت لَيسَ لَها مِن دونِ اللَّهِ وَلِيٌّ وَلا شَفيعٌ وَإِن تَعدِل كُلَّ عَدلٍ لا يُؤخَذ مِنها ۗ أُولٰئِكَ الَّذينَ أُبسِلوا بِما كَسَبوا ۖ لَهُم شَرابٌ مِن حَميمٍ وَعَذابٌ أَليمٌ بِما كانوا يَكفُرونَ",
    "قُل أَنَدعو مِن دونِ اللَّهِ ما لا يَنفَعُنا وَلا يَضُرُّنا وَنُرَدُّ عَلىٰ أَعقابِنا بَعدَ إِذ هَدانَا اللَّهُ كَالَّذِي استَهوَتهُ الشَّياطينُ فِي الأَرضِ حَيرانَ لَهُ أَصحابٌ يَدعونَهُ إِلَى الهُدَى ائتِنا ۗ قُل إِنَّ هُدَى اللَّهِ هُوَ الهُدىٰ ۖ وَأُمِرنا لِنُسلِمَ لِرَبِّ العالَمينَ",
    "وَأَن أَقيمُوا الصَّلاةَ وَاتَّقوهُ ۚ وَهُوَ الَّذي إِلَيهِ تُحشَرونَ",
    "وَهُوَ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ بِالحَقِّ ۖ وَيَومَ يَقولُ كُن فَيَكونُ ۚ قَولُهُ الحَقُّ ۚ وَلَهُ المُلكُ يَومَ يُنفَخُ فِي الصّورِ ۚ عالِمُ الغَيبِ وَالشَّهادَةِ ۚ وَهُوَ الحَكيمُ الخَبيرُ",
    "۞ وَإِذ قالَ إِبراهيمُ لِأَبيهِ آزَرَ أَتَتَّخِذُ أَصنامًا آلِهَةً ۖ إِنّي أَراكَ وَقَومَكَ في ضَلالٍ مُبينٍ",
    "وَكَذٰلِكَ نُري إِبراهيمَ مَلَكوتَ السَّماواتِ وَالأَرضِ وَلِيَكونَ مِنَ الموقِنينَ",
    "فَلَمّا جَنَّ عَلَيهِ اللَّيلُ رَأىٰ كَوكَبًا ۖ قالَ هٰذا رَبّي ۖ فَلَمّا أَفَلَ قالَ لا أُحِبُّ الآفِلينَ",
    "فَلَمّا رَأَى القَمَرَ بازِغًا قالَ هٰذا رَبّي ۖ فَلَمّا أَفَلَ قالَ لَئِن لَم يَهدِني رَبّي لَأَكونَنَّ مِنَ القَومِ الضّالّينَ",
    "فَلَمّا رَأَى الشَّمسَ بازِغَةً قالَ هٰذا رَبّي هٰذا أَكبَرُ ۖ فَلَمّا أَفَلَت قالَ يا قَومِ إِنّي بَريءٌ مِمّا تُشرِكونَ",
    "إِنّي وَجَّهتُ وَجهِيَ لِلَّذي فَطَرَ السَّماواتِ وَالأَرضَ حَنيفًا ۖ وَما أَنا مِنَ المُشرِكينَ",
    "وَحاجَّهُ قَومُهُ ۚ قالَ أَتُحاجّونّي فِي اللَّهِ وَقَد هَدانِ ۚ وَلا أَخافُ ما تُشرِكونَ بِهِ إِلّا أَن يَشاءَ رَبّي شَيئًا ۗ وَسِعَ رَبّي كُلَّ شَيءٍ عِلمًا ۗ أَفَلا تَتَذَكَّرونَ",
    "وَكَيفَ أَخافُ ما أَشرَكتُم وَلا تَخافونَ أَنَّكُم أَشرَكتُم بِاللَّهِ ما لَم يُنَزِّل بِهِ عَلَيكُم سُلطانًا ۚ فَأَيُّ الفَريقَينِ أَحَقُّ بِالأَمنِ ۖ إِن كُنتُم تَعلَمونَ",
    "الَّذينَ آمَنوا وَلَم يَلبِسوا إيمانَهُم بِظُلمٍ أُولٰئِكَ لَهُمُ الأَمنُ وَهُم مُهتَدونَ",
    "وَتِلكَ حُجَّتُنا آتَيناها إِبراهيمَ عَلىٰ قَومِهِ ۚ نَرفَعُ دَرَجاتٍ مَن نَشاءُ ۗ إِنَّ رَبَّكَ حَكيمٌ عَليمٌ",
    "وَوَهَبنا لَهُ إِسحاقَ وَيَعقوبَ ۚ كُلًّا هَدَينا ۚ وَنوحًا هَدَينا مِن قَبلُ ۖ وَمِن ذُرِّيَّتِهِ داوودَ وَسُلَيمانَ وَأَيّوبَ وَيوسُفَ وَموسىٰ وَهارونَ ۚ وَكَذٰلِكَ نَجزِي المُحسِنينَ",
    "وَزَكَرِيّا وَيَحيىٰ وَعيسىٰ وَإِلياسَ ۖ كُلٌّ مِنَ الصّالِحينَ",
    "وَإِسماعيلَ وَاليَسَعَ وَيونُسَ وَلوطًا ۚ وَكُلًّا فَضَّلنا عَلَى العالَمينَ",
    "وَمِن آبائِهِم وَذُرِّيّاتِهِم وَإِخوانِهِم ۖ وَاجتَبَيناهُم وَهَدَيناهُم إِلىٰ صِراطٍ مُستَقيمٍ",
    "ذٰلِكَ هُدَى اللَّهِ يَهدي بِهِ مَن يَشاءُ مِن عِبادِهِ ۚ وَلَو أَشرَكوا لَحَبِطَ عَنهُم ما كانوا يَعمَلونَ",
    "أُولٰئِكَ الَّذينَ آتَيناهُمُ الكِتابَ وَالحُكمَ وَالنُّبُوَّةَ ۚ فَإِن يَكفُر بِها هٰؤُلاءِ فَقَد وَكَّلنا بِها قَومًا لَيسوا بِها بِكافِرينَ",
    "أُولٰئِكَ الَّذينَ هَدَى اللَّهُ ۖ فَبِهُداهُمُ اقتَدِه ۗ قُل لا أَسأَلُكُم عَلَيهِ أَجرًا ۖ إِن هُوَ إِلّا ذِكرىٰ لِلعالَمينَ",
    "وَما قَدَرُوا اللَّهَ حَقَّ قَدرِهِ إِذ قالوا ما أَنزَلَ اللَّهُ عَلىٰ بَشَرٍ مِن شَيءٍ ۗ قُل مَن أَنزَلَ الكِتابَ الَّذي جاءَ بِهِ موسىٰ نورًا وَهُدًى لِلنّاسِ ۖ تَجعَلونَهُ قَراطيسَ تُبدونَها وَتُخفونَ كَثيرًا ۖ وَعُلِّمتُم ما لَم تَعلَموا أَنتُم وَلا آباؤُكُم ۖ قُلِ اللَّهُ ۖ ثُمَّ ذَرهُم في خَوضِهِم يَلعَبونَ",
    "وَهٰذا كِتابٌ أَنزَلناهُ مُبارَكٌ مُصَدِّقُ الَّذي بَينَ يَدَيهِ وَلِتُنذِرَ أُمَّ القُرىٰ وَمَن حَولَها ۚ وَالَّذينَ يُؤمِنونَ بِالآخِرَةِ يُؤمِنونَ بِهِ ۖ وَهُم عَلىٰ صَلاتِهِم يُحافِظونَ",
    "وَمَن أَظلَمُ مِمَّنِ افتَرىٰ عَلَى اللَّهِ كَذِبًا أَو قالَ أوحِيَ إِلَيَّ وَلَم يوحَ إِلَيهِ شَيءٌ وَمَن قالَ سَأُنزِلُ مِثلَ ما أَنزَلَ اللَّهُ ۗ وَلَو تَرىٰ إِذِ الظّالِمونَ في غَمَراتِ المَوتِ وَالمَلائِكَةُ باسِطو أَيديهِم أَخرِجوا أَنفُسَكُمُ ۖ اليَومَ تُجزَونَ عَذابَ الهونِ بِما كُنتُم تَقولونَ عَلَى اللَّهِ غَيرَ الحَقِّ وَكُنتُم عَن آياتِهِ تَستَكبِرونَ",
    "وَلَقَد جِئتُمونا فُرادىٰ كَما خَلَقناكُم أَوَّلَ مَرَّةٍ وَتَرَكتُم ما خَوَّلناكُم وَراءَ ظُهورِكُم ۖ وَما نَرىٰ مَعَكُم شُفَعاءَكُمُ الَّذينَ زَعَمتُم أَنَّهُم فيكُم شُرَكاءُ ۚ لَقَد تَقَطَّعَ بَينَكُم وَضَلَّ عَنكُم ما كُنتُم تَزعُمونَ",
    "۞ إِنَّ اللَّهَ فالِقُ الحَبِّ وَالنَّوىٰ ۖ يُخرِجُ الحَيَّ مِنَ المَيِّتِ وَمُخرِجُ المَيِّتِ مِنَ الحَيِّ ۚ ذٰلِكُمُ اللَّهُ ۖ فَأَنّىٰ تُؤفَكونَ",
    "فالِقُ الإِصباحِ وَجَعَلَ اللَّيلَ سَكَنًا وَالشَّمسَ وَالقَمَرَ حُسبانًا ۚ ذٰلِكَ تَقديرُ العَزيزِ العَليمِ",
    "وَهُوَ الَّذي جَعَلَ لَكُمُ النُّجومَ لِتَهتَدوا بِها في ظُلُماتِ البَرِّ وَالبَحرِ ۗ قَد فَصَّلنَا الآياتِ لِقَومٍ يَعلَمونَ",
    "وَهُوَ الَّذي أَنشَأَكُم مِن نَفسٍ واحِدَةٍ فَمُستَقَرٌّ وَمُستَودَعٌ ۗ قَد فَصَّلنَا الآياتِ لِقَومٍ يَفقَهونَ",
    "وَهُوَ الَّذي أَنزَلَ مِنَ السَّماءِ ماءً فَأَخرَجنا بِهِ نَباتَ كُلِّ شَيءٍ فَأَخرَجنا مِنهُ خَضِرًا نُخرِجُ مِنهُ حَبًّا مُتَراكِبًا وَمِنَ النَّخلِ مِن طَلعِها قِنوانٌ دانِيَةٌ وَجَنّاتٍ مِن أَعنابٍ وَالزَّيتونَ وَالرُّمّانَ مُشتَبِهًا وَغَيرَ مُتَشابِهٍ ۗ انظُروا إِلىٰ ثَمَرِهِ إِذا أَثمَرَ وَيَنعِهِ ۚ إِنَّ في ذٰلِكُم لَآياتٍ لِقَومٍ يُؤمِنونَ",
    "وَجَعَلوا لِلَّهِ شُرَكاءَ الجِنَّ وَخَلَقَهُم ۖ وَخَرَقوا لَهُ بَنينَ وَبَناتٍ بِغَيرِ عِلمٍ ۚ سُبحانَهُ وَتَعالىٰ عَمّا يَصِفونَ",
    "بَديعُ السَّماواتِ وَالأَرضِ ۖ أَنّىٰ يَكونُ لَهُ وَلَدٌ وَلَم تَكُن لَهُ صاحِبَةٌ ۖ وَخَلَقَ كُلَّ شَيءٍ ۖ وَهُوَ بِكُلِّ شَيءٍ عَليمٌ",
    "ذٰلِكُمُ اللَّهُ رَبُّكُم ۖ لا إِلٰهَ إِلّا هُوَ ۖ خالِقُ كُلِّ شَيءٍ فَاعبُدوهُ ۚ وَهُوَ عَلىٰ كُلِّ شَيءٍ وَكيلٌ",
    "لا تُدرِكُهُ الأَبصارُ وَهُوَ يُدرِكُ الأَبصارَ ۖ وَهُوَ اللَّطيفُ الخَبيرُ",
    "قَد جاءَكُم بَصائِرُ مِن رَبِّكُم ۖ فَمَن أَبصَرَ فَلِنَفسِهِ ۖ وَمَن عَمِيَ فَعَلَيها ۚ وَما أَنا عَلَيكُم بِحَفيظٍ",
    "وَكَذٰلِكَ نُصَرِّفُ الآياتِ وَلِيَقولوا دَرَستَ وَلِنُبَيِّنَهُ لِقَومٍ يَعلَمونَ",
    "اتَّبِع ما أوحِيَ إِلَيكَ مِن رَبِّكَ ۖ لا إِلٰهَ إِلّا هُوَ ۖ وَأَعرِض عَنِ المُشرِكينَ",
    "وَلَو شاءَ اللَّهُ ما أَشرَكوا ۗ وَما جَعَلناكَ عَلَيهِم حَفيظًا ۖ وَما أَنتَ عَلَيهِم بِوَكيلٍ",
    "وَلا تَسُبُّوا الَّذينَ يَدعونَ مِن دونِ اللَّهِ فَيَسُبُّوا اللَّهَ عَدوًا بِغَيرِ عِلمٍ ۗ كَذٰلِكَ زَيَّنّا لِكُلِّ أُمَّةٍ عَمَلَهُم ثُمَّ إِلىٰ رَبِّهِم مَرجِعُهُم فَيُنَبِّئُهُم بِما كانوا يَعمَلونَ",
    "وَأَقسَموا بِاللَّهِ جَهدَ أَيمانِهِم لَئِن جاءَتهُم آيَةٌ لَيُؤمِنُنَّ بِها ۚ قُل إِنَّمَا الآياتُ عِندَ اللَّهِ ۖ وَما يُشعِرُكُم أَنَّها إِذا جاءَت لا يُؤمِنونَ",
    "وَنُقَلِّبُ أَفئِدَتَهُم وَأَبصارَهُم كَما لَم يُؤمِنوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُم في طُغيانِهِم يَعمَهونَ",
    "۞ وَلَو أَنَّنا نَزَّلنا إِلَيهِمُ المَلائِكَةَ وَكَلَّمَهُمُ المَوتىٰ وَحَشَرنا عَلَيهِم كُلَّ شَيءٍ قُبُلًا ما كانوا لِيُؤمِنوا إِلّا أَن يَشاءَ اللَّهُ وَلٰكِنَّ أَكثَرَهُم يَجهَلونَ",
    "وَكَذٰلِكَ جَعَلنا لِكُلِّ نَبِيٍّ عَدُوًّا شَياطينَ الإِنسِ وَالجِنِّ يوحي بَعضُهُم إِلىٰ بَعضٍ زُخرُفَ القَولِ غُرورًا ۚ وَلَو شاءَ رَبُّكَ ما فَعَلوهُ ۖ فَذَرهُم وَما يَفتَرونَ",
    "وَلِتَصغىٰ إِلَيهِ أَفئِدَةُ الَّذينَ لا يُؤمِنونَ بِالآخِرَةِ وَلِيَرضَوهُ وَلِيَقتَرِفوا ما هُم مُقتَرِفونَ",
    "أَفَغَيرَ اللَّهِ أَبتَغي حَكَمًا وَهُوَ الَّذي أَنزَلَ إِلَيكُمُ الكِتابَ مُفَصَّلًا ۚ وَالَّذينَ آتَيناهُمُ الكِتابَ يَعلَمونَ أَنَّهُ مُنَزَّلٌ مِن رَبِّكَ بِالحَقِّ ۖ فَلا تَكونَنَّ مِنَ المُمتَرينَ",
    "وَتَمَّت كَلِمَتُ رَبِّكَ صِدقًا وَعَدلًا ۚ لا مُبَدِّلَ لِكَلِماتِهِ ۚ وَهُوَ السَّميعُ العَليمُ",
    "وَإِن تُطِع أَكثَرَ مَن فِي الأَرضِ يُضِلّوكَ عَن سَبيلِ اللَّهِ ۚ إِن يَتَّبِعونَ إِلَّا الظَّنَّ وَإِن هُم إِلّا يَخرُصونَ",
    "إِنَّ رَبَّكَ هُوَ أَعلَمُ مَن يَضِلُّ عَن سَبيلِهِ ۖ وَهُوَ أَعلَمُ بِالمُهتَدينَ",
    "فَكُلوا مِمّا ذُكِرَ اسمُ اللَّهِ عَلَيهِ إِن كُنتُم بِآياتِهِ مُؤمِنينَ",
    "وَما لَكُم أَلّا تَأكُلوا مِمّا ذُكِرَ اسمُ اللَّهِ عَلَيهِ وَقَد فَصَّلَ لَكُم ما حَرَّمَ عَلَيكُم إِلّا مَا اضطُرِرتُم إِلَيهِ ۗ وَإِنَّ كَثيرًا لَيُضِلّونَ بِأَهوائِهِم بِغَيرِ عِلمٍ ۗ إِنَّ رَبَّكَ هُوَ أَعلَمُ بِالمُعتَدينَ",
    "وَذَروا ظاهِرَ الإِثمِ وَباطِنَهُ ۚ إِنَّ الَّذينَ يَكسِبونَ الإِثمَ سَيُجزَونَ بِما كانوا يَقتَرِفونَ",
    "وَلا تَأكُلوا مِمّا لَم يُذكَرِ اسمُ اللَّهِ عَلَيهِ وَإِنَّهُ لَفِسقٌ ۗ وَإِنَّ الشَّياطينَ لَيوحونَ إِلىٰ أَولِيائِهِم لِيُجادِلوكُم ۖ وَإِن أَطَعتُموهُم إِنَّكُم لَمُشرِكونَ",
    "أَوَمَن كانَ مَيتًا فَأَحيَيناهُ وَجَعَلنا لَهُ نورًا يَمشي بِهِ فِي النّاسِ كَمَن مَثَلُهُ فِي الظُّلُماتِ لَيسَ بِخارِجٍ مِنها ۚ كَذٰلِكَ زُيِّنَ لِلكافِرينَ ما كانوا يَعمَلونَ",
    "وَكَذٰلِكَ جَعَلنا في كُلِّ قَريَةٍ أَكابِرَ مُجرِميها لِيَمكُروا فيها ۖ وَما يَمكُرونَ إِلّا بِأَنفُسِهِم وَما يَشعُرونَ",
    "وَإِذا جاءَتهُم آيَةٌ قالوا لَن نُؤمِنَ حَتّىٰ نُؤتىٰ مِثلَ ما أوتِيَ رُسُلُ اللَّهِ ۘ اللَّهُ أَعلَمُ حَيثُ يَجعَلُ رِسالَتَهُ ۗ سَيُصيبُ الَّذينَ أَجرَموا صَغارٌ عِندَ اللَّهِ وَعَذابٌ شَديدٌ بِما كانوا يَمكُرونَ",
    "فَمَن يُرِدِ اللَّهُ أَن يَهدِيَهُ يَشرَح صَدرَهُ لِلإِسلامِ ۖ وَمَن يُرِد أَن يُضِلَّهُ يَجعَل صَدرَهُ ضَيِّقًا حَرَجًا كَأَنَّما يَصَّعَّدُ فِي السَّماءِ ۚ كَذٰلِكَ يَجعَلُ اللَّهُ الرِّجسَ عَلَى الَّذينَ لا يُؤمِنونَ",
    "وَهٰذا صِراطُ رَبِّكَ مُستَقيمًا ۗ قَد فَصَّلنَا الآياتِ لِقَومٍ يَذَّكَّرونَ",
    "۞ لَهُم دارُ السَّلامِ عِندَ رَبِّهِم ۖ وَهُوَ وَلِيُّهُم بِما كانوا يَعمَلونَ",
    "وَيَومَ يَحشُرُهُم جَميعًا يا مَعشَرَ الجِنِّ قَدِ استَكثَرتُم مِنَ الإِنسِ ۖ وَقالَ أَولِياؤُهُم مِنَ الإِنسِ رَبَّنَا استَمتَعَ بَعضُنا بِبَعضٍ وَبَلَغنا أَجَلَنَا الَّذي أَجَّلتَ لَنا ۚ قالَ النّارُ مَثواكُم خالِدينَ فيها إِلّا ما شاءَ اللَّهُ ۗ إِنَّ رَبَّكَ حَكيمٌ عَليمٌ",
    "وَكَذٰلِكَ نُوَلّي بَعضَ الظّالِمينَ بَعضًا بِما كانوا يَكسِبونَ",
    "يا مَعشَرَ الجِنِّ وَالإِنسِ أَلَم يَأتِكُم رُسُلٌ مِنكُم يَقُصّونَ عَلَيكُم آياتي وَيُنذِرونَكُم لِقاءَ يَومِكُم هٰذا ۚ قالوا شَهِدنا عَلىٰ أَنفُسِنا ۖ وَغَرَّتهُمُ الحَياةُ الدُّنيا وَشَهِدوا عَلىٰ أَنفُسِهِم أَنَّهُم كانوا كافِرينَ",
    "ذٰلِكَ أَن لَم يَكُن رَبُّكَ مُهلِكَ القُرىٰ بِظُلمٍ وَأَهلُها غافِلونَ",
    "وَلِكُلٍّ دَرَجاتٌ مِمّا عَمِلوا ۚ وَما رَبُّكَ بِغافِلٍ عَمّا يَعمَلونَ",
    "وَرَبُّكَ الغَنِيُّ ذُو الرَّحمَةِ ۚ إِن يَشَأ يُذهِبكُم وَيَستَخلِف مِن بَعدِكُم ما يَشاءُ كَما أَنشَأَكُم مِن ذُرِّيَّةِ قَومٍ آخَرينَ",
    "إِنَّ ما توعَدونَ لَآتٍ ۖ وَما أَنتُم بِمُعجِزينَ",
    "قُل يا قَومِ اعمَلوا عَلىٰ مَكانَتِكُم إِنّي عامِلٌ ۖ فَسَوفَ تَعلَمونَ مَن تَكونُ لَهُ عاقِبَةُ الدّارِ ۗ إِنَّهُ لا يُفلِحُ الظّالِمونَ",
    "وَجَعَلوا لِلَّهِ مِمّا ذَرَأَ مِنَ الحَرثِ وَالأَنعامِ نَصيبًا فَقالوا هٰذا لِلَّهِ بِزَعمِهِم وَهٰذا لِشُرَكائِنا ۖ فَما كانَ لِشُرَكائِهِم فَلا يَصِلُ إِلَى اللَّهِ ۖ وَما كانَ لِلَّهِ فَهُوَ يَصِلُ إِلىٰ شُرَكائِهِم ۗ ساءَ ما يَحكُمونَ",
    "وَكَذٰلِكَ زَيَّنَ لِكَثيرٍ مِنَ المُشرِكينَ قَتلَ أَولادِهِم شُرَكاؤُهُم لِيُردوهُم وَلِيَلبِسوا عَلَيهِم دينَهُم ۖ وَلَو شاءَ اللَّهُ ما فَعَلوهُ ۖ فَذَرهُم وَما يَفتَرونَ",
    "وَقالوا هٰذِهِ أَنعامٌ وَحَرثٌ حِجرٌ لا يَطعَمُها إِلّا مَن نَشاءُ بِزَعمِهِم وَأَنعامٌ حُرِّمَت ظُهورُها وَأَنعامٌ لا يَذكُرونَ اسمَ اللَّهِ عَلَيهَا افتِراءً عَلَيهِ ۚ سَيَجزيهِم بِما كانوا يَفتَرونَ",
    "وَقالوا ما في بُطونِ هٰذِهِ الأَنعامِ خالِصَةٌ لِذُكورِنا وَمُحَرَّمٌ عَلىٰ أَزواجِنا ۖ وَإِن يَكُن مَيتَةً فَهُم فيهِ شُرَكاءُ ۚ سَيَجزيهِم وَصفَهُم ۚ إِنَّهُ حَكيمٌ عَليمٌ",
    "قَد خَسِرَ الَّذينَ قَتَلوا أَولادَهُم سَفَهًا بِغَيرِ عِلمٍ وَحَرَّموا ما رَزَقَهُمُ اللَّهُ افتِراءً عَلَى اللَّهِ ۚ قَد ضَلّوا وَما كانوا مُهتَدينَ",
    "۞ وَهُوَ الَّذي أَنشَأَ جَنّاتٍ مَعروشاتٍ وَغَيرَ مَعروشاتٍ وَالنَّخلَ وَالزَّرعَ مُختَلِفًا أُكُلُهُ وَالزَّيتونَ وَالرُّمّانَ مُتَشابِهًا وَغَيرَ مُتَشابِهٍ ۚ كُلوا مِن ثَمَرِهِ إِذا أَثمَرَ وَآتوا حَقَّهُ يَومَ حَصادِهِ ۖ وَلا تُسرِفوا ۚ إِنَّهُ لا يُحِبُّ المُسرِفينَ",
    "وَمِنَ الأَنعامِ حَمولَةً وَفَرشًا ۚ كُلوا مِمّا رَزَقَكُمُ اللَّهُ وَلا تَتَّبِعوا خُطُواتِ الشَّيطانِ ۚ إِنَّهُ لَكُم عَدُوٌّ مُبينٌ",
    "ثَمانِيَةَ أَزواجٍ ۖ مِنَ الضَّأنِ اثنَينِ وَمِنَ المَعزِ اثنَينِ ۗ قُل آلذَّكَرَينِ حَرَّمَ أَمِ الأُنثَيَينِ أَمَّا اشتَمَلَت عَلَيهِ أَرحامُ الأُنثَيَينِ ۖ نَبِّئوني بِعِلمٍ إِن كُنتُم صادِقينَ",
    "وَمِنَ الإِبِلِ اثنَينِ وَمِنَ البَقَرِ اثنَينِ ۗ قُل آلذَّكَرَينِ حَرَّمَ أَمِ الأُنثَيَينِ أَمَّا اشتَمَلَت عَلَيهِ أَرحامُ الأُنثَيَينِ ۖ أَم كُنتُم شُهَداءَ إِذ وَصّاكُمُ اللَّهُ بِهٰذا ۚ فَمَن أَظلَمُ مِمَّنِ افتَرىٰ عَلَى اللَّهِ كَذِبًا لِيُضِلَّ النّاسَ بِغَيرِ عِلمٍ ۗ إِنَّ اللَّهَ لا يَهدِي القَومَ الظّالِمينَ",
    "قُل لا أَجِدُ في ما أوحِيَ إِلَيَّ مُحَرَّمًا عَلىٰ طاعِمٍ يَطعَمُهُ إِلّا أَن يَكونَ مَيتَةً أَو دَمًا مَسفوحًا أَو لَحمَ خِنزيرٍ فَإِنَّهُ رِجسٌ أَو فِسقًا أُهِلَّ لِغَيرِ اللَّهِ بِهِ ۚ فَمَنِ اضطُرَّ غَيرَ باغٍ وَلا عادٍ فَإِنَّ رَبَّكَ غَفورٌ رَحيمٌ",
    "وَعَلَى الَّذينَ هادوا حَرَّمنا كُلَّ ذي ظُفُرٍ ۖ وَمِنَ البَقَرِ وَالغَنَمِ حَرَّمنا عَلَيهِم شُحومَهُما إِلّا ما حَمَلَت ظُهورُهُما أَوِ الحَوايا أَو مَا اختَلَطَ بِعَظمٍ ۚ ذٰلِكَ جَزَيناهُم بِبَغيِهِم ۖ وَإِنّا لَصادِقونَ",
    "فَإِن كَذَّبوكَ فَقُل رَبُّكُم ذو رَحمَةٍ واسِعَةٍ وَلا يُرَدُّ بَأسُهُ عَنِ القَومِ المُجرِمينَ",
    "سَيَقولُ الَّذينَ أَشرَكوا لَو شاءَ اللَّهُ ما أَشرَكنا وَلا آباؤُنا وَلا حَرَّمنا مِن شَيءٍ ۚ كَذٰلِكَ كَذَّبَ الَّذينَ مِن قَبلِهِم حَتّىٰ ذاقوا بَأسَنا ۗ قُل هَل عِندَكُم مِن عِلمٍ فَتُخرِجوهُ لَنا ۖ إِن تَتَّبِعونَ إِلَّا الظَّنَّ وَإِن أَنتُم إِلّا تَخرُصونَ",
    "قُل فَلِلَّهِ الحُجَّةُ البالِغَةُ ۖ فَلَو شاءَ لَهَداكُم أَجمَعينَ",
    "قُل هَلُمَّ شُهَداءَكُمُ الَّذينَ يَشهَدونَ أَنَّ اللَّهَ حَرَّمَ هٰذا ۖ فَإِن شَهِدوا فَلا تَشهَد مَعَهُم ۚ وَلا تَتَّبِع أَهواءَ الَّذينَ كَذَّبوا بِآياتِنا وَالَّذينَ لا يُؤمِنونَ بِالآخِرَةِ وَهُم بِرَبِّهِم يَعدِلونَ",
    "۞ قُل تَعالَوا أَتلُ ما حَرَّمَ رَبُّكُم عَلَيكُم ۖ أَلّا تُشرِكوا بِهِ شَيئًا ۖ وَبِالوالِدَينِ إِحسانًا ۖ وَلا تَقتُلوا أَولادَكُم مِن إِملاقٍ ۖ نَحنُ نَرزُقُكُم وَإِيّاهُم ۖ وَلا تَقرَبُوا الفَواحِشَ ما ظَهَرَ مِنها وَما بَطَنَ ۖ وَلا تَقتُلُوا النَّفسَ الَّتي حَرَّمَ اللَّهُ إِلّا بِالحَقِّ ۚ ذٰلِكُم وَصّاكُم بِهِ لَعَلَّكُم تَعقِلونَ",
    "وَلا تَقرَبوا مالَ اليَتيمِ إِلّا بِالَّتي هِيَ أَحسَنُ حَتّىٰ يَبلُغَ أَشُدَّهُ ۖ وَأَوفُوا الكَيلَ وَالميزانَ بِالقِسطِ ۖ لا نُكَلِّفُ نَفسًا إِلّا وُسعَها ۖ وَإِذا قُلتُم فَاعدِلوا وَلَو كانَ ذا قُربىٰ ۖ وَبِعَهدِ اللَّهِ أَوفوا ۚ ذٰلِكُم وَصّاكُم بِهِ لَعَلَّكُم تَذَكَّرونَ",
    "وَأَنَّ هٰذا صِراطي مُستَقيمًا فَاتَّبِعوهُ ۖ وَلا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُم عَن سَبيلِهِ ۚ ذٰلِكُم وَصّاكُم بِهِ لَعَلَّكُم تَتَّقونَ",
    "ثُمَّ آتَينا موسَى الكِتابَ تَمامًا عَلَى الَّذي أَحسَنَ وَتَفصيلًا لِكُلِّ شَيءٍ وَهُدًى وَرَحمَةً لَعَلَّهُم بِلِقاءِ رَبِّهِم يُؤمِنونَ",
    "وَهٰذا كِتابٌ أَنزَلناهُ مُبارَكٌ فَاتَّبِعوهُ وَاتَّقوا لَعَلَّكُم تُرحَمونَ",
    "أَن تَقولوا إِنَّما أُنزِلَ الكِتابُ عَلىٰ طائِفَتَينِ مِن قَبلِنا وَإِن كُنّا عَن دِراسَتِهِم لَغافِلينَ",
    "أَو تَقولوا لَو أَنّا أُنزِلَ عَلَينَا الكِتابُ لَكُنّا أَهدىٰ مِنهُم ۚ فَقَد جاءَكُم بَيِّنَةٌ مِن رَبِّكُم وَهُدًى وَرَحمَةٌ ۚ فَمَن أَظلَمُ مِمَّن كَذَّبَ بِآياتِ اللَّهِ وَصَدَفَ عَنها ۗ سَنَجزِي الَّذينَ يَصدِفونَ عَن آياتِنا سوءَ العَذابِ بِما كانوا يَصدِفونَ",
    "هَل يَنظُرونَ إِلّا أَن تَأتِيَهُمُ المَلائِكَةُ أَو يَأتِيَ رَبُّكَ أَو يَأتِيَ بَعضُ آياتِ رَبِّكَ ۗ يَومَ يَأتي بَعضُ آياتِ رَبِّكَ لا يَنفَعُ نَفسًا إيمانُها لَم تَكُن آمَنَت مِن قَبلُ أَو كَسَبَت في إيمانِها خَيرًا ۗ قُلِ انتَظِروا إِنّا مُنتَظِرونَ",
    "إِنَّ الَّذينَ فَرَّقوا دينَهُم وَكانوا شِيَعًا لَستَ مِنهُم في شَيءٍ ۚ إِنَّما أَمرُهُم إِلَى اللَّهِ ثُمَّ يُنَبِّئُهُم بِما كانوا يَفعَلونَ",
    "مَن جاءَ بِالحَسَنَةِ فَلَهُ عَشرُ أَمثالِها ۖ وَمَن جاءَ بِالسَّيِّئَةِ فَلا يُجزىٰ إِلّا مِثلَها وَهُم لا يُظلَمونَ",
    "قُل إِنَّني هَداني رَبّي إِلىٰ صِراطٍ مُستَقيمٍ دينًا قِيَمًا مِلَّةَ إِبراهيمَ حَنيفًا ۚ وَما كانَ مِنَ المُشرِكينَ",
    "قُل إِنَّ صَلاتي وَنُسُكي وَمَحيايَ وَمَماتي لِلَّهِ رَبِّ العالَمينَ",
    "لا شَريكَ لَهُ ۖ وَبِذٰلِكَ أُمِرتُ وَأَنا أَوَّلُ المُسلِمينَ",
    "قُل أَغَيرَ اللَّهِ أَبغي رَبًّا وَهُوَ رَبُّ كُلِّ شَيءٍ ۚ وَلا تَكسِبُ كُلُّ نَفسٍ إِلّا عَلَيها ۚ وَلا تَزِرُ وازِرَةٌ وِزرَ أُخرىٰ ۚ ثُمَّ إِلىٰ رَبِّكُم مَرجِعُكُم فَيُنَبِّئُكُم بِما كُنتُم فيهِ تَختَلِفونَ",
    "وَهُوَ الَّذي جَعَلَكُم خَلائِفَ الأَرضِ وَرَفَعَ بَعضَكُم فَوقَ بَعضٍ دَرَجاتٍ لِيَبلُوَكُم في ما آتاكُم ۗ إِنَّ رَبَّكَ سَريعُ العِقابِ وَإِنَّهُ لَغَفورٌ رَحيمٌ"
  ]
}