{
  "id": 71,
  "name": "نوح",
  "transliteration": "Nuh",
  "translation": "Noah",
  "verses": [
    "إِنّا أَرسَلنا نوحًا إِلىٰ قَومِهِ أَن أَنذِر قَومَكَ مِن قَبلِ أَن يَأتِيَهُم عَذابٌ أَليمٌ",
    "قالَ يا قَومِ إِنّي لَكُم نَذيرٌ مُبينٌ",
    "أَنِ اعبُدُوا اللَّهَ وَاتَّقوهُ وَأَطيعونِ",
    "يَغفِر لَكُم مِن ذُنوبِكُم وَيُؤَخِّركُم إِلىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ أَجَلَ اللَّهِ إِذا جاءَ لا يُؤَخَّرُ ۖ لَو كُنتُم تَعلَمونَ",
    "قالَ رَبِّ إِنّي دَعَوتُ قَومي لَيلًا وَنَهارًا",
    "فَلَم يَزِدهُم دُعائي إِلّا فِرارًا",
    "وَإِنّي كُلَّما دَعَوتُهُم لِتَغفِرَ لَهُم جَعَلوا أَصابِعَهُم في آذانِهِم وَاستَغشَوا ثِيابَهُم وَأَصَرّوا وَاستَكبَرُوا استِكبارًا",
    "ثُمَّ إِنّي دَعَوتُهُم جِهارًا",
    "ثُمَّ إِنّي أَعلَنتُ لَهُم وَأَسرَرتُ لَهُم إِسرارًا",
    "فَقُلتُ استَغفِروا رَبَّكُم إِنَّهُ كانَ غَفّارًا",
    "يُرسِلِ السَّماءَ عَلَيكُم مِدرارًا",
    "وَيُمدِدكُم بِأَموالٍ وَبَنينَ وَيَجعَل لَكُم جَنّاتٍ وَيَجعَل لَكُم أَنهارًا",
    "ما لَكُم لا تَرجونَ لِلَّهِ وَقارًا",
    "وَقَد خَلَقَكُم أَطوارًا",
    "أَلَم تَرَوا كَيفَ خَلَقَ اللَّهُ سَبعَ سَماواتٍ طِباقًا",
    "وَجَعَلَ القَمَرَ فيهِنَّ نورًا وَجَعَلَ الشَّمسَ سِراجًا",
    "وَاللَّهُ أَنبَتَكُم مِنَ الأَرضِ نَباتًا",
    "ثُمَّ يُعيدُكُم فيها وَيُخرِجُكُم إِخراجًا",
    "وَاللَّهُ جَعَلَ لَكُمُ الأَرضَ بِساطًا",
    "لِتَسلُكوا مِنها سُبُلًا فِجاجًا",
    "قالَ نوحٌ رَبِّ إِنَّهُم عَصَوني وَاتَّبَعوا مَن لَم يَزِدهُ مالُهُ وَوَلَدُهُ إِلّا خَسارًا",
    "وَمَكَروا مَكرًا كُبّارًا",
    "وَقالوا لا تَذَرُنَّ آلِهَتَكُم وَلا تَذَرُنَّ وَدًّا وَلا سُواعًا وَلا يَغوثَ وَيَعوقَ وَنَسرًا",
    "وَقَد أَضَلّوا كَثيرًا ۖ وَلا تَزِدِ الظّالِمينَ إِلّا ضَلالًا",
    "مِمّا خَطيئَاتِهِم أُغرِقوا فَأُدخِلوا نارًا فَلَم يَجِدوا لَهُم مِن دونِ اللَّهِ أَنصارًا",
    "وَقالَ نوحٌ رَبِّ لا تَذَر عَلَى الأَرضِ مِنَ الكافِرينَ دَيّارًا",
    "إِنَّكَ إِن تَذَرهُم يُضِلّوا عِبادَكَ وَلا يَلِدوا إِلّا فاجِرًا كَفّارًا",
    "رَبِّ اغفِر لي وَلِوالِدَيَّ وَلِمَن دَخَلَ بَيتِيَ مُؤمِنًا وَلِلمُؤمِنينَ وَالمُؤمِناتِ وَلا تَزِدِ الظّالِمينَ إِلّا تَبارًا"
  ]
}