{
  "id": 10,
  "name": "يونس",
  "transliteration": "Yunus",
  "translation": "Jonah",
  "verses": [
    "Alif. Lam. Ra. These are the Verses of the Wise Book.",
    "Is it a wonder to the people that We inspired a man from among them: “Warn the people. And give good news to those who believe that they are on a sound footing with their Lord?” The disbelievers say, “This is an obvious sorcerer.”",
    "Your Lord is God, Who created the heavens and the earth in six days, then settled over the Throne, governing all things. There is no intercessor except after His permission. That is God, your Lord—so worship Him. Will you not reflect?",
    "To Him is your return, altogether. The promise of God is true. He originates creation, then He repeats it, to reward those who believe and do good deeds with equity. As for those who disbelieve, for them is a drink of boiling liquid, and agonizing suffering, for having disbelieved.",
    "It is He who made the sun radiant, and the moon a light, and determined its phases, so you may know the number of years and the calculation. God did not create all this except with truth. He details the revelations for people who know.",
    "In the alternation of night and day, and in what God created in the heavens and the earth, are signs for people who are aware.",
    "Those who do not anticipate meeting Us, and are content with the worldly life, and feel secure in it, and those who pay no attention to Our signs.",
    "These: their dwelling is the Fire, on account of what they used to do.",
    "As for those who believe and do good deeds, their Lord guides them in their faith. Rivers will flow beneath them in the Gardens of Bliss.",
    "Their call in it is, “Glory be to You, our God.” And their greeting in it is, “Peace.” And the last of their call is, “Praise be to God, Lord of the Universe!”",
    "Were God to speed up the ill for people, as they wish to speed up the good, their term would be fulfilled. But We leave those who do not anticipate Our meeting to blunder in their rebellion.",
    "When adversity touches the human being, he prays to Us—reclining on his side, or sitting, or standing. But when We have relieved his adversity from him, he goes away, as though he had not called on Us for trouble that had afflicted him. Thus the deeds of the transgressors appear good to them.",
    "We have destroyed generations before you when they did wrong. Their messengers came to them with clear proofs, but they would not believe. Thus We recompense the guilty people.",
    "Then We made you successors on earth after them, to see how you would behave.",
    "And when Our clear revelations are conveyed to them, those who do not anticipate the meeting with Us, say, “Bring a Quran other than this, or change it.” Say, “It is not for me to change it of my own accord. I only follow what is revealed to me. I fear, should I disobey my Lord, the suffering of an awesome Day.”",
    "Say, “Had God willed, I would not have read it to you, nor would He have made it known to you. I have lived among you for a lifetime before it. Do you not understand?”",
    "Who does more wrong than someone who fabricates lies about God, or denies His revelations? The guilty will never succeed.",
    "And they worship, besides God, what neither harms them nor benefits them. And they say, “These are our intercessors with God.” Say, “Are you informing God about something He does not know in the heavens or on earth?” Glorified be He, High above the associations they make.",
    "Humanity was a single community, but then they differed. Were it not for a prior decree from your Lord, the matters over which they had disputed would have been settled.",
    "And they say, “If only a miracle was sent down to him from his Lord.” Say, “The realm of the unseen belongs to God. So wait, I am waiting with you.”",
    "When We make people taste mercy after some adversity has touched them, they begin to scheme against Our signs. Say, “God is swifter in scheming.” Our envoys are recording what you scheme.",
    "It is He who transports you across land and sea. Until, when you are on ships sailing in a favorable wind, and rejoicing in it, a raging wind appears. The waves surge over them from every side, and they realize that they are besieged. Thereupon they pray to God, declaring sincere devotion to Him: “If You save us from this, we will be of the thankful.”",
    "But then, when He has saved them, they commit violations on earth, and they oppose justice. O, people! Your violations are against your own souls. It is the enjoyment of the present life. Then to Us is your return, and We will inform you of what you used to do.",
    "The parable of the present life is that of water that We send down from the sky is absorbed by the plants of the earth, from which people and animals eat. Until, when the earth puts on its fine appearance, and it is beautified, and its inhabitants think they have gained mastery over it, Our command descends on it by night or by day, and We turn it into a mown field—as if it had not flourished the day before. Thus We clarify the communications for a people who reflect.",
    "God invites to the Home of Peace, and He guides whomever He wills on a straight path.",
    "For those who do good is goodness—and more. Neither gloom nor shame will cover their faces. These are the inhabitants of Paradise, abiding in it forever.",
    "As for those who commit evil: a reward of similar evil; and shame will overcome them. They will have no defender against God—as if their faces are covered with dark patches of night. These are the inmates of the Fire, abiding in it forever.",
    "On the Day when We gather them all together, then We say to those who ascribed partners, “To your place, you and your partners.” Then We will separate between them, and their partners will say, “It was not us you were worshiping.”",
    "“God is a sufficient witness between us and you. We were unaware of your worship.”",
    "There and then, every soul will experience what it had done previously. And they will be returned to God, their True Master. And what they used to invent will abandon them.",
    "Say, “Who provides for you from heaven and earth? And who regulates the hearing and the sight? And who produces the living from the dead, and produces the dead from the living? And who governs the Order?” They will say, “God.” Say, “Will you not be cautious?”",
    "That is God, your true Lord. What is there, beyond truth, except error? How are you turned away?",
    "Thus the Word of your Lord proved true against those who disobeyed, for they do not believe.",
    "Say, “Can any of your partners initiate creation, and then repeat it?” Say, “God initiates the creation, then He repeats it. How can you be so deluded?”",
    "Say, “Can any of your partners guide to the truth?” Say, “God guides to the truth. Is He who guides to the truth more deserving of being followed, or he who does not guide, unless he himself is guided? What is the matter with you? How do you judge?”",
    "Most of them follow nothing but speculations, and speculations can in no way replace the truth. God is fully aware of what they do.",
    "This Quran could not have been produced by anyone other than God. In fact, it is a confirmation of what preceded it, and an elaboration of the Book. There is no doubt about it—it is from the Lord of the Universe.",
    "Or do they say, “He made it up?” Say, “Then produce a single chapter like it, and call upon whomever you can, apart from God, if you are truthful.”",
    "In fact, they deny what is beyond the limits of their knowledge, and whose explanation has not reached them. Thus those before them refused to believe. So note the consequence for the wrongdoers.",
    "And among them are those who believe in it, and among them are those who do not believe in it. Your Lord fully knows the mischief-makers.",
    "And if they accuse you of lying, say, “I have my deeds, and you have your deeds. You are innocent of what I do, and I am innocent of what you do.”",
    "And among them are those who listen to you. But can you make the deaf hear, even though they do not understand?",
    "And among them are those who look at you. But can you guide the blind, even though they do not see?",
    "God does not wrong people in the least, but people wrong their own selves.",
    "On the Day when He gathers them—as if they had stayed for only an hour of a day—acquainting themselves with one another. Lost are those who denied the meeting with God, and were not guided.",
    "Whether We show you some of what We promised them, or We retrieve you—to Us is their return. God is witness over everything they do.",
    "For every community is a messenger. When their messenger has come, judgment will be passed between them with justice, and they will not be wronged.",
    "And they say, “When will this promise be fulfilled—if you are truthful?”",
    "Say, “I have no power to harm or benefit myself, except as God wills. For every nation is an appointed time. Then, when their time has arrived, they cannot delay it by one hour, nor can they advance it.",
    "Say, “Have you considered? If His punishment overtakes you by night or by day, what part of it will the guilty seek to rush?”",
    "“Then, when it befalls, will you believe in it? Now? When you tried to rush it?”",
    "Then it will be said to those who did wrong, “Taste the torment of eternity. Are you not repaid except for what you used to commit?”",
    "And they inquire of you, “Is it true?” Say, “Yes, by my Lord, it is true, and you cannot prevent it.”",
    "If each soul that has done injustice possessed all that the earth contains, it would offer it as ransom. They will hide the remorse when they see the suffering, and it will be judged between them equitably, and they will not be wronged.",
    "Certainly, to God belongs everything in the heavens and the earth. Certainly, the promise of God is true. But most of them do not know.",
    "He gives life, and He causes death. And to Him, you will be returned.",
    "O, people! There has come to you advice from your Lord, and healing for what is in the hearts, and guidance and mercy for believers.",
    "Say, “In God’s grace and mercy let them rejoice. That is better than whatever they accumulate.”",
    "Say, “Have you considered the sustenance that God sent down for you, some of which you made unlawful, and some lawful?” Say, “Did God give you permission, or are you fabricating lies and attributing them to God?”",
    "What will those who fabricate lies against God think on the Day of Resurrection? God is bountiful towards people, but most of them are not thankful.",
    "You do not get into any situation, nor do you recite any Quran, nor do you do anything, but We are watching over you as you undertake it. Not even an atom’s weight, on earth or in the sky, evades your Lord, nor is there anything smaller or larger, but is in a clear record.",
    "Unquestionably, God’s friends have nothing to fear, nor will they grieve.",
    "Those who believe and protect themselves.",
    "For them is good news in this life, and in the Hereafter. There is no alteration to the words of God. That is the supreme triumph.",
    "And let not their speech dishearten you. All power is God’s. He is the Hearer, the Knower.",
    "Certainly, to God belongs everyone in the heavens and everyone on earth. Those who invoke other than God do not follow partners; they follow nothing but assumptions, and they only guess.",
    "It is He who made the night for your rest, and the daylight for visibility. Surely in this are signs for people who listen.",
    "They said, “God has taken a child.” Be He glorified. He is the Self-Sufficient. His is everything in the heavens and everything on earth. Do you have any proof of this? Or are you saying about God what you do not know?",
    "Say, “Those who fabricate lies about God will not succeed.”",
    "Some enjoyment in this life, then to Us is their return, then We will make them taste the severe suffering on account of their disbelief.",
    "And relate to them the story of Noah, when he said to his people, “O my people, if my presence among you and my reminding you of God’s messages is too much for you, then in God I have put my trust. So come to a decision, you and your partners, and let not the matter perplex you, then carry out your decision against me, and do not hold back.”",
    "“But if you turn away, I did not ask you for any wage. My wage falls only on God, and I was commanded to be of the Submitters.”",
    "But they denounced him, so We saved him and those with him in the Ark, and We made them successors, and We drowned those who rejected Our signs. So consider the fate of the forewarned.",
    "Then, after him, We sent messengers to their people. They came to them with clear proofs, but they would not believe in anything they had already rejected. Thus We seal the hearts of the hostile.",
    "Then, after them, We sent Moses and Aaron with Our proofs to Pharaoh and his dignitaries. But they acted arrogantly. They were sinful people.",
    "And when the truth came to them from Us, they said, “This is nothing but plain magic.”",
    "Moses said, “Is this what you say about the truth when it has come to you? Is this magic? Magicians do not succeed.”",
    "They said, “Did you come to us to divert us from what we found our ancestors following, and so that you become prominent in the land? We will never believe in you.”",
    "Pharaoh said, “Bring me every experienced magician!”",
    "And when the magicians came, Moses said to them, “Throw whatever you have to throw!”",
    "And when they threw, Moses said, “What you produced is magic, and God will make it fail. God does not foster the efforts of the corruptors.”",
    "“But God affirms the truth with His words, even though the guilty hate it.”",
    "But none believed in Moses except some youths of his people, for fear that Pharaoh and his chiefs would persecute them. Pharaoh was high and mighty in the land. He was a tyrant.",
    "Moses said, “O my people! If you have believed in God, then trust in Him, if you are submitters.”",
    "They said, “In God we trust. Our Lord, do not make us a temptation for the wrongdoing people.”",
    "“And deliver us, by Your mercy, from the unbelieving people.”",
    "And We inspired Moses and his brother: “Appoint for your people houses in Egypt, and make your homes places of worship, and perform the prayer, and give good news to the believers.”",
    "Moses said, “Our Lord, you have given Pharaoh and his notables luxuries and riches in the worldly life. Our Lord, for them to lead away from Your path. Our Lord, obliterate their wealth, and harden their hearts—they will not believe until they see the painful punishment.”",
    "He said, “Your prayer is answered. So go straight, and do not follow the path of those who do not know.”",
    "And We delivered the Children of Israel across the sea. Pharaoh and his troops pursued them defiantly and aggressively. Until, when he was about to drown, he said, “I believe that there is no god except the One in whom the Children of Israel believe, and I am of those who submit.”",
    "Now? When you have rebelled before, and were of the mischief-makers?",
    "Today, We will preserve you in your body, so that you become an example for those after you. But most people are negligent of Our examples.",
    "And We settled the Children of Israel in a position of honor, and We provided them with good things. They did not differ until knowledge came to them. Your Lord will judge between them on the Day of Resurrection regarding their differences.",
    "If you are in doubt about what We revealed to you, ask those who read the Scripture before you. The truth has come to you from your Lord, so do not be of those who doubt.",
    "And do not be of those who deny God’s messages, lest you become of the losers.",
    "Those against whom your Lord’s Word is justified will not believe.",
    "Even if every sign were to come to them—until they see the agonizing suffering.",
    "If only there was one town that believed and benefited by its belief. Except for the people of Jonah. When they believed, We lifted from them the suffering of disgrace in this worldly life, and We gave them enjoyment for a while.",
    "Had your Lord willed, everyone on earth would have believed, all together. Would you compel people to become believers?",
    "No soul can believe except by God’s permission. And He lays disgrace on those who do not reason.",
    "Say, “Consider all that is in the heavens and on earth.” But neither signs nor warnings avail a people who do not believe.",
    "Are they waiting for anything but the likes of the days of those who passed away before them? Say, “So wait—I am waiting with you.”",
    "Then We save Our messengers and those who believe. It is binding on Us to save the believers.",
    "Say, “O people! If you are in doubt about my religion—I do not worship those you worship below God. But I worship God, who will terminate your lives. And I was commanded to be of the believers.”",
    "And dedicate yourself to the true religion—a monotheist—and never be of the associators.",
    "And do not call, besides God, on what neither benefits you nor harms you. If you do, you will be of the wrongdoers.",
    "If God touches you with harm, none can remove it except He. And if He intends good for you, none can hold back His grace. He makes it fall on whomever He wills of His servants. He is the Forgiving, the Merciful.",
    "Say, “O people! The truth has come to you from your Lord. Whoever is guided, is guided for himself. And whoever strays, strays only against himself. And I am not a guardian over you.”",
    "And follow what is revealed to you, and be patient until God issues His judgment. And He is the Best of judges."
  ]
}