{
  "id": 11,
  "name": "هود",
  "transliteration": "Hud",
  "translation": "Hud",
  "verses": [
    "Alif. Lam. Ra. A Scripture whose Verses were perfected, then explained. From the presence of One Wise and Aware.",
    "That you shall worship none but God. “I am a warner to you from Him, and a deliverer of good news.”",
    "“And seek forgiveness from your Lord, and turn to Him in repentance. He will grant you a good provision for a stated term, and He will bestow His grace on every possessor of virtue. But if you turn away: then I fear for you the punishment of a formidable Day.”",
    "“To God is your return, and He is capable of everything.”",
    "They wrap their chests to hide from Him. But even as they cover themselves with their clothes, He knows what they hide and what they disclose. He knows what is within the hearts.",
    "There is no moving creature on earth, but its sustenance depends on God. And He knows where it lives and where it rests. Everything is in a Clear Book.",
    "It is He who created the heavens and the earth in six Days—and His Throne was upon the waters—in order to test you; as which of you is best in conduct. And if you were to say, “You will be resurrected after death,” those who disbelieve will say, “This is nothing but obvious witchcraft.”",
    "And if We postpone their punishment until a stated time, they will say, “What holds it back?” On the Day when it overtakes them, it will not be averted from them, and what they ridiculed will besiege them.",
    "If We give the human being a taste of mercy from Us, then We withdraw it from him, he becomes hopeless and ungrateful.",
    "And if We give him a taste of prosperity, after some adversity had touched him, he will say, “My troubles are gone from me.” He becomes happy and proud.",
    "Except those who endure patiently and do good deeds—these will have forgiveness and an immense reward.",
    "Perhaps you wish to disregard some of what is revealed to you. And it stresses you, because they say, “If only a treasure was sent down to him, or an angel came with him.” You are only a warner, and God is Responsible for everything.",
    "Or do they say, “He made it up?” Say, “Then produce ten chapters like it, made up, and call upon whomever you can, apart from God, if you are truthful.”",
    "But if they do not answer you, then know that it was revealed with God's knowledge, and that there is no god except He. Will you then submit?",
    "Whoever desires the life of this world and its glitter—We will fully recompense them for their deeds therein, and therein they will not be defrauded.",
    "These—they will have nothing in the Hereafter except the Fire. Their efforts are in vain therein, and their works are null.",
    "Is someone who possesses clear proof from his Lord, backed by testimony from Him, and preceded by the Book of Moses, a guide and a mercy? These believe in it. But whoever defies it from among the factions: the Fire is his promise. So have no doubt about it. It is the truth from your Lord, but most people do not believe.",
    "And who does more wrong than someone who fabricates lies against God? These will be presented before their Lord, and the witnesses will say, “These are the ones who lied about their Lord.” Surely, God’s condemnation is upon the wrongdoers.",
    "Those who hinder others from God’s path, and seek to make it crooked—and regarding the Hereafter, they are in denial.",
    "These will not escape on earth, and they have no protectors besides God. The punishment will be multiplied for them. They have failed to hear, and they have failed to see.",
    "It is they who have lost their souls, and whatever they fabricated has failed them.",
    "Without a doubt, in the Hereafter, they will be the worst losers.",
    "As for those who believe and do good deeds, and humble themselves before their Lord—these are the residents of Paradise, where they will remain forever.",
    "The parable of the two groups is that of the blind and the deaf, and the seeing and the hearing. Are they equal in comparison? Will you not reflect?",
    "We sent Noah to his people, “I am to you a clear warner.”",
    "“That you shall worship none but God. I fear for you the agony of a painful Day.”",
    "The notables among his people who disbelieved said, “We see in you nothing but a human like us, and we see that only the lowliest among us have followed you, those of immature judgment. And we see that you have no advantage over us. In fact, we think you are liars.”",
    "He said, “O my people! Consider if I stand on clear evidence from my Lord, and He has blessed me with mercy from Himself, but you are blind to it. Can we force you to accept it, even though you are unwilling?”",
    "“O, my people! I ask of you no money for it. My wage is only from God. And I am not about to dismiss those who have believed—they will surely meet their Lord. And I see that you are ignorant people.”",
    "“O, my people! Who would protect me from God, if I were to dismiss them? Will you not give a thought?”",
    "“And I do not say to you that I possess the treasuries of God; nor do I know the future; nor do I claim to be an angel; nor do I say that God will not grant goodness to those you look down upon. God knows best what is within them. If I did, I would be of the wrongdoers.”",
    "They said, “O Noah, you have argued with us, and argued much. Now bring upon us what you threaten us with—if you are truthful.”",
    "He said, “It is God who will bring it upon you—if He wills—and you will not escape it.”",
    "“My advice will not benefit you—much as I desire to advise you—if God intends to confound you. He is your Lord; and to Him, you will be returned.”",
    "Or do they say, “He made it up?” Say, “If I made it up, then my crime falls upon me. And I am innocent of the crimes you commit.”",
    "And it was revealed to Noah: “None of your people will believe, except those who have already believed. So do not be distressed by what they do.”",
    "“And build the Ark, before Our eyes, and with Our inspiration. And do not address Me regarding those who did wrong—they will be drowned.”",
    "And he was building the Ark, and whenever notables among his people passed by him, they would ridicule him. He said, “If you ridicule us, we ridicule you, just as you ridicule.”",
    "“You will know upon whom will come a humiliating punishment, and upon whom will fall lasting suffering.”",
    "And when Our command came, and the volcano erupted, We said, “Board into it a pair of every kind, and your family—except those against whom the sentence has already passed—and those who believe.” But none believed with him except a few.",
    "And he said, “Embark in it. In the name of God be its sailing and its anchorage. My Lord is Forgiving and Merciful.”",
    "And so it sailed with them amidst waves like hills. And Noah called out to his son, who stood apart, “O my son! Embark with us, and be not with the unbelievers.”",
    "He said, “I will take shelter on a mountain—it will protect me from the waters.” He said, “There is no protection from God’s command today, except for him on whom He has mercy.” And the waves surged between them, and he was of the drowned.",
    "And it was said, “O earth, swallow your waters,” and “O sky, clear up.” And the waters receded, and the event was concluded, and it settled on Judi, and it was said, “Away with the wrongdoing people.”",
    "And Noah called out to his Lord, and said, “O My Lord, my son is of my family, and Your promise is true, and You are the Wisest of judges.”",
    "He said, “O Noah, he is not of your family—he was of unrighteous conduct. So do not ask Me about what you have no knowledge of. I advise you, lest you be of the ignorant.”",
    "He said, “O My Lord, I seek refuge in You, from asking You about what I have no knowledge of. Unless You forgive me and have mercy on me, I will be of the losers.”",
    "It was said, “O Noah, disembark with peace from Us; and with blessings upon you, and upon communities from those with you. And other communities We will grant prosperity, and then a painful torment from Us will befall them.”",
    "These are accounts from the past that we reveal to you. Neither you nor your people knew them before this. So be patient. The future belongs to the pious.",
    "And to Aad, their brother Hud. He said, “O my people! Worship God! You have no god other than Him. You are nothing but fabricators.”",
    "“O my people, I ask of you no wage for it. My wage rests with Him who originated me. Do you not understand?”",
    "“O my people, seek forgiveness from your Lord, and repent to Him: He will release the sky pouring down upon you, and will add strength to your strength. And do not turn away, guilty.”",
    "They said, “O Hud, you did not bring us any evidence, and we are not about to abandon our gods on your word, and we are not believers in you.”",
    "“We only say that some of our gods have possessed you with evil.” He said, “I call God to witness, and you to witness, that I am innocent of what you associate.",
    "Besides Him. So scheme against me, all of you, and do not hesitate.",
    "I have placed my trust in God—my Lord, and your Lord. There is not a living creature, but He holds it by its forelock. My Lord is on a straight path.",
    "But if you turn away, I have conveyed to you what I was sent to you with. And my Lord will replace you with another people. And you are not harming Him in the least. My Lord is Guardian over everything.”",
    "And when Our command came, We saved Hud and those who believed with him, by mercy from Us. And We saved them from severe suffering.",
    "That was Aad; they denied their Lord’s messages, and defied His messengers, and followed the command of every stubborn tyrant.",
    "And they were pursued by a curse in this world—and on the Day of Resurrection. Surely Aad denied their Lord. So away with Aad, the people of Hud.",
    "And to Thamood, their brother Saleh. He said, “O my people! Worship God! You have no god other than Him. He initiated you from the earth, and He settled you on it. So seek forgiveness from Him, and turn to Him in repentance. My Lord is Near and Responsive.”",
    "They said, “O Saleh, we had high hopes in you before this. Are you trying to prevent us from worshiping what our forefathers worshiped? We are in serious doubt about what you are calling us to.”",
    "He said, “O, my people! Consider if I stand on clear evidence from my Lord, and He has blessed me with mercy from Himself, who would protect me from God if I were to disobey Him? You add nothing for me except loss.”",
    "“O, my people! This is God’s female camel, a sign for you. So leave her to graze on God’s land, and do her no harm, lest an imminent punishment overtakes you.”",
    "But they hamstrung her. Then he said, “Enjoy yourselves in your homes for three days. This is a prophecy that is infallible.”",
    "And when Our command arrived, We saved Saleh and those who believed with him, by mercy from Us, and from the disgrace of that Day. Your Lord is the Strong, the Powerful.",
    "And the Scream overtook those who did wrong, and they became motionless bodies in their homes.",
    "As if they had never prospered there. Thamood denied their Lord, so away with Thamood.",
    "And Our envoys came to Abraham with good news. They said, “Peace.” He said, “Peace.” Soon after, he came with a roasted calf.",
    "But when he saw their hands not reaching towards it, he became suspicious of them, and conceived fear of them. They said, “Do not fear, we are sent to the people of Lot.”",
    "And his wife was standing by, so she laughed. Then We gave her good news of Isaac; and after Isaac, Jacob.",
    "She said, “Alas for me. Would I give birth, when I am an old woman, and this husband of mine is an old man? This is something strange.”",
    "They said, “Do you marvel at God’s command? God’s mercy and His Blessings be upon you, O People of the Household! He is Praiseworthy and Glorious.”",
    "So when Abraham's fear subsided, and the good news had reached him, he began pleading with Us concerning Lot’s people.",
    "Abraham was gentle, kind, devout.",
    "“O Abraham, refrain from this. The command of your Lord has come—they have incurred irreversible punishment.”",
    "And when Our envoys came to Lot, he was distressed on their account, and he felt powerless concerning them, and he said, “This is a terrible day.”",
    "And his people came rushing towards him—they were in the habit of committing sins. He said, “O my people, these are my daughters; they are purer for you. So fear God, and do not embarrass me before my guests. Is there not among you one reasonable man?”",
    "They said, “You certainly know that we have no right to your daughters. You already know what we want.”",
    "He said, “If only I had the strength, or could rely on some strong support.”",
    "They said, “O Lot, we are the envoys of your Lord. They will never reach you. So set out with your family during the cover of the night, and let none of you look back, except for your wife. She will be struck by what will strike them. Their appointed time is the morning. Is the morning not near?”",
    "And when Our command came, We turned it upside down, and We rained on it stones of baked clay.",
    "Marked from your Lord, and not far from the wrongdoers.",
    "And to Median, their brother Shuaib. He said, “O my people! Worship God! You have no god other than Him. Do not diminish the measure and the balance. I see you in good circumstances, but I fear for you the agony of an overwhelming Day.”",
    "“O, my people! Give full measure and weigh with justice, and do not diminish people’s goods, and do not spread corruption in the land.",
    "The remnant from God is better for you—if you are believers. And I am not a keeper over you.”",
    "They said, “O Shuaib, does your manner of praying require that we forsake what our fathers worshipped, or that we give up managing our wealth as we please? You are the one who is tolerant and wise.”",
    "He said, “O my people! Consider: if I stand upon clear evidence from my Lord, and He has blessed me with a good provision from Him. I have no desire to do what I forbid you from doing. I only intend reform to the best of my ability. My success lies with God. In Him I trust; and to Him, I turn.”",
    "“O, my people! Do not let your opposition to me cause you to suffer what was suffered by the people of Noah, or the people of Hud, or the people of Saleh. And the people of Lot are not far from you.”",
    "“And ask your Lord for forgiveness, and turn to Him in repentance. My Lord is Most-Merciful, Most-Loving.”",
    "They said, “O Shuaib, we do not understand much of what you say, and we see you powerless among us. And were it not for your clan, we would have stoned you. You are of no value to us.”",
    "He said, “O my people! Is my clan more important to you than God? And you turned your backs on Him. My Lord comprehends everything you do.”",
    "“O, my people! Do as you may, and so will I. You will know who will be visited by a punishment that will shame him, and who is a liar. So look out; I am on the lookout with you.”",
    "And when Our command arrived, We saved Shuaib and those who believed with him, through mercy from Us, and the Blast struck those who did wrong, so they fell lifeless in their homes.",
    "As if they had never flourished there. So away with Median, as was done away with Thamood.",
    "And We sent Moses with Our messages and a clear mandate.",
    "To Pharaoh and his nobles, but they followed the command of Pharaoh, and Pharaoh’s command was not sound.",
    "He will precede his people on the Day of Resurrection, and he will lead them into the Fire. Evil is the destination to which they are led.",
    "And they were pursued by a curse in this—and on the Day of Resurrection. Miserable is the path they followed.",
    "These are some of the reports of the towns, which We relate to you. Some are still standing, and some were mowed down.",
    "We did not wrong them, but they wronged themselves. Their gods, whom they invoked besides God, availed them nothing when your Lord’s command arrived. In fact, they added only to their ruin.",
    "Such is the grip of your Lord when He seizes the towns while they are doing wrong. His grip is most painful, most severe.",
    "Surely in this is a sign for whoever fears the suffering of the Hereafter. That is a Day for which humanity will be gathered together. That is a Day to be witnessed.",
    "We only postpone it until a predetermined time.",
    "When that Day arrives, no soul will speak except with His permission. Some of them will be miserable, and some will be happy.",
    "As for those who are miserable, they will be in the Fire. They will have there sighing and wailing.",
    "Abiding there, for as long as the heavens and the earth endure, except as your Lord wills. Your Lord is Doer of whatever He wills.",
    "And as for those who are happy, they will be in Paradise, abiding there, for as long as the heavens and the earth endure, except as your Lord wills—a reward without interruption.",
    "Therefore, be not in doubt concerning what these worship. They worship only as their ancestors worshiped before. We will give them their due in full, with no reduction.",
    "We gave Moses the Scripture, but differences arose regarding it. Were it not for a prior word from your Lord, their differences would have been settled. But they are in serious doubt about it.",
    "Your Lord will fully pay all for their deeds. He is Aware of everything they do.",
    "So be upright, as you are commanded, along with those who repented with you. And do not transgress. He is Seeing of everything you do.",
    "And do not incline towards those who do wrong, lest the Fire touches you, and you will have no protectors besides God, and you will not be helped.",
    "Perform the prayer at the borders of the day, and during the approaches of the night. The good deeds take away the bad deeds. This is a reminder for the mindful.",
    "And be patient. God will not waste the reward of the virtuous.",
    "If only there were, among the generations before you, people with wisdom, who spoke against corruption on earth—except for the few whom We saved among them. But the wrongdoers pursued the luxuries they were indulged in, and they became wicked.",
    "Your Lord would never destroy the towns unjustly, while their inhabitants are reforming.",
    "Had your Lord willed, He would have made humanity one community, but they will always differ.",
    "Except those upon whom your Lord has mercy—and for that reason He created them. And the Word of your Lord is final: “I will fill Hell with jinn and humans, all together.”",
    "We relate to you the stories of the messengers to reassure your heart. There has come to you in this the truth, and a lesson, and a reminder for the believers.",
    "And say to those who do not believe, “Act according to your ability; and so will we.”",
    "“And wait! We too are waiting.”",
    "To God belongs the unseen of the heavens and the earth. And to Him, all authority goes back. So worship Him, and rely on Him. Your Lord is never unaware of what you do."
  ]
}