{
  "id": 12,
  "name": "يوسف",
  "transliteration": "Yusuf",
  "translation": "Joseph",
  "verses": [
    "Alif. Lam. Ra. These are the Verses of the Clarifying Book.",
    "We have revealed it an Arabic Quran, so that you may understand.",
    "We relate to you the most accurate history, by revealing to you this Quran. Although, prior to it, you were of the unaware.",
    "When Joseph said to his father, “O my father, I saw eleven planets, and the sun, and the moon. I saw them prostrating to me.”",
    "He said, “O my son, do not relate your vision to your brothers, lest they plot and scheme against you. Satan is man's sworn enemy.",
    "And so your Lord will choose you, and will teach you the interpretation of events, and will complete His favor upon you and upon the House of Jacob, just as He completed it before upon your forefathers Abraham and Isaac. Your Lord is Knowing and Wise.",
    "In Joseph and his brothers are lessons for the seekers.",
    "When they said, “Joseph and his brother are dearer to our father than we are, although we are a bunch. Our father is clearly in the wrong.”",
    "“Kill Joseph, or throw him somewhere in the land, and your father‘s attention will be all yours. Afterward, you will be decent people.”",
    "One of them said, “Do not kill Joseph, but throw him into the bottom of the well; some caravan may pick him up—if you must do something.”",
    "They said, “Father, why don't you trust us with Joseph, although we care for him?”",
    "“Let him go with us tomorrow, to enjoy himself and play; we will take good care of him.”",
    "He said, “It worries me that you would take him away. And I fear that the wolf may eat him, while you are careless of him.”",
    "They said, “If the wolf were to eat him, and we are so many, we would be worthless.”",
    "So they went away with him, and they agreed to put him in the well's bottom. And We inspired him, “You will inform them of this deed of theirs when they are unaware.”",
    "And they returned to their father in the evening, weeping.",
    "They said, “O father, we went racing with one another, and we left Joseph by our belongings, and the wolf ate him. But you will not believe us, even if we were truthful.”",
    "And they brought his shirt, with fake blood on it. He said, “Your souls enticed you to something. Beautiful Patience! And God is the One Whose help is sought against what you claim.”",
    "And a caravan passed by, and they sent their water-carrier. He lowered his bucket, and said, “Good news. There is a boy.” And they hid him as merchandise. But God knew what they did.",
    "And they sold him for a low price—a few coins—they considered him to be of little value.",
    "The man from Egypt who bought him said to his wife, “Take good care of him; he may be useful to us, or we may adopt him as a son.” We thus established Joseph in the land, to teach him the interpretation of events. God prevails over His affairs, but most people do not know.",
    "And when he reached his maturity, We gave him wisdom and knowledge. Thus We reward the righteous.",
    "She in whose house he was living tried to seduce him. She shut the doors, and said, “Come to me!” He said, “God is my refuge! He is my Lord. He has given me a good home. Sinners never succeed.”",
    "She desired him, and he desired her, had he not seen the evidence of his Lord. It was thus that We diverted evil and indecency from him. He is one of Our chosen servants.",
    "And they raced towards the door, and she tore his shirt from behind. At the door, they ran into her master. She said, “What is the punishment for anyone who tried to violate your wife, except imprisonment or a painful punishment?”",
    "He said, “It was she who tried to seduce me.” And a witness from her household suggested: “If his shirt is torn from the front: then she has told the truth, and he is the liar.",
    "But if his shirt is torn from behind: then she has lied, and he is the truthful.”",
    "And when he saw that his shirt is torn from behind, he said, “This is among the schemes of you women—your scheming is serious indeed.”",
    "“Joseph! Turn away from this. And you, woman, ask forgiveness for your sin; you are indeed in the wrong.”",
    "Some women in the city said, “The governor's wife is trying to seduce her servant. She is deeply in love with him. We see that she is clearly lost.”",
    "And when she heard of their gossip, she invited them, and prepared a banquet for them, and gave each of them a knife. And she said, “Come out before them.” And when they saw him, they marveled at him, and they cut their hands, and said, “Good God, this is not a human, this must be a precious angel.”",
    "She said, “Here is the one you blamed me for. I did try to seduce him, but he resisted. And if he does not do what I command him, he will be imprisoned, and he will be one of the despised.”",
    "He said, “My Lord, prison is more desirable to me than what they call me to. Unless You turn their scheming away from me, I may yield to them, and become one of the ignorant.”",
    "So his Lord answered him, and turned their cunning away from him. He is the Hearer, the Knower.",
    "Then it occurred to them—after they had seen the proofs—to imprison him for a time.",
    "Two young men entered the prison with him. One of them said, “I see myself pressing wine.” The other said, “I see myself carrying bread on my head, from which the birds eat. Inform us of its interpretation—we see that you are one of the righteous.”",
    "He said, “No food is served to you, but I informed you about it before you received it. This is some of what my Lord has taught me. I have forsaken the tradition of people who do not believe in God; and regarding the Hereafter, they are deniers.”",
    "“And I have followed the faith of my forefathers: Abraham, Isaac, and Jacob. It is not for us to ascribe any partners to God. This is by virtue of God’s grace upon us and upon the people, but most people do not give thanks.”",
    "“O my fellow inmates: are diverse lords better, or God, the One, the Supreme?”",
    "“You worship apart from him nothing but names, that you have named—you and your ancestors—a practice God never authorized. Judgment rests with none but God. He has commanded that you worship none but Him. This is the upright religion, but most people do not know.",
    "“O, my fellow inmates! One of you will serve his master wine. As for the other, he will be crucified, and birds will eat from his head. Thus the matter you are inquiring about is settled.”",
    "And he said to the one he knew would be released, “Mention me to your master.” But Satan caused him to forget to make mention to his master, so he remained in prison for several years.",
    "And the king said, “I see seven fat cows being eaten by seven lean ones, and seven green spikes and others dried up. O elders: explain my vision to me, if you can interpret visions.”",
    "They said, “Jumbles of dreams, and we know nothing of the interpretation of dreams.”",
    "The one who was released said, having remembered after a time, “I will inform you of its interpretation, so send me out.”",
    "“Joseph, O man of truth! Inform us about seven fat cows being eaten by seven lean ones, and seven green spikes and others dried up, so that I may return to the people, so that they may know.”",
    "He said, “You will cultivate diligently for seven years. But whatever you harvest, leave it in its spikes, except for the little that you eat.”",
    "Then after that will come seven difficult ones, which will consume what you have stored for them, except for the little that you have stored.",
    "Then after that will come a year that brings relief to the people, and during which they will press.",
    "The king said, “Bring him to me!” And when the envoy came to him, he said, “Go back to your master, and ask him about the intentions of the women who cut their hands—my Lord is well aware of their schemes.”",
    "He said, “What was the matter with you—women—when you tried to seduce Joseph?” They said, “God forbid! We know nothing indecent about him.” Then the governor’s wife said, “Now the truth is out. It was I who tried to seduce him, and he is telling the truth.”",
    "“This is so, that he may know that I did not betray him in his absence—and that God does not guide the scheming of the betrayers.”",
    "“And I do not claim to be innocent. The soul commands to evil, except those on whom my Lord has mercy. My Lord is Forgiving and Merciful.”",
    "And the king said, “Bring him to me, and I will keep him for myself.” Then, when he spoke to him, he said, “As of today, you are with us established and secure.”",
    "He said, “Put me in charge of the storehouses of the land; I am honest and knowledgeable.”",
    "And thus We established Joseph in the land, so that he may settle wherever he pleased. We touch with Our mercy whomever We will, and We never waste the reward of the good-doers.",
    "But the reward of the Hereafter is better for those who believe and observe piety.",
    "And Joseph's brothers came, and they entered his presence. He recognized them, but they did not recognize him.",
    "And when he provided them with their supplies, he said, “Bring me a brother of yours from your father. Do you not see that I give full measure, and I am the best of hosts?”",
    "“But if you do not bring him to me, you will receive no measure from me, nor will you come near me.”",
    "They said, “We will solicit him from his father. We will surely do.”",
    "And he said to his servants, “Put their goods in their saddlebags; perhaps they will recognize them when they return to their families, and perhaps they will come back.”",
    "When they returned to their father, they said, “O father, we were denied measure, but send our brother with us, and we will obtain measure. We will take good care of him.”",
    "He said, “Shall I trust you with him, as I trusted you with his brother before? God is the Best Protector, and He is the Most Merciful of the merciful.”",
    "And when they opened their baggage, they found their goods returned to them. They said, “Father, what more can we ask for? Here is our merchandise, fully returned to us. Now we can provide for our family, and protect our brother, and obtain an additional camel-load. That load can be easily secured.”",
    "He said, “I will not send him with you, unless you give me a pledge before God, that you will bring him back to me—unless you get trapped.” And when they gave him their pledge, he said, “God is Guardian over everything we say.”",
    "And he said, “O my sons, do not enter through one gate, but enter through different gates. I cannot avail you anything against God. The decision rests only with God. Upon Him, I rely. And upon Him, let the reliant rely upon.”",
    "And when they entered as their father had instructed them, it did not avail them anything against God, but it fulfilled a need in Jacob’s soul. He was a person of knowledge inasmuch as We taught him, but most people do not know.",
    "And when they entered the presence of Joseph, he drew his brother close to him, and said, “I am your brother; so do not be distressed by what they used to do.”",
    "Then, when he provided them with their supplies, he placed the drinking-cup in his brother’s saddlebag. Then a caller announced, “O people of the caravan, you are thieves.”",
    "They said, as they came towards them, “What are you missing?”",
    "They said, “We are missing the king’s cup. Whoever produces it will receive a camel-load, and I personally guarantee it.”",
    "They said, “By God, you know that we didn’t come to cause trouble in the land, and we are not thieves.”",
    "They said, “What shall be his punishment—if you are lying?”",
    "They said, “His punishment—if it is found in his bag—he will belong to you. Thus we penalize the guilty.”",
    "So he began with their bags, before his brother's bag. Then he pulled it from his brother’s bag. Thus We devised a plan for Joseph. He could not have detained his brother under the king’s law—unless God so willed. We elevate in rank whomever We will; and above every possessor of knowledge, there is a Knower.",
    "They said, “If he has stolen, a brother of his has stolen before.” But Joseph kept it to himself, and did not disclose it to them. He said, “You are in a bad situation, and God is Aware of what you claim.”",
    "They said, “O noble prince, he has a father, a very old man, so take one of us in his place. We see that you are of the good-doers.”",
    "He said, “God forbid, that we should detain anyone except whom we found our property with him. For then, we would be unjust.”",
    "And when they despaired of him, they had a private conversation. Their eldest said, “Don’t you know that your father received a pledge from you before God; and in the past, you neglected Joseph? I will not leave this land until my father permits me, or God decides for me; for He is the Best of deciders.”",
    "“Go back to your father, and say, ‘Father, your son has committed theft. And we testify only to what we know, and we could not guard against the unforeseen.’”",
    "“And ask the town where we were, and the caravan in which we came. We are being truthful.”",
    "He said, “No! Your souls tempted you into something. Patience is a virtue. Perhaps God will bring them all back to me. He is the Knowing, the Wise.”",
    "Then he turned away from them, and said, “O my bitterness for Joseph.” And his eyes turned white with grief, and he became depressed.",
    "They said, “By God, you will not stop remembering Joseph, until you have ruined your health, or you have passed away.”",
    "He said, “I complain of my sorrow and grief to God alone, and I know from God what you do not know.”",
    "“O my sons, go inquire about Joseph and his brother, and do not despair of God's comfort. None despairs of God's comfort except the disbelieving people.”",
    "Then, when they entered his presence, they said, “Mighty governor, adversity has afflicted us and our family. And we have brought scant merchandise. But give us full measure and be charitable towards us—God rewards the charitable.”",
    "He said, “Do you realize what you did with Joseph and his brother, in your ignorance?”",
    "They said, “Is that you, Joseph?” He said, “I am Joseph, and this is my brother. God has been gracious to us. He who protects himself and perseveres—God never fails the reward of the virtuous.”",
    "They said, “By God! God has preferred you over us, and we were at fault.”",
    "He said, “There is no blame on you today. God will forgive you. He is the Most Merciful of the merciful.”",
    "“Go with this shirt of mine, and lay it over my father’s face, and he will recover his sight. And bring your whole family to me.”",
    "As the caravan set out, their father said, “I sense the presence of Joseph, although you may think I am senile.”",
    "They said, “By God, you are still in your old confusion.”",
    "Then, when the bearer of good news arrived, he laid it over his face, and he regained his sight. He said, “Did I not tell you that I know from God what you do not know?”",
    "They said, “Father, pray for the forgiveness of our sins; we were at fault.”",
    "He said, “I will ask my Lord to forgive you. He is the Forgiving, the Most Merciful.”",
    "Then, when they entered the presence of Joseph, he drew his parents close to him, and said, “Enter Egypt, God willing, safe and secure.”",
    "And he elevated his parents on the throne, and they fell down before him, bowing. He said, “Father, this is the fulfillment of my vision of long ago. My Lord has made it come true. He was good to me when he released me from prison, and brought you out of the wilderness—after Satan sowed conflict between me and my brothers. My Lord is Most Kind towards whom He wills. He is the All-Knowing, the All-Wise.”",
    "“My Lord, You have given me some authority, and You taught me some interpretation of events. The Originator of the heavens and the earth. You are my Protector in this life and the Hereafter. Receive my soul in submission, and admit me into the company of the righteous.”",
    "These are among the accounts of the unseen which We reveal to you. You were not with them when they plotted and agreed on a plan.",
    "But most people, for all your eagerness, are not believers.",
    "You ask them no wage for it. It is only a reminder to all people.",
    "How many a sign in the heavens and the earth do they pass by, yet they turn away from them?",
    "Most of them do not believe in God unless they associate others.",
    "Do they feel secure that a covering of punishment from God will not come upon them? Or that the Hour will not come upon them suddenly, while they are unaware?",
    "Say, “This is my way: I invite to God, based on clear knowledge—I, and whoever follows me. Glory be to God, and I am not of the associators.”",
    "We did not send before you except men, whom We inspired, from the people of the towns. Have they not roamed the earth and seen the consequences for those before them? But the Home of the Hereafter is better for those who are righteous. Do you not understand?",
    "Until, when the messengers have despaired and thought that they were rejected, Our help came to them. We save whomever We will, and Our severity is never averted from the guilty people.",
    "In their stories is a lesson for those possessed of insight. This is not a fabricated tale, but a confirmation of what came before it, and a detailed explanation of all things, and guidance and mercy for people who believe."
  ]
}