{
  "id": 16,
  "name": "النحل",
  "transliteration": "an-Nahl",
  "translation": "The Bee",
  "verses": [
    "The command of God has come, so do not rush it. Glorified and Exalted is He, above what they associate.",
    "He sends down the angels with the Spirit by His command, upon whom He wills of His servants: “Give warning that there is no god except I, and be conscious of Me.”",
    "He created the heavens and the earth with justice. Exalted is He above the partners they ascribe.",
    "He created the human being from a drop, and he becomes an open adversary.",
    "And the livestock—He created them for you. In them is warmth and benefits for you; and of them, you eat.",
    "And there is beauty in them for you, when you bring them home, and when you take them out to pasture.",
    "And they carry your loads to a territory you could not reach without significant hardship. Your Lord is Gentle and Merciful.",
    "And horses, and mules, and donkeys—for you to ride, and for luxury. And He creates what you do not know.",
    "It is upon God to point out the path, but some of them are deviant. Had He willed, He would have guided you all.",
    "It is He Who sends down water from the sky, from which you have drink. And with it grows vegetation for grazing.",
    "And He produces for you grains, and olives, and date-palms, and grapevines, and every kind of fruit. Surely in this is a sign for people who think.",
    "And He regulated the night and the day for you, and the sun, and the moon. And the stars are governed by His laws. Surely in this are signs for people who comprehend.",
    "And whatever He created for you on earth is of diverse colors. Surely in this is a sign for people who notice.",
    "And it is He who made the sea subservient, so that you may eat tender meat from it, and extract from it ornaments that you wear. And you see the ships plowing through it, so that you may seek His bounties, so that you may give thanks.",
    "And He placed mountains on earth, lest it shifts with you; and rivers, and pathways, so that you may be guided.",
    "And landmarks. And by the stars, they are guided.",
    "Is He Who creates, like he who does not create? Will you not reflect?",
    "And if you were to count God’s favors, you could not number them. God is Forgiving and Merciful.",
    "And God knows what you hide and what you disclose.",
    "But those whom they call upon apart from God create nothing, and are themselves created.",
    "They are dead, lifeless, and they do not know when they will be resurrected.",
    "Your God is one God. As for those who do not believe in the Hereafter: their hearts are in denial, and they are arrogant.",
    "Undoubtedly God knows what they hide and what they disclose. He does not like the arrogant.",
    "And when it is said to them, “What did your Lord send down?” They will say, “Legends of the ancients.”",
    "Let them carry their loads in full on the Day of Resurrection, and some of the loads of those they misled without knowledge. Evil is what they carry.",
    "Those before them also plotted, but God came upon their buildings from the foundations, and the roof fell down on them from above them, and the punishment came at them from where they did not expect.",
    "Then, on the Day of Resurrection, He will disgrace them, and say, “Where are My partners on whose account you were defiant?” Those who were given knowledge will say, “Today, shame and misery are upon the unbelievers.”",
    "Those wronging themselves while the angels are taking them away will offer peace: “We were not doing any evil.” “Yes, you were. God is fully aware of what you used to do.”",
    "So enter the gates of Hell, to dwell there forever. Miserable is the residence of the arrogant.",
    "And it will be said to those who maintained piety, “What did your Lord send down?” They will say, “Goodness.” For those who are virtuous in this world, there is goodness. And the Home of the Hereafter is better. How wonderful is the residence of the reverent!",
    "The Gardens of Eternity, which they will enter, beneath which rivers flow, where they will have whatever they please. Thus God rewards the righteous.",
    "Those who are in a wholesome state while the angels are taking them—they will say, “Peace be upon you. Enter Paradise, for what you used to do.”",
    "Are they only waiting for the angels to come to them, or for your Lord’s command to arrive? Those before them did likewise. God never wronged them, but they used to wrong themselves.",
    "So the evils of their deeds assailed them, and what they used to ridicule engulfed them.",
    "Those who associate say, “Had God willed, we would not have worshiped anything besides Him—neither us nor our ancestors—nor would we have prohibited anything besides His prohibitions.” Those before them did likewise. Are the messengers responsible for anything but clear communication?",
    "We sent a messenger to every community: “Worship God, and avoid idolatry.” Some of them God guided, while others deserved misguidance. So travel through the earth, and see what the fate of the deniers was.",
    "Even though you are keen on their guidance, God does not guide those who lead astray, and there are no helpers for them.",
    "And they swear by God, with their most solemn oaths: “God will not resurrect anyone who dies.” Yes indeed, it is a promise binding on Him, but most people do not know.",
    "To make clear for them what they differed about, and for the faithless to know that they were liars.",
    "When We intend for something to happen, We say to it, “Be,” and it becomes.",
    "Those who emigrate for God’s sake after being persecuted, We will settle them in a good place in this world. But the reward of the Hereafter is greater—if they only knew.",
    "Those who are patient and trust in their Lord.",
    "We sent no messengers before you, except men whom We inspired. Ask the people of the Reminder, if you do not know.",
    "With the clarifications and the Divine Books. And We revealed the Reminder to you, so that you may explain to people what was revealed to them, and so that they may think.",
    "Do those who plot evil feel secure that God will not cause the earth to cave in with them? Or that the punishment will not come at them from where they do not perceive?",
    "Or that He will not seize them while they go about? They cannot prevent it.",
    "Or that He will not seize them while in dread? Your Lord is Kind and Merciful.",
    "Have they not considered that whatever God created casts its shadow to the right and to the left, prostrating to God, as they shrink away?",
    "To God prostrates whatever is in the heavens and whatever is on earth: every living creature, and the angels, and with no pride.",
    "They fear their Lord above them, and they do whatever they are commanded.",
    "And God says: “Do not take up two gods. He is only One God. So be in awe of Me.”",
    "To Him belongs whatever is in the heavens and the earth. And religion belongs to Him forever. Will you then revere something other than God?",
    "Whatever blessing you have, is from God. Then, when harm touches you, it is to Him that you groan.",
    "But when He lifts the harm from you, some of you associate others with their Lord.",
    "To show ingratitude for what We have given them. Enjoy yourselves. You will soon know.",
    "And they allocate, to something they do not know, a share of what We have provided for them. By God, you will be questioned about what you used to fabricate.",
    "And they attribute daughters to God—glory be to Him—and for themselves what they desire.",
    "And when one of them receives news of a female, his face darkens, and he chokes with grief.",
    "He hides from the people because of the bad news he was given. Should he keep her in disgrace, or bury her in the dust? Evil is the decision they make.",
    "Those who do not believe in the Hereafter set a bad example, while God sets the Highest Example. He is the Powerful, the Wise.",
    "If God were to hold the people for their injustices, He would not leave upon it a single creature, but He postpones them until an appointed time. Then, when their time arrives, they will not delay it by one hour, nor will they advance it.",
    "And they attribute to God what they dislike, while their tongues utter the lie that theirs is the best. Without a doubt, for them is the Fire, and they will be disregarded.",
    "By God, We sent messengers to communities before you, but Satan beautified their actions for them. He is their master today, and they will have a painful punishment.",
    "We did not reveal the Scripture to you, except that you may clarify for them what they differ about, and guidance and mercy for people who believe.",
    "God sends down water from the sky, and with it, He revives the earth after its death. Surely in this is a sign for people who listen.",
    "And there is a lesson for you in livestock: We give you a drink from their bellies—from between waste and blood, pure milk, pleasant to the drinkers.",
    "And from the fruits of date-palms and grapevines, you derive sugar and wholesome food. Surely in this is a sign for people who understand.",
    "And your Lord inspired the bee: “Set up hives in the mountains, and in the trees, and in what they construct.”",
    "Then eat from all the fruits, and go along the pathways of your Lord, with precision. From their bellies emerges a fluid of varying colors, containing healing for people. Surely in this is a sign for people who reflect.",
    "And God created you; then He makes you die. Some of you will be returned to the meanest age, so that he will no longer learn, after having acquired knowledge. God is All-Knowing, Most Capable.",
    "And God has favored some of you over others in livelihood. Those who are favored would not give away their wealth to their servants, to the extent of making them equal in it. Will they renounce God’s favors?",
    "And God made for you spouses from yourselves. And He produced for you, from your spouses, children, and grandchildren. And He provided you with good things. Will they believe in falsehood and show ingratitude for God’s blessings?",
    "And yet, they serve besides God what possesses no sustenance for them in the heavens, nor on earth—and they are not capable.",
    "So do not cite the examples for God. God knows, and you do not know.",
    "God cites the example of an enslaved servant, who has no power over anything; and someone to whom We have given plentiful provision, from which he spends secretly and openly. Are they equal in comparison? Praise be to God, but most of them do not know.",
    "And God cites the example of two men: one of them is dumb, incapable of anything, a burden on his master. Whichever way he directs him, he achieves nothing good. Is he equal to the one who commands justice and is on a straight path?",
    "To God belongs the hidden of the heavens and the earth. The coming of the Hour is only as the blink of the eye, or even nearer. God is Capable of everything.",
    "And God brought you out of your mothers’ wombs, not knowing anything. And He gave you hearing, and eyesight, and brains—so you may give thanks.",
    "Have they not considered the birds, made subservient in midair? None sustains them except God. Surely in this are signs for people who believe.",
    "And God has given you in your homes habitats for you, and He has given you portable homes from the hide of animals, light to handle when you travel and when you camp. And from their wool, and fur, and hair: furnishings and goods for a while.",
    "And God has provided you with shade from what He created. And He has given you resorts in the mountains. And He has provided you with clothes that protect you from the heat, and armor that protects you from your brutality. Thus He completes His blessings upon you, so that you may submit.",
    "But if they turn away—your only duty is to deliver clearly.",
    "They recognize the blessing of God, then they deny it, as most of them are ungrateful.",
    "On the Day when We raise up a witness from every community. Then those who disbelieved will not be allowed, nor will they be excused.",
    "And when those who did wrong see the punishment, it will not be reduced for them, nor will they be delayed.",
    "And when those who ascribed partners see the partners they ascribed, they will say, “Our Lord, these are our partners whom we used to call upon besides You.” And they will throw at them the words, “You are liars.”",
    "On that Day, they will offer their submission to God, and what they had invented will abandon them.",
    "Those who disbelieve and obstruct from God’s path—We will add punishment to their punishment, on account of the mischief they used to make.",
    "On the Day when We raise from every community a witness against them, from among them, and We bring you as a witness against these. We have revealed to you the Book, explaining all things—and guidance, and mercy, and good news for those who submit.",
    "God commands justice, goodness, and generosity towards relatives. And He forbids immorality, injustice, and oppression. He instructs you, so that you may remember.",
    "Fulfill your promise to God when you make a promise, and do not break your oaths after confirming them, having made God your guarantor—God knows whatever you do.",
    "And do not be like her who unravels her yarn, breaking it after it was strong: using your oaths as means of deceiving one another, so that one community may be more prosperous than another. God is testing you by this. And on the Day of Resurrection, He will clarify for you everything you differed about.",
    "Had God willed, He would have made you a single community. But He leads astray whom He wills, and He guides whom He wills. And you will be questioned about what you used to do.",
    "And do not use your oaths as means of deceiving one another, lest a foot slips after being firm, and you taste misery because you hindered from God’s path, and you suffer a terrible punishment.",
    "And do not sell your promise to God for a small price. What is with God is better for you—if you only knew.",
    "Whatever you have runs out, but whatever God has is everlasting. And We will reward those who are patient according to the best of their deeds.",
    "Whoever works righteousness, whether male or female, while being a believer, We will give him a good life—and We will reward them according to the best of what they used to do.",
    "When you read the Quran, seek refuge with God from Satan the outcast.",
    "He has no authority over those who believe and trust in their Lord.",
    "His authority is only over those who follow him, and those who associate others with Him.",
    "When We substitute a verse with another verse—and God knows best what He reveals—they say, “You are a fraud.” But most of them do not know.",
    "Say, “The Holy Spirit brought it down from your Lord, with the truth, to stabilize those who believe, and as guidance and good news for those who submit.”",
    "And We are well aware that they say, “It is a human who teaches him.” But the language of the person they implicate is foreign, while this is clear Arabic language.",
    "Those who do not believe in the signs of God—God will not guide them, and for them is a painful punishment.",
    "It is those who do not believe in God’s revelations who fabricate lies. These are the liars.",
    "Whoever disbelieves in God after having believed—except someone who is coerced, while his heart is at peace in faith—but whoever willingly opens up his heart to disbelief, upon them falls wrath from God, and for them is a tremendous punishment.",
    "That is because they preferred the worldly life over the Hereafter, and because God does not guide the disbelieving people.",
    "It is they whom God has sealed their hearts, and their hearing, and their sight. It is they who are the heedless.",
    "Without a doubt: in the Hereafter, they will be the losers.",
    "But then, your Lord—for those who migrated after being persecuted, then struggled and persevered—your Lord thereafter is Forgiving and Merciful.",
    "On the Day when every soul will come pleading for itself, and every soul will be paid in full for what it did, and they will not be wronged.",
    "And God cites an example: a town safe and at peace. Its livelihood coming to it abundantly from every direction. But it turned unappreciative of God’s favors, so God made it taste the robe of hunger and fear, because of what they used to craft.",
    "A messenger from among them had come to them, but they denounced him, so the punishment seized them in the midst of their wrongdoing.",
    "So eat from the lawful and good things God provided for you, and be thankful for God’s favor—if it is Him that you worship.",
    "He has forbidden you carrion, and blood, and the flesh of swine, and anything consecrated to other than God. But if someone is compelled by necessity—neither driven by desire nor exceeding—then God is Forgiving and Merciful.",
    "And do not say of falsehood asserted by your tongues, “This is lawful and this is unlawful.” To invent lies and attribute them to God. Those who invent lies and attribute them to God will never succeed.",
    "A little enjoyment—then they will have a painful punishment.",
    "And for those who are Jews: We prohibited what We related to you previously. We did not wrong them, but they used to wrong themselves.",
    "But towards those who do wrongs in ignorance, and then repent afterward and reform: your Lord thereafter is Forgiving and Merciful.",
    "Abraham was an exemplary leader, devoted to God, a monotheist, and was not of the polytheists.",
    "Thankful for His blessings. He chose him and guided him to a straight path.",
    "And We gave him good in this world. And in the Hereafter, he will be among the righteous.",
    "Then We inspired you: “Follow the faith of Abraham, a Monotheist. And he was not of the polytheists.”",
    "The Sabbath was ordained only for those who disagreed about it. Your Lord will judge between them on the Day of Resurrection regarding their disputes.",
    "Invite to your Lord’s Way with wisdom and good advice, and debate with them in the most dignified manner. Your Lord is aware of those who stray from His path, and He is aware of those who are guided.",
    "And if you were to retaliate, retaliate to the same degree as the injury done to you. But if you resort to patience—it is better for the patient.",
    "So be patient. Your patience is only from God. And do not grieve over them, nor be distressed by their schemes.",
    "God is with those who are righteous and those who are virtuous."
  ]
}