{
  "id": 18,
  "name": "الكهف",
  "transliteration": "al-Kahf",
  "translation": "The Cave",
  "verses": [
    "Praise be to God, who revealed the Book to His servant, and allowed no distortion in it.",
    "Valuable—to warn of severe punishment from Himself; and to give good news to the believers who do good works, that they will have an excellent reward.",
    "In which they will remain forever.",
    "And to warn those who say, “God has begotten a son.”",
    "They have no knowledge of this, nor did their forefathers. Grave is the word that comes out of their mouths—they say nothing but a lie.",
    "Perhaps you may destroy yourself with grief, chasing after them, if they do not believe in this information.",
    "We made what is on earth a decoration for it, to test them, as to which of them is better in conduct.",
    "And We will reduce whatever is on it into a barren wasteland.",
    "Did you think that the Inhabitants of the Cave and the Inscription were of Our wondrous signs?",
    "When the youths took shelter in the cave, they said, “Our Lord, give us mercy from Your Presence, and bless our affair with guidance.”",
    "Then We sealed their ears in the cave for a number of years.",
    "Then We awakened them, to know which of the two groups would better estimate the length of their stay.",
    "We relate to you their story in truth. They were youths who believed in their Lord, and We increased them in guidance.",
    "And We strengthened their hearts, as they stood up and said, “Our Lord is the Lord of the heavens and the earth. We will never call upon any god besides Him, for then we would be uttering an outrage.”",
    "“These, our people, have taken gods below Him. Why don’t they produce clear proof of them? Who does more wrong than he who invents lies and attributes them to God?”",
    "“Now that you distanced yourselves from them, and from what they worship besides God, take shelter in the cave. Your Lord will unfold His mercy on you, and will set your affair towards ease.”",
    "And you would have seen the sun, when it rose, veering away from their cave towards the right; and when it sets, veering away from them to the left, as they lay in the cave's midst. That is among the wonders of God. Whomever God guides is rightly guided. But whomever He leaves to stray, you will never find for him a guiding mentor.",
    "And you would think them awake, although they were asleep. And We turned them over to the right, and to the left, and their dog stretching its paws at the threshold. Had you looked at them, you would have fled away from them, filled with fear.",
    "Even so, We awakened them, so that they may ask one another. A spokesperson among them said, “How long have you stayed?” They said, “We have stayed a day or part of a day.” They said, “Your Lord knows best how long you have stayed.” “Send one of you to the city, with this money of yours, and let him see which food is most suitable, and let him bring you some supply from it. And let him be discrete—and make no one aware of you.”",
    "“If they discover you, they will stone you, or force you back into their religion, and then you will never succeed.”",
    "And so it was, that We caused them to be discovered. So that they would know that God’s promise is true—and that there is no doubt about the Hour. As they were arguing their case among themselves, they said, “Build a structure over them.” Their Lord knows best about them. But those who prevailed over their case said, “We will build a place of worship over them.”",
    "They will say, “Three, and their fourth being their dog.” And they will say, “Five, and their sixth being their dog,” guessing at the unknown. And they will say, “Seven, and their eighth being their dog.” Say, “My Lord knows best their number.” None knows them except a few. So do not argue about them except with sure knowledge, nor consult any of them about them.",
    "And never say about anything, “I will do that tomorrow.”",
    "Without adding, “God willing.” And remember your Lord when you forget, and say, “Perhaps my Lord will guide me to nearer than this in integrity.”",
    "And they remained in their cave for three hundred years, adding nine.",
    "Say, “God knows best how long they remained.” To Him belongs the mystery of the heavens and the earth. How well He sees. How well He hears. They have no guardian other than Him, and He shares His Sovereignty with no one.",
    "And read what was revealed to you from your Lord’s Book. There is no changing His words. And you will find no refuge, except with Him.",
    "And content yourself with those who pray to their Lord morning and evening, desiring His Attention. And do not turn your eyes away from them, desiring the glitter of this world. And do not obey him whose heart We made oblivious to Our remembrance—so he follows his own whims, and his priorities are confused.",
    "And say, “The truth is from your Lord. Whoever wills—let him believe. And whoever wills—let him disbelieve”. We have prepared for the unjust a Fire, whose curtains will hem them in. And when they plead for relief, they will be relieved with water like molten metal, which scalds the faces. What a horrible drink, and what an evil resting-place.",
    "As for those who believe and do good deeds—We will not waste the reward of those who work righteousness.",
    "It is they who will have the Gardens of Eden, beneath which rivers flow. There they will be adorned with bracelets of gold, and will wear green garments of silk and brocade, reclining on couches. What a wonderful reward, and what an excellent resting-place.",
    "And cite for them the parable of two men: To one of them, We granted two vineyards, and We surrounded them with date-palms, and We placed between them crops.",
    "Both gardens produced their harvest, never falling short, and We made a river gush through them.",
    "And he had other resources. He said to his friend, as he conversed with him, “I am more wealthy, and superior in manpower.”",
    "And he entered his garden while wronging himself, saying, “I do not think this will ever perish.”",
    "“And I do not think the Hour is coming. And even if I am returned to my Lord, I will find something better than this in return.”",
    "His friend said to him, as he conversed with him, “Are you being ungrateful to Him who created you from dust, then from a drop, then evolved you into a man?",
    "But as for me: He is God, my Lord, and I never associate anyone with my Lord.",
    "If only, when you entered your garden, you said, ‘This is what God has willed. There is no power except through God.’ Even though you see me inferior to you in wealth and children.",
    "Perhaps my Lord will give me something better than your garden, and unleash against it a thunderbolt from the sky, so it becomes a slippery wasteland.",
    "Or its water dries up, and you can never reclaim it.”",
    "And ruin closed in on his crops. And so he began wringing his hands over what he had invested in it, as it lays collapsed on its trellises, and he was saying, “I wish I never associated anyone with my Lord.”",
    "He had no manpower to help him besides God, nor could he help himself.",
    "That is because authority belongs to God, the Real. He is Best in rewarding, and Best for consequence.",
    "And cite for them the parable of the present life: like water that We send down from the sky; and is absorbed by the plants of the earth; then it becomes debris, scattered by the winds. God has absolute power over everything.",
    "Wealth and children are the decorations of the present life. But the things that last, the virtuous deeds, are better with your Lord for reward, and better for hope.",
    "On the Day when We set the mountains in motion, and you see the earth emerging, and We gather them together, and leave none of them behind.",
    "They will be presented before your Lord in a row. “You have come to Us as We created you the first time. Although you claimed that We will not set an appointment for you.”",
    "And the book will be placed, and you will see the guilty fearful of its contents. And they will say, “Woe to us! What is with this book that leaves nothing, small or big, but it has enumerated it?” They will find everything they had done present. Your Lord never wrongs anyone.",
    "And We said to the angels, “Prostrate before Adam.” So they prostrated, except for Iblis. He was of the jinn, and he deviated from the command of his Lord. Will you take him and his descendants as friends instead of Me, although they are your enemy? What an evil alternative for the wrongdoers!",
    "I never called them to witness the creation of the heavens and the earth, nor their own creation, nor would I take the misleaders as assistants.",
    "On the Day when He says, “Call upon those you claimed were My associates.” So they will call on them, but they will not answer them. And We will place a cliff between them.",
    "And the criminals will see the Fire, and realize that they will tumble into it. And they will find no deliverance from it.",
    "We have elaborated in this Quran for the people every kind of example, but the human being is a most argumentative being.",
    "What prevented people from believing, when guidance has come to them, and from seeking their Lord’s forgiveness? Unless they are waiting for the precedent of the ancients to befall them, or to have the punishment come upon them face-to-face.",
    "We do not send the messengers, except as deliverers of good news and warners. Those who disbelieve argue with false arguments, to discredit the truth with it. They take My Verses, and the warnings, for a joke.",
    "And who does more wrong than he, who, when reminded of his Lord’s revelations, turns away from them, and forgets what his hands have forwarded? We have placed coverings over their hearts—leaving them unable to understand it—and deafness in their ears. And if you invite them to guidance, they will not be guided, ever.",
    "And your Lord is the Forgiver, Full of Mercy. If He were to call them to account for what they have committed, He would have rushed the punishment for them. But they have an appointment from which they will find no escape.",
    "And these towns: We destroyed them when they committed injustices, and We set for their destruction an appointed time.",
    "And when Moses said to his young assistant, “I will not give up until I reach the junction of the two seas, even if I travel for ages.”",
    "So when they reached the junction between them, they forgot about their fish. It made its way into the sea, slipping away.",
    "When they went further, he said to his assistant, “Bring us our lunch; we were exposed in our travel to much fatigue.”",
    "He said, “Do you remember when we rested by the rock? I forgot about the fish. None made me forget to mention this, except Satan. And so it made its way to the sea, amazingly.”",
    "He said, “That is what we were looking for.” And so they turned back, retracing their footsteps.",
    "Then they found a servant of Ours, whom We had blessed with mercy from Us, and had taught him knowledge from Our Own.",
    "Moses said to him, “May I follow you, so that you may teach me some of the guidance you were taught?”",
    "He said, “You will not be able to endure with me.",
    "And how will you endure what you have no knowledge of?”",
    "He said, “You will find me, God willing, patient; and I will disobey none of your orders.”",
    "He said, “If you follow me, do not ask me about anything—until I clarify it for you.”",
    "So they set out. Until, when they embarked on a boat, he made a hole in it. He said, “Did you make a hole in it, to drown its passengers? You have done something awful.”",
    "He said, “Did I not say that you will be unable to endure with me?”",
    "He said, “Do not rebuke me for forgetting, and do not make my course difficult for me.”",
    "Then they set out. Until, when they came across a young boy, he killed him. He said, “Did you kill a pure soul, who killed no one? You have done something terrible.”",
    "He said, “Did I not tell you that you will be unable to endure with me?”",
    "He said, “If I ever question you about anything after this, then do not keep me in your company. You have received sufficient excuses from me.”",
    "So they set out. Until, when they reached the inhabitants of a town, they asked them for food, but they refused to give them hospitality. There they found a wall about to collapse, and he repaired it. He said, “If you wanted, you could have obtained payment for it.”",
    "He said, “This is the parting between you and me. I will inform you of the interpretation of what you could not endure.",
    "As for the boat, it belonged to paupers working at sea. I intended to damage it because there was a king coming after them seizing every boat by force.",
    "And as for the boy, his parents were believers, and we feared that he would overwhelm them with rebellion and disbelief.",
    "So we wanted their Lord to replace him with someone better in integrity, and closer to kindness.",
    "And as for the wall, it belonged to two orphan boys in the city. Beneath it was a treasure belonging to them. Their father was righteous. Your Lord wanted them to reach their maturity and then extract their treasure—as a mercy from your Lord. I did not do it of my own accord. This is the interpretation of what you could not bear patiently.”",
    "And they ask you about Zul-Qarnain. Say, “I will tell you something about him.”",
    "We established him in the land, and We gave him the means of everything.",
    "So he pursued a course.",
    "Until, when he reached the setting of the sun, he found it setting in a murky spring, and he found a people in its vicinity. We said, “O Zul-Qarnain: you may either inflict a penalty, or else treat them kindly.”",
    "He said, “As for him who does wrong: we will penalize him, then he will be returned to his Lord, and He will punish him with an unheard-of torment.”",
    "“But as for him who believes and acts righteously: for him is the finest reward, and We will issue easy commands for him.”",
    "Then he pursued a course.",
    "Until, when he reached the rising of the sun, he found it rising on a people for whom We had provided no shade from it.",
    "So it was. And We had full knowledge of everything he had.",
    "Then he pursued a course.",
    "Until, when he reached between the two barriers, he found beside them a people who could hardly understand a word.",
    "They said, “O Zul-Qarnain! Gog and Magog are spreading chaos throughout the land. Can we pay you, to build between us and them a wall?”",
    "He said, “What my Lord has empowered me with is better. But assist me with manpower, and I will build between you and them a dam.”",
    "“Bring me blocks of iron.” And when he had leveled the two cliffs, he said, “Blow.” And when he made it as fire, he said, “Bring me tar to pour over it.”",
    "So they could not climb it, nor could they dig through it.",
    "He said, “This is a mercy from my Lord. But when the promise of my Lord comes true, He will crumble it to dust. And my Lord’s promise is true.”",
    "On that Day, We will leave them to surge over one another. And the Trumpet will be blown, and We will gather them together.",
    "On that Day, We will present the unbelievers to Hell, all displayed.",
    "Those whose eyes were veiled from My remembrance, and were unable to hear.",
    "Do those who disbelieve think they can take My servants as lords instead of Me? We have prepared Gehenna for the hospitality of the faithless.",
    "Say, “Shall we inform you about the worst losers' actions?”",
    "“Those whose efforts in this world are misguided, while they assume that they are virtuous in their works.”",
    "It is they who reject the communications of their Lord, and in the meeting with Him. So their works are in vain. And on the Day of Resurrection, We will consider them of no weight.",
    "That is their payback: Hell. For having disbelieved, and for their taking My revelations and My messengers for a joke.",
    "As for those who believe and do righteous deeds: they will have the Gardens of Paradise for hospitality.",
    "Where they will be forever, desiring no change therefrom.",
    "Say, “If the ocean were ink for the Words of my Lord, the ocean would run out, before the Words of my Lord run out,” even if We brought the like of it to replenish it.",
    "Say, “I am only a human being like you, being inspired that your God is One God. Whoever hopes for the meeting with his Lord, let him work righteousness, and associate no one in the worship of his Lord.”"
  ]
}