{
  "id": 2,
  "name": "البقرة",
  "transliteration": "al-Baqarah",
  "translation": "The Cow",
  "verses": [
    "Alif. Lam. Meem.",
    "This is the Book in which there is no doubt, guidance for the righteous.",
    "Those who believe in the Unseen, and perform the prayers, and donate from what We have provided for them.",
    "And those who believe in what was revealed to you, and in what was revealed before you, and are certain of the Hereafter.",
    "These are upon guidance from their Lord. These are the successful.",
    "As for those who disbelieve—it is the same for them, whether you have warned them, or have not warned them—they do not believe.",
    "God has sealed their hearts and their hearing, and over their vision is a veil. They will have a severe punishment.",
    "And among the people are those who say, “We believe in God and in the Last Day,” but they are not believers.",
    "They try to deceive God and those who believe, but they deceive none but themselves, and they are unaware.",
    "In their hearts is a disease, and God has increased them in disease. They will have a painful punishment for having lied.",
    "And when it is said to them, “Do not work corruption on earth,” they say, “We are only working righteousness.”",
    "In fact, it is they who are the workers of corruption, but they are unaware.",
    "And when it is said to them, “Believe as the people have believed,” they say, “Shall we believe as the fools have believed?” In fact, it is they who are the fools, but they do not know.",
    "And when they come across those who believe, they say, “We have believed.” But when they are alone with their devils, they say, “We are with you, we were only mocking.”",
    "It is God who mocks them, and He leaves them bewildered in their transgression.",
    "It is they who have traded guidance for misguidance, so their trade was not profitable, and they are not guided.",
    "Their example is similar to the example of a person who kindles a fire; but when it illuminates his surroundings, God takes away their light, leaving them in darkness—unable to see.",
    "Deaf, dumb, blind. They will not return.",
    "Or like a rainstorm from the sky, in which there is darkness, and thunder, and lightning. They press their fingers into their ears against the thunderclaps, fearing death. But God surrounds the disbelievers.",
    "The lightning almost snatches their sight away. Whenever it illuminates for them, they walk in it. And when darkness comes over them, they stand still. Had God willed, He could have taken away their hearing and their sight. God is capable of all things.",
    "O, people! Worship your Lord, Who created you, and those before you, so that you may attain piety.",
    "He who made the earth a habitat for you, and the sky a structure, and sends water down from the sky, with which He produces fruits for your sustenance. So do not set up rivals to God, knowingly.",
    "And if you are in doubt about what We have revealed to Our servant, then produce a chapter like it, and call your witnesses apart from God, if you are truthful.",
    "But if you do not, and you will not, then beware the Fire whose fuel is people and stones, prepared for the disbelievers.",
    "And give good news to those who believe and do righteous deeds; that they will have gardens beneath which rivers flow. Whenever they are provided with fruit from it, as sustenance, they will say, “This is what we were provided with before,” and they will be given the like of it. And they will have pure spouses in it, and they will abide in it eternally.",
    "God does not shy away from presenting a parable of a gnat, or something above it. As for those who believe, they know that it is the Truth from their Lord. But as for those who disbelieve, they say, “What did God mean by this parable?” He misleads many by it, and He guides many by it, but He misleads none but the wrongdoers.",
    "Those who violate God’s covenant after its confirmation, and sever what God has commanded to be joined, and work corruption on earth. These are the losers.",
    "How can you disbelieve in God, when you were lifeless, and He gave you life, then He will cause you to die, then He will bring you to life, then to Him you will be returned?",
    "It is He who created for you everything on earth, then turned towards heaven, and formed them seven heavens. And He has knowledge of all things.",
    "When your Lord said to the angels, “I am placing a successor on earth.” They said, “Will You place in it someone who will work corruption in it, and shed blood, while we declare Your praises and sanctify You?” He said, “I know what you do not know.”",
    "And He taught Adam the names, all of them. Then He presented them to the angels, and said, “Tell Me the names of these, if you are truthful.”",
    "They said, “Glory be to You! We have no knowledge except what You have taught us. It is you who are the All-Knowing, the All-Wise.”",
    "He said, “O Adam, inform them of their names.” And when he informed them of their names, He said, “Did I not tell you that I know the secrets of the heavens and the earth, and that I know what you disclose and what you conceal?”",
    "And We said to the angels, “Prostrate to Adam.” So they prostrated, except for Iblis. He refused, acted arrogantly, and became of the disbelievers.",
    "We said, “O Adam, inhabit the Garden, you and your wife, and eat from it freely as you please, but do not approach this tree, otherwise you will become of the wrongdoers.”",
    "But Satan caused them to slip from it, and he caused them to depart the state they were in. We said, “Go down, some of you enemies to one another. And on earth, you will have a residence, and enjoyment for a while.”",
    "Then Adam received words from his Lord, so He accepted his repentance. He is the Acceptor of Repentance, the Merciful.",
    "We said, “Descend from it, all of you. Yet whenever guidance comes to you from Me, whoever follows My guidance—they have nothing to fear, nor will they grieve.",
    "But as for those who disbelieve and reject Our revelations—these are the inmates of the Fire—where they will remain eternally.”",
    "O Children of Israel! Remember My favors which I bestowed upon you, and fulfill your pledge to Me, and I will fulfill My pledge to you, and revere Me.",
    "And believe in what I revealed, confirming what you have, and do not be the first to deny it, and do not exchange My revelations for a small price, and be conscious of Me.",
    "And do not mix truth with falsehood, nor conceal the truth knowingly.",
    "And attend to your prayers, and practice regular charity, and bow down with those who bow down.",
    "Do you command people to virtuous conduct, and forget yourselves, while you read the Scripture? Do you not understand?",
    "And seek help through patience and prayer. But it is difficult, except for the humble.",
    "Those who know that they will meet their Lord, and that to Him they will return.",
    "O Children of Israel! Remember My blessing which I bestowed upon you, and that I favored you over all nations.",
    "And beware of a Day when no soul will benefit another in any way, nor will any intercession be accepted on its behalf, nor will any ransom be accepted from it, nor will they be helped.",
    "And when We saved you from Pharaoh’s people. They subjected you to terrible persecution: killing your sons while sparing your women. In that was a severe trial from your Lord.",
    "And recall that We parted the sea for you, so We saved you, and We drowned Pharaoh’s people as you looked on.",
    "And when We appointed forty nights for Moses, then you took to worshiping the calf in his absence, acting wrongfully.",
    "Then We pardoned you after that: so perhaps you would be thankful.",
    "And when We gave Moses the Scripture and the Criterion, so perhaps you would be guided.",
    "And when Moses said to his people, “O my people! You have wronged yourselves by taking up the calf. So repent to your Maker, and kill yourselves. That is best for you with your Maker.” So He redeemed you. He is the Redeemer, the Merciful.",
    "And when you said, “O Moses, we will not believe in you unless we see God plainly.” So the thunderbolt struck you, as you looked on.",
    "Then We resurrected you after your death, so that you may be appreciative.",
    "And We shaded you with clouds, and We sent down to you manna and quails: “Eat of the good things We have provided for you.” They did not wrong Us, but they used to wrong their own souls.",
    "And when We said, “Enter this town, and eat plentifully from it whatever you wish; but enter the gate humbly, and say, ‘Absolve us.' We will forgive your sins, and we will give increase to the virtuous.”",
    "But the wrongdoers among them substituted words other than those given to them, so We sent down on the wrongdoers a plague from heaven, because of their wicked behavior.",
    "And when Moses prayed for water for his people. We said, “Strike the rock with your staff.” And twelve springs gushed out from it, and each tribe recognized its drinking-place. “Eat and drink from God’s provision, and do not corrupt the earth with disobedience.”",
    "And when you said, “O Moses, we cannot endure one kind of food. So call upon your Lord on our behalf: that He may produce for us of what the earth grows: of its herbs, its cucumbers, its garlic, its lentils, and its onions.” He said, “Will you exchange what is good for what is worse? Go down to a town, and you will have what you asked for.” They were stricken with disgrace and misery, and incurred wrath from God. That was because they rejected God’s revelations and wrongfully killed the prophets. That was because they disobeyed and committed aggression.",
    "Those who believed, and those who are Jewish, and the Christians, and the Sabeans—whoever believes in God and the Last Day, and acts righteously—will have their reward with their Lord. They have nothing to fear, nor will they grieve.",
    "And when We received a pledge from you, and We raised the Mount above you: “Hold firmly to what we have given you, and remember what is in it, so that you may attain righteousness.”",
    "Yet you turned away afterward. Were it not for God’s grace and mercy towards you, you would have been among the losers.",
    "And you knew those among you who violated the Sabbath. We said to them, “Be despicable apes!”",
    "Thus We made it a deterrent for their generation, and for future generations, and a lesson for the reverent.",
    "And when Moses said to his people, “God commands you to sacrifice a heifer.” They said, “Do you make a mockery of us?” He said, “God forbid that I should be so ignorant.”",
    "They said, “Call upon your Lord for us, to show us which one.” He said, “He says she is a heifer, neither too old, nor too young, but in between. So do as you are commanded.”",
    "They said, “Call upon your Lord for us, to show us what her color is.” He said, “He says she is a yellow heifer, bright in color, pleasing to the beholders.”",
    "They said, “Call upon your Lord for us, to show us which one; the heifers look alike to us; and God willing, we will be guided.”",
    "He said, “He says she is a heifer, neither yoked to plow the earth, nor to irrigate the field; sound without blemish.” They said, “Now you have come with the truth.” So they slew her, though they almost did not.",
    "And when you killed a person, and put the blame on each other; but God was to expose what you were hiding.",
    "We said, “Strike him with part of it.” Thus God gives life to the dead. And He shows you His signs, so that you may understand.",
    "Then, after that, your hearts hardened. They were as rocks, or even harder. For there are rocks from which rivers gush out, and others that splinter and water comes out of them, and others that fall in awe of God. God is not unaware of what you do.",
    "Do you hope that they will believe in you, when some of them used to hear the Word of God, and then deliberately distort it, even after understanding it?",
    "And when they come across those who believe, they say, “We believe.” But when they come together privately, they say, “Will you disclose to them knowledge God has revealed to you, so that they may use it against you before your Lord?” Do you not understand?",
    "Do they not know that God knows what they keep secret and what they declare?",
    "And among them are uneducated who know the Scripture only through hearsay, and they only speculate.",
    "So woe to those who write the Scripture with their own hands, and then say, “This is from God,” in order to exchange it for a little price. Woe to them for what their hands have written, and woe to them for what they earn.",
    "And they say, “The Fire will not touch us except for a number of days.” Say, “Have you received a promise from God—God never breaks His promise—or are you saying about God what you do not know?”",
    "Indeed, whoever commits misdeeds, and becomes besieged by his sins—these are the inmates of the Fire, where they will dwell forever.",
    "As for those who believe and do righteous deeds—these are the inhabitants of Paradise, where they will dwell forever.",
    "We made a covenant with the Children of Israel: “Worship none but God. And be good to parents, and relatives, and orphans, and the needy. And speak nicely to people, and pray regularly, and give alms.” Then you turned away, except for a few of you, backsliding.",
    "And We made a covenant with you: “Do not shed the blood of your own, nor evict your own from your homes.” You agreed and were witnesses.",
    "But here you are, killing your own, and expelling a group of your own from their homes—conspiring against them in wrongdoing and hostility. And when they come to you as captives, you ransom them, although it was forbidden to you. Is it that you believe in part of the Scripture, and you reject a part? What is the repayment for those among you who do that, except humiliation in this life of this world? And on the Day of Resurrection, they will be assigned to the most severe torment. God is not unaware of what you do.",
    "It is they who have purchased the present life at the price of the Hereafter. So the punishment will not be reduced for them, nor will they be helped.",
    "We gave Moses the Scripture, and We sent after him successive messengers. And We gave Jesus, son of Mary, the clear proofs, and We supported him with the Holy Spirit. Is it that whenever a messenger comes to you with anything your souls do not desire, you grew arrogant, calling some liars, and killing others?",
    "And they said, “Our hearts are sealed.” In fact, God has cursed them for their ingratitude. They have little faith.",
    "And when a scripture came to them from God, confirming what they have—although they were previously seeking help against those who disbelieved—but when there came to them what they recognized, they denied it. So God’s curse is upon the disbelievers.",
    "Miserable is what they sold their souls for—rejecting what God has revealed, out of resentment that God would reveal His grace upon whomever He wills from among His servants. So they incurred wrath upon wrath. And the unbelievers will have a demeaning punishment.",
    "And when it is said to them, “Believe in what God has revealed,” they say, “We believe in what was revealed to us,” and they deny what came afterward, although it is the truth, confirming what they have. Say, “Then why did you murder God’s prophets before, if you are believers?”",
    "Moses came to you with clear proofs, yet you adopted the calf in his absence, and you were in the wrong.",
    "And We made a covenant with you, and We raised the Mount above you: “Take what We have given you firmly, and listen.” They said, “We hear and disobey.” And their hearts became filled with the love of the calf because of their disbelief. Say, “Dreadful is what your faith prompts you to do—if you are believers.”",
    "Say, “If the Final Home with God is yours alone, to the exclusion of all other people, then wish for death if you are truthful.”",
    "But they will never wish for it, because of what their hands have forwarded. And God is aware of the unjust.",
    "You will find them, of all humankind, the most eager for life, even more than the associators. Every one of them wishes to live a thousand years, but to be granted a long life will not nudge him from the punishment. God sees everything they do.",
    "Say, “Whoever is hostile to Gabriel—it is he who revealed it to your heart by God’s leave, confirming what preceded it, and guidance and good news for believers.”",
    "Whoever is hostile to God, and His angels, and His messengers, and Gabriel, and Michael—God is hostile to the faithless.",
    "We have revealed to you clear Verses, and none reject them except the sinners.",
    "Is it not that whenever they make a covenant, some of them toss it aside? In fact, most of them do not believe.",
    "And when a messenger from God came to them—confirming what they have—a faction of those who were given the Book threw the Book of God behind their backs, as if they do not know.",
    "And they followed what the devils taught during the reign of Solomon. It was not Solomon who disbelieved, but it was the devils who disbelieved, teaching people witchcraft, and what was revealed in Babylon to the two angels Harut and Marut. Although they taught no one without declaring, “We are a test, so do not lose faith.” But they learned from them the means of causing separation between man and his wife. But they cannot harm anyone except with God's consent. And they learned what harms them, and does not benefit them. Yet they knew, that whoever deals in it, will have no share in the Hereafter. Evil is what they sold their souls for—if they only knew.",
    "Had they believed and been righteous, the reward from God would be better—if they only knew.",
    "O you who believe! Do not say ambiguous words, but say words of respect, and listen. The disbelievers will have a painful punishment.",
    "It is never the wish of the disbelievers from among the People of the Scripture, nor of the associators, that any good should come down to you from your Lord. But God assigns His mercy to whom He wills. God is Possessor of Immense Grace.",
    "We never nullify a verse, nor cause it to be forgotten, unless We bring a better one or an equivalent one. Do you not know that God is capable of all things?",
    "Do you not know that to God belongs the kingdom of the heavens and earth; and that besides God, you have neither guardian nor helper?",
    "Or do you intend to ask your Messenger as Moses was asked before? Whoever exchanges belief for unbelief has strayed from the right path.",
    "Many among the People of the Scripture wish to turn you back into unbelievers after you have believed, out of their envy, after the truth has become clear to them. But pardon and overlook, until God brings His command. God has power over all things.",
    "And perform the prayer, and give the purifying alms. Whatever good you forward for yourselves, you will find it with God. God is Seeing of everything you do.",
    "And they say, “None will enter Heaven unless he is a Jew or a Christian.” These are their wishes. Say, “Produce your proof, if you are truthful.”",
    "In fact, whoever submits himself to God, and is a doer of good, will have his reward with his Lord—they have nothing to fear, nor shall they grieve.",
    "The Jews say, “The Christians are not based on anything.” And the Christians say, “The Jews are not based on anything.” Yet they read the Scripture. Likewise, the ignorant said the same thing. God will judge between them on Resurrection Day regarding their disputes.",
    "And who is more wrong-doing than he who prevents God’s name from being commemorated in His places of worship, and endeavors for their ruin? These ought not to enter them, except in fear. For them is disgrace in this world, and for them is a tremendous punishment in the Hereafter.",
    "To God belong the East and the West. Whichever way you turn, there is God’s presence. God is Omnipresent and Omniscient.",
    "And they say, “God has begotten a child.” Be He glorified. In fact, to Him belongs whatever is in the heavens and the earth—all are obedient to Him.",
    "The Originator of the heavens and the earth. When decides on an issue, He says to it, “Be,” and will be.",
    "Those who do not know say, “If only God would speak to us, or a sign would come to us.” Those who came before said the same. Their hearts are similar. We made the Verses clear, for people who are certain.",
    "We sent you with the truth—bringing good news and delivering warnings. And you will not be questioned about the inmates of Hellfire.",
    "The Jews and the Christians will never approve of you: unless you follow their creed. Say, “God’s guidance is the guidance.” Should you follow their desires, after the knowledge that has come to you, you will have in God neither guardian nor helper.",
    "Those to whom We gave the Scripture follow it, as it ought to be followed—these believe in it. But whoever rejects it—these are the losers.",
    "O Children of Israel! Remember My favor which I bestowed upon you, and that I favored you over all people.",
    "And beware of a Day when no soul will avail another soul in any way, and no ransom will be accepted from it, and no mediation will benefit it, and they will not be helped.",
    "And when his Lord tested Abraham with certain words, which he fulfilled. He said, “I am making you a leader of humanity.” He said, “And of my descendants?” He said, “My covenant is not extended to the wrongdoers.”",
    "And We made the House a focal point for the people—and a sanctuary. Take the shrine of Abraham as a place of prayer. And We commissioned Abraham and Ishmael: “Sanctify My House for those who circle around, and those who seclude themselves, and those who bow and prostrate.”",
    "When Abraham said, “My Lord, make this a peaceful land, and provide its people with fruits—whoever of them believes in God and the Last Day.” He said, “And whoever disbelieves, I will give him a little enjoyment, then I will consign him to the punishment of the Fire—a miserable destiny!”",
    "As Abraham raises the foundations of the House, together with Ishmael, “Our Lord, accept from us; You are the Hearer, the Knower.",
    "Our Lord, and make us submissive to You, and from our descendants a community submissive to You. And show us our rites, and accept our repentance. You are the Acceptor of Repentance, the Merciful.",
    "Our Lord, and raise up among them a messenger, of themselves, who will recite Your revelations to them, and will teach them the Book and Wisdom, and purify them. You are the Almighty, the Wise.”",
    "And who would forsake Abraham’s religion, except he who fools himself? We chose him in this life; and in the Hereafter, he will be among the righteous.",
    "When his Lord said to him, “Submit,” he said, “I have submitted to the Lord of the Worlds.”",
    "And Abraham advised his sons, along with Jacob, “O my sons, God has chosen this faith for you, so do not die except in submission.”",
    "Or were you witnesses when death approached Jacob, and he said to his sons, “What will you worship after Me?” They said, “We will worship your God and the God of your fathers Abraham, Ishmael, and Isaac. One God. And to Him, we submit.”",
    "That is a community that has passed. Theirs is what they earned, and yours is what you earned, and you will not be questioned about what they used to do.",
    "And they say, “Be Jews or Christians, and you will be guided.” Say, “Rather, the religion of Abraham, the Monotheist—who was not an associator.”",
    "Say, “We believe in God, and in what was revealed to us, and in what was revealed to Abraham, and Ishmael, and Isaac, and Jacob, and the Patriarchs, and in what was given to Moses and Jesus, and in what was given to the prophets from their Lord. We do not differentiate between any of them. And to Him, we surrender.”",
    "If they believe in the same as you have believed in, then they have been guided. But if they turn away, then they are in schism. God will suffice you against them. He is the Hearer, the Knower.",
    "God’s coloring. And who gives better coloring than God? “And we are worshipers of Him.”",
    "Say, “Do you argue with us about God, when He is our Lord and your Lord, and we have our works, and you have your works, and we are sincere towards Him?”",
    "Or do you say that Abraham, Ishmael, Isaac, Jacob, and the Tribes were Jews or Christians? Say, “Do you know better, or God?” And who is more wrong-doing than he who conceals a testimony he has received from God? God is not unaware of what you do.",
    "That is a community that has passed. Theirs is what they earned, and yours is what you earned. And you will not be questioned about what they used to do.",
    "The foolish among the people will say, “What turned them away from the direction of prayer they used to face?” Say, “To God belong the East and the West. He guides whom He wills to a straight path.”",
    "And so We made you a moderate nation, that you may be witnesses over humanity, and that the Messenger may be a witness over you. And We only established the direction of prayer, which you once followed, so that We may distinguish those who follow the Messenger from those who turn on their heels. It is certainly difficult, except for those whom God guided. But God would never let your faith go to waste. God is Kind towards the people, Most Merciful.",
    "We have seen the turning of your face towards heaven. So We will turn you towards a direction that will satisfy you. So turn your face towards the Sacred Mosque. And wherever you may be, turn your faces towards it. Those who were given the Scripture know this to be the Truth from their Lord, and God is not unaware of what they do.",
    "Even if you were to bring to those who were given the Scripture every Verse, they would not follow your direction, nor are you to follow their direction, nor do they follow one another’s direction. And if you were to follow their desires, after the knowledge that has come to you, you would be one of the wrongdoers.",
    "Those to whom We gave the Scripture recognize it as they recognize their own children. But some of them conceal the truth knowingly.",
    "The truth is from your Lord, so do not be of those who doubt.",
    "Everyone has a direction toward which he turns. So race towards goodness. Wherever you may be, God will bring you all together. God is capable of all things.",
    "And wherever you come from, turn your face towards the Sacred Sanctuary. This is the truth from your Lord, and God is never heedless of what you do.",
    "And wherever you come from, turn your face towards the Sacred Sanctuary. And wherever you may be, turn your faces towards it. So that people may have no argument against you—except those who do wrong among them. So do not fear them, but fear Me, so that I may complete My favor upon you, so that you may be guided.",
    "Just as We sent to you a messenger from among you: reading Our revelations to you, and purifying you, and teaching you the Scripture and wisdom, and teaching you what you did not know.",
    "So remember Me, and I will remember you. And thank Me, and never be ungrateful.",
    "O you who believe! Seek help through patience and prayers. God is with the patient.",
    "And do not say of those who are killed in God’s path, “they are dead.” In fact, they are alive, but you do not perceive.",
    "We will test you with some fear, and hunger, and loss of wealth and lives and crops—but give good news to those who patiently endure.",
    "Those who, when afflicted by a calamity, say, “To God, we belong, and to Him, we are returning.”",
    "Upon these are blessings and mercy from their Lord. These are the guided ones.",
    "Safa and Marwa are among the rites of God. Whoever performs the Pilgrimage to the House, or performs the Minor Pilgrimage, must stride between them. And whoever volunteers good—God is Appreciative and Knowledgeable.",
    "Those who suppress the evidence and the guidance We revealed—after We made it clear for the people in the Book. These: God curses them, and the cursers curse them.",
    "Except for those who repent, and reform, and proclaim. These: I will accept their repentance. I am the Acceptor of Repentance, the Merciful.",
    "But as for those who reject faith, and die rejecting—these: upon them is the curse of God, and of the angels, and of all people.",
    "They will remain under it forever, and the suffering will not be reduced for them, nor will they be reprieved.",
    "Your God is one God. There is no god but He, the Compassionate, the Merciful.",
    "In the creation of the heavens and the earth; in the alternation of night and day; in the ships that sail the oceans for the benefit of humanity; in the rain that God sends down from the sky, with which He revives the earth after its death; in the scattering of all kinds of creatures throughout; in the shifting of the winds, and the clouds drifting between the sky and the earth; are signs for people who understand.",
    "Yet among the people are those who take others as God’s equals. They love them as the love of God. But those who believe have a greater love for God. If only the wrongdoers would realize when they see the suffering, that all power belongs to God, and that God is severe in punishment.",
    "When those who were followed disown those who followed, and they see the punishment, and ties between them are severed.",
    "Those who followed will say, “If we can have another chance, we will disown them, as they disowned us.” Thus God will show them their deeds, as a source of regret for them, and they will not get out of the Fire.",
    "O, people! Eat of what is lawful and good on the earth, and do not follow Satan’s footsteps. He is to you an open enemy.",
    "He entices you to commit evil and indecency, and to say about God what you do not know.",
    "And when it is said to them, “Follow what God has revealed,” they say, “We only follow what we found our ancestors practicing.” Even if their ancestors understood nothing, and were not guided?",
    "The parable of those who disbelieve is that of someone who calls upon someone who hears nothing except screaming and yelling. Deaf, dumb, blind—they do not understand.",
    "O you who believe! Eat of the good things We have provided for you, and give thanks to God, if it is Him that you worship.",
    "He has forbidden you carrion, blood, the flesh of swine, and what was offered to other than God. But whoever is compelled by necessity—neither driven by desire nor excess—he commits no sin. God is Forgiving and Merciful.",
    "Those who conceal what God has revealed in the Book, and exchange it for a small price—these consume nothing but fire into their bellies. And God will not speak to them on the Day of Resurrection, nor will He purify them, and they will have a painful punishment.",
    "It is they who exchange guidance for misguidance, and forgiveness for punishment, yet they have no tolerance for the Fire.",
    "That is because God revealed the Book in truth, and those who differ about the Book are in deep discord.",
    "Righteousness does not consist of turning your faces towards the East and the West. But righteous is he who believes in God, and the Last Day, and the angels, and the Scripture, and the prophets. Who gives money, however cherished, to relatives, and orphans, and the needy, and the homeless, and the beggars, and for freeing slaves; those who perform the prayers, and pay the obligatory charity, and fulfill their promises when they promise, and patiently persevere in the face of persecution, hardship, and in the time of conflict. These are the sincere; these are the reverent.",
    "O you who believe! Retaliation is prescribed for you in case of murder: the free for the free, the slave for the slave, the female for the female. But if he is forgiven by his kin, then grant any reasonable demand, and pay with goodwill. This is a relief from your Lord—and mercy. But whoever commits aggression after that will have a painful punishment.",
    "There is life for you in retaliation, O people of understanding, so that you may refrain.",
    "It is decreed for you: when death approaches one of you, and he leaves wealth, to make a will in favor of the parents and the relatives—in fairness—a duty upon the righteous.",
    "But if anyone changes it after hearing it, the guilt is upon those who change it. God is Hearing and Knowing.",
    "Should someone suspect bias or injustice by a testator, and then reconciles between them, he commits no sin. God is Forgiving and Merciful.",
    "O you who believe! Fasting is prescribed for you, as it was prescribed for those before you, so that you may become righteous.",
    "For a specified number of days. But whoever among you is sick or traveling, then a number of other days. For those who are able: a ransom of feeding a needy person. But whoever volunteers goodness, it is better for him. But to fast is better for you, if you only knew.",
    "Ramadan is the month in which the Quran was revealed. Guidance for humanity, and clear proofs of the guidance, and the Criterion. Whoever of you witnesses the month shall fast it. But whoever is sick, or traveling, then a number of other days. God intends ease for you, and He does not intend difficulty for you, so that you may complete the number, and glorify God for having guided you, so that you may be thankful.",
    "And when My servants ask you about Me: I Am near, I answer the call of the caller when he calls on Me. So let them respond to Me, and have faith in Me, so they may be guided.",
    "Permitted for you is intercourse with your wives on the night of the fast. They are a garment for you, and you are a garment for them. God knows that you were betraying yourselves, but He turned to you and pardoned you. So approach them now, and seek what God has ordained for you, and eat and drink until the white thread of dawn can be distinguished from the black thread. Then complete the fast until nightfall. But do not approach them while you are in seclusion at the mosques. These are the limits set by God, so do not go near them. God thus makes clear His revelations to people, so that they may protect themselves.",
    "And do not consume one another’s wealth by unjust means, nor deliberately offer it as bribes to authorities in order to illicitly consume part of people’s wealth.",
    "They ask you about the crescents. Say, “They are timetables for people, and for the Hajj.” It is not virtuous that you approach homes from their backs, but virtue is to be pious. So approach homes through their doors. And be conscious of God, so you may succeed.",
    "And fight in God’s way those who fight you, but do not commit aggression—God does not love the aggressors.",
    "And kill them wherever you overtake them, and expel them from where they have expelled you. Oppression is more severe than murder. But do not fight them at the Sacred Sanctuary, unless they fight you there. If they fight you, then kill them—such is the payback for the unbelievers.",
    "But if they cease, then God is Forgiving and Merciful.",
    "And fight them until there is no more oppression, and all worship is devoted to God. But if they cease, then let there be no hostility, except against the oppressors.",
    "The sacred month for the sacred month; and sacrilege calls for retaliation. Whoever commits aggression against you, retaliate against him in the same measure as he has committed against you. And be mindful of God, and know that God is with the righteous.",
    "And spend in the cause of God, and do not contribute to your own ruin, and be charitable. God loves the charitable.",
    "And complete the Hajj and the Umrah for God. But if you are prevented, then whatever offering is feasible. And do not shave your heads until the offering has reached its destination. But if any of you is sick, or has a head injury: then redemption by fasting, or charity, or worship. When you are secure: whoever continues the Umrah until the Hajj, then whatever offering is feasible. But whoever lacks the means: then fasting for three days during the Hajj and seven when you have returned, making ten in all. This is for anyone whose family is not present at the Sacred Sanctuary. And reverence God, and know that God is severe in retribution.",
    "The Hajj is during specific months. Whoever commits to performing the Hajj—there shall be no sexual relations, nor misconduct, nor quarreling during the Hajj. Whatever good you do, God knows it. And take the necessary provision, but the best provision is righteousness. And be mindful of Me, O possessors of understanding.",
    "You commit no wrong by seeking your Lord’s bounty. But when you disperse from Arafat, commemorate God at the Sacred Landmark. And commemorate Him for having guided you. Although, prior to that, you were of those astray.",
    "Then disperse from where the people have dispersed, and ask God for forgiveness. God is Forgiving and Merciful.",
    "When you have completed your rites: remember God as you remember your parents, or even more. Among the people is he who says, “Our Lord, give us in this world,” but there is no share for him in the Hereafter.",
    "And among them is he who says, “Our Lord, give us goodness in this world, and goodness in the Hereafter, and protect us from the suffering of the Fire.”",
    "These will have a share of what they have earned. God is swift in reckoning.",
    "And commemorate God during the designated days. But whoever hurries on in two days commits no wrong. And whoever stays on commits no wrong—provided he maintains righteousness. And obey God. And know, that to Him you will be gathered.",
    "Among the people is he whose words about the worldly life impress you, and he calls God to witness what is in his heart, yet he is the fiercest of adversaries.",
    "And when he gains power, he strives to spread corruption on earth, destroying properties and lives. God does not like corruption.",
    "And when it is said to him, “Beware of God,” his pride leads him to sin. Sufficient for him is Hell—a dreadful residence.",
    "And among the people is he who sells his life seeking to please God. God is Kind towards the servants.",
    "O you who believe! Enter into submission, wholeheartedly, and do not follow Satan’s footsteps. He is your sworn enemy.",
    "But if you stumble after the clear proofs have come to you, then know that God is Powerful and Wise.",
    "Are they waiting for God Himself to come to them in the shadows of the clouds, along with the angels, and the matter is settled? All matters are returned to God.",
    "Ask the Children of Israel how many clear proofs We have given them. Whoever trades God’s favor after it has come to him—God is severe in retribution.",
    "Beautified is the life of this world for those who disbelieve, and they ridicule those who believe. But the righteous will be above them on the Day of Resurrection. God provides to whom He wills without measure.",
    "Humanity was a single community; then God sent the prophets, as deliverers of good news and warners. And with them He sent down the Scripture, with the truth, to judge between people regarding their differences. And only those who were given it differed about it—after clear proofs came to them—out of envy among themselves. Then God guided those who believed to the truth they had disputed, in accordance with His will. God guides whom He wills to a straight path.",
    "Or do you expect to enter Paradise without experiencing the equivalent of what happened to those before you? Adversity and hardship afflicted them, and they were so shaken, that the Messenger and those who believed with him said, “When is God’s help?” Surely, God’s help is near.",
    "They ask you what they should contribute. Say, “Whatever charity you give is for the parents, and the relatives, and the orphans, and the poor, and the traveler. Whatever good you do, God knows it.”",
    "Fighting is ordained for you, even though you hate it. But it may be that you hate something while it is good for you, and it may be that you love something while it is bad for you. God knows, and you do not know.",
    "They ask you about fighting during the Holy Month. Say, “Fighting in it is deplorable. But hindering others from God’s path, and rejecting Him, and preventing access to the Holy Mosque, and expelling its residents from it, are more deplorable with God. And persecution is more severe than murder.” They will not cease fighting you until they have turned you back from your faith—if they are able. Whoever among you turns back from his faith, and dies an unbeliever—these are they whose works will come to nothing, in this life, and in the Hereafter. These are the inhabitants of the Fire, remaining in it forever.",
    "Those who believe, and those who migrate and strive in God’s path—it is they who hope for God’s Mercy. God is Forgiving and Merciful.",
    "They ask you about intoxicants and gambling. Say, “There is a gross sin in them, and some benefits for people, but their sinfulness outweighs their benefit.” And they ask you what they should contribute. Say, “Whatever can be spared.” Thus God makes clear the Verses for you, so you may think.",
    "About this life and the next. And they ask you about orphans. Say, “Improvement for them is best. And if you intermingle with them, then they are your brothers.” God knows the corruptor from the reformer. Had God willed, He could have overburdened you. God is Mighty and Wise.",
    "Do not marry idolatrous women, until they have believed. A believing maid is better than an idolatress, even if you like her. And do not marry idolatrous men, until they have believed. A believing servant is better than an idolater, even if you like him. These call to the Fire, but God invites to the Garden and to forgiveness, by His permission. He makes clear His communications to the people, so that they may remember.",
    "And they ask you about menstruation: say, “It is harmful, so stay away from women during menstruation. And do not approach them until they have become pure. Once they have become pure, approach them in the manner God has directed you.” God loves the repentant, and He loves those who keep clean.”",
    "Your women are cultivation for you; so approach your cultivation whenever you like, and send ahead for yourselves. And fear God, and know that you will meet Him. And give good news to believers.",
    "And do not let your oaths in God's name hinder you from virtue, righteousness, and making peace between people. God is Listener and Knower.",
    "God does not hold you responsible for your unintentional oaths, but He holds you responsible for your intentions. God is Forgiving and Clement.",
    "Those who vow abstinence from their wives must wait for four months. But if they return—God is Forgiving and Merciful.",
    "But if they resolve on divorce—God is Hearing and Knowing.",
    "Divorced women shall wait by themselves for three periods. And it is not lawful for them to conceal what God has created in their wombs—if they believe in God and the Last Day. And their husbands have the better right to take them back—if they desire reconciliation. And women have rights similar to their obligations, according to what is fair. But men have a degree over them. God is Powerful and Wise.",
    "Divorce is twice. Then, either honorable retention or setting free kindly. It is not lawful for you to take back anything you have given them—unless they fear they cannot keep God's limits. If you fear they cannot keep God’s limits, then there is no blame on them in what she may give in ransom. These are God’s limits, so do not violate them. Those who violate God’s limits are the wrongdoers.",
    "If he divorces her, she is no longer lawful for him, until she marries another man. If he divorces her, then there is no blame on them for reuniting, provided they think they can maintain God's limits. These are the limits set by God; He makes them clear to people who know.",
    "And when you have divorced women, and they have reached their term, either retain them amicably or release them amicably. But do not retain them to hurt them and commit aggression. Whoever does that has wronged himself. And do not take God’s revelations for a joke. And remember God's blessing upon you, and that He revealed to you the Scripture and Wisdom, to teach you. And be cautious of God, and know that God knows everything.",
    "When you have divorced women, and they have reached their term, do not prevent them from marrying their husbands, provided they mutually agree on fair terms. This is enjoined on whomever among you believes in God and the Last Day. That is purer for you, and more decent. God knows, and you do not know.",
    "And let mothers nurse their infants for two full years, for those who desire to complete the nursing. It is the duty of the father to provide for them and clothe them in a proper manner. No soul shall be burdened beyond its capacity. No mother shall be harmed on account of her child, nor shall a father be harmed on account of his child. The same duty rests upon the heir. If they desire separation, by mutual consent and consultation, they commit no error by doing so. You commit no error by hiring nursing-mothers, as long as you pay them fairly. And be wary of God, and know that God sees everything you do.",
    "As for those among you who die and leave widows behind, they shall wait by themselves for four months and ten days. When they have reached their term, there is no blame on you regarding what they might honorably do with themselves. God is aware of everything you do.",
    "You commit no error by announcing your engagement to women, or in keeping it within yourselves. God knows that you will be thinking about them. But do not meet them secretly, unless you have something proper to say. And do not confirm the marriage tie until the writing is fulfilled. And know that God knows what is in your souls, so beware of Him. And know that God is Forgiving and Clement.",
    "You commit no error by divorcing women before having touched them, or before having set the dowry for them. And provide for them: the wealthy according to his means, and the poor according to his means. An honorable provision—a duty upon the virtuous.",
    "If you divorce them before you have touched them, but after you had set the dowry for them, then give them half of what you specified—unless they forgo it or he whose hand holds the marriage tie forgoes. But to forego is nearer to piety. And do not forget the grace between yourselves. God sees whatever you do.",
    "Guard your prayers, and the middle prayer, and stand before God in devotion.",
    "But if you are fearful, then on foot or riding. And when you are secure, remember God, as He taught you what you did not know.",
    "Those among you who die leaving widows behind—a will shall provide their widows with support for a year, provided they do not leave. If they leave, there is no blame on you for what they do with themselves, provided it is reasonable. God is Mighty and Wise.",
    "Divorced women shall be provided for, equitably—an obligation upon the righteous.",
    "God thus explains His revelations to you, so you may understand.",
    "Have you not considered those who fled their homes, by the thousands, fearful of death? God said to them, “Die.” Then He revived them. God is Gracious towards the people, but most people are not thankful.",
    "And fight in the way of God, and know that God is Hearing and Knowing.",
    "Who is he who will lend God a generous loan, so He will multiply it for him many times over? God restricts and expands. And to Him, you will be returned.",
    "Have you not considered the notables of the Children of Israel after Moses? When they said to a prophet of theirs, “Appoint a king for us, and we will fight in God’s way.” He said, “Is it possible that, if fighting was ordained for you, you would not fight?” They said, “And why would we not fight in God’s way, when we were expelled from our homes, along with our children?” But when fighting was ordained for them, they turned away, except for a few of them. But God knows the wrongdoers.",
    "And their prophet said to them, “God has appointed Saul to be your king.” They said, “How can he have authority over us, when we are more deserving of authority than he, and he was not given plenty of wealth?” He said, “God has chosen him over you, and has endowed him with knowledge and physique.” God gives the authority to whomever He wills. God is Infinite, All-Knowing.",
    "And their prophet said to them, “The proof of his kingship is that the Ark will be restored to you, bringing tranquility from your Lord, and relics left by the family of Moses and the family of Aaron. It will be carried by the angels. In this is a sign for you, if you are believers.”",
    "When Saul set out with the troops, he said, “God will be testing you with a river. Whoever drinks from it does not belong with me. But whoever does not drink from it, does belong with me, except for whoever scoops up a little with his hand.” But they drank from it, except for a few of them. Then, when he crossed it, he and those who believed with him said, “We have no strength to face Goliath and his troops today.” But those who knew that they would meet God said, “How many a small group defeated a large group, by God’s will. And God is with the patient.”",
    "And when they confronted Goliath and his troops, they said, “Our Lord, pour down patience upon us, and strengthen our foothold, and support us against the disbelieving people.”",
    "And they defeated them by God’s will, and David killed Goliath. And God gave him sovereignty and wisdom, and He taught him of what He willed. Were it not for God’s repelling people, some by means of others, the earth would have gone to ruin. But God is gracious towards humanity.",
    "These are God’s revelations, which We recite to you in truth. You are one of the messengers.",
    "These messengers: We gave some advantage over others. To some of them, God spoke. And some, He raised in rank. And We gave Jesus the son of Mary the evident miracles, and We strengthened him with the Holy Spirit. Had God willed, those who succeeded them would not have fought one another—after the clear signs came to them—but they disputed; some of them believed, and some of them disbelieved. Had God willed, they would not have fought one another; but God does whatever He wills.",
    "O you who believe! Spend from what We provided for you: before a Day arrives when there is no bargaining, no friendship, and no mediation. The disbelievers are the wrongdoers.",
    "God, there is no god except He, the Living, the Everlasting. Neither slumber overtakes Him, nor sleep. To Him belongs whatsoever is in the heavens and whatsoever is on earth. Who is there who can intercede with Him without His permission? He knows what is ahead of them, and what is behind them; and they cannot grasp any of His Knowledge, except as He wills. His Throne extends over the heavens and the earth, and their preservation does not burden Him. He is the Most-High, the Tremendous.",
    "Let there be no coercion in religion; the right way has become distinct from the wrong way. Whoever rejects the transgressors, and believes in God, has grasped the most trustworthy handle—which never breaks. God is Hearing and Knowing.",
    "God is the Guardian of those who believe; He brings them out of darknesses into the light. As for those who disbelieve, their guardians are the transgressors; they bring them out of the light into darknesses—these are the inhabitants of the Fire, remaining in it forever.",
    "Have you not considered him who argued with Abraham about his Lord, because God had given him sovereignty? Abraham said, “My Lord is He who gives life and causes death.” He said, “I give life and cause death.” Abraham said, “God brings the sun from the East, so bring it from the West,” so the blasphemer was puzzled. God does not guide the unjust people.",
    "Or like him who passed by a village collapsed on its foundations. He said, “How can God revive this after its demise?” So God caused him to die for a hundred years, then resurrected him. He said, “For how long did you remain?” He said, “I remained for a day, or part of a day.” He said, “No. You remained for a hundred years. Now look at your food and drink—they have not spoiled. And look at your donkey. We will make you a wonder for the people. And look at the bones, how We arrange them, and then cover them with flesh.” And when it became clear to him, he said, “I know that God is capable of all things.”",
    "And when Abraham said, “My Lord, show me how You give life to the dead.” He said, “Have you not believed?” He said, “Yes, but to reassure my heart.” He said, “Take four birds, and draw them to yourself, then place a part on each hill, then call them, and they will come rushing to you. And know that God is Powerful and Wise.”",
    "The parable of those who spend their wealth in God’s way is that of a grain that produces seven clusters; in each cluster is a hundred grains. God multiplies for whom He wills. God is Bountiful and Knowledgeable.",
    "Those who spend their wealth in God’s way, then do not follow up their charity with reminders of generosity or with insults—they will have their reward with their Lord—they have nothing to fear, nor will they grieve.",
    "Kind words and forgiveness are better than charity followed by insults. God is Rich and Clement.",
    "O you who believe! Do not nullify your charity with reminders and hurtful words, like him who spends his wealth to be seen by the people, and does not believe in God and the Last Day. His example is like a smooth rock covered with soil: a downpour strikes it, and leaves it barren—they gain nothing from their efforts. God does not guide the disbelieving people.",
    "The example of those who spend their possessions seeking to please God and to secure themselves is similar to the example of a garden on a hill: if heavy rain falls on it, its produce is doubled; and if no heavy rain falls, then dew is enough. God sees whatever you do.",
    "Would anyone of you like to have a garden of date-palms and grapevines, under which rivers flow, with all kinds of fruit in it for him, and old age has stricken him, and he has weak children, then a tornado with fire batters it, and it burns down? Thus God explains the verses to you, so you may reflect.",
    "O you who believe! Spend of the good things you have earned, and of what We have produced for you from the earth. And do not pick the inferior things to give away, when you yourselves would not receive it, except with closed eyes. And know that God is Self-Sufficient, Praiseworthy.",
    "Satan promises you poverty, and he urges you to immorality. But God promises you forgiveness from Himself—and grace. God is Limitless and Knowledgeable.",
    "He gives wisdom to whom He wills. Whoever is given wisdom has been given much good. Yet none remember except the possessors of intellect.",
    "Whatever charity you give, or a pledge you fulfill, God knows it. And for the wrongdoers, there are no helpers.",
    "If you give charity openly, that is good. But if you keep it secret, and give it to the needy in private, that is better for you. It will atone for some of your misdeeds. God is Aware of what you do.",
    "Their guidance is not your responsibility, but God guides whom He wills. Any charity you give is for your own good. Any charity you give shall be for the sake of God. Any charity you give will be repaid to you in full, and you will not be wronged.",
    "It is for the poor; those restrained in God’s way, and unable to travel in the land. The unaware considers them wealthy, because of their self-respect. You will recognize them by their traits. They do not ask people insistently. Whatever charity you give, God knows about it.",
    "Those who spend their wealth by night and by day, privately and publicly, will receive their reward from their Lord. They have nothing to fear, nor shall they grieve.",
    "Those who consume usury will not rise, except as someone driven mad by Satan's touch. That is because they say, “Commerce is like usury.” But God permitted commerce, and He prohibited usury. Whoever, on receiving advice from his Lord, refrains, may keep his past earnings, and his case rests with God. But whoever resumes—these are the dwellers of the Fire, where they will remain forever.",
    "God condemns exploitation, and He blesses charities. God does not love any disbelieving sinner.",
    "Those who believe, and perform righteous deeds, and pray regularly, and give regular charity—they will have their reward with their Lord—they have nothing to fear, nor shall they grieve.",
    "O you who believe! Reverence God, and forgo what remains of usury, if you are believers.",
    "And if you do not, then take notice of war by God and His Messenger. But if you repent, you may keep your capital, neither wronging nor being wronged.",
    "If someone is in difficult circumstances, then deferment until a time of ease. But to remit it as charity is better for you—if you only knew.",
    "And guard yourselves against a Day when you are returned to God, then every soul will be paid in full for what it has earned, and they will not be wronged.",
    "O you who believe! When you contract a debt with one another for a term appointed, write it down. And have a scribe write in your presence, in all fairness. And let no scribe refuse to write, as God has taught him. So let him write, and let the debtor dictate, and let him fear God his Lord, and diminish nothing from it. But if the debtor is incompetent, or weak, or unable to dictate, then let his guardian dictate justly. And call to witness two witnesses from among your men. If two men cannot be found, then a man and two women from among those whom you approve as witnesses. If one of them forgets, the other will remind her. Witnesses must not refuse when called upon. And do not think it unimportant to write down, whether small or large, including the time of repayment. That is more equitable with God, stronger as evidence, and more likely to prevent doubt—except in the case of a spot transaction between you—then there is no blame on you if you do not write it. And let there be witnesses whenever you conclude a contract, and let no harm be done to either scribe or witness. If you do, it is corruption on your part. And fear God. God teaches you. God is Knower of all things.",
    "And if you are on a journey, and cannot find a scribe, then a security deposit should be handed over. But if you trust one another, let the trustee fulfill his trust, and let him fear God, his Lord. And do not conceal testimony. Whoever conceals it is a sinner at heart. God knows whatever you do.",
    "To God belongs whatsoever is in the heavens and whatsoever is on earth. Whether you disclose what is in yourselves, or conceal it, God will call you to account for it. He forgives whom He wills, and He punishes whom He wills, and God is capable of all things.",
    "The Messenger has believed in what was revealed to him from his Lord, as did the believers. They all have believed in God, His angels, His scriptures, and His messengers: “We do not differentiate between any of His messengers.” And they say, “We hear and we obey. Your forgiveness, our Lord. To you is the destiny.”",
    "God burdens no soul beyond its capacity. To its credit is what it earns, and against it is what it commits. “Our Lord, do not condemn us if we forget or make a mistake. Our Lord, do not burden us as You have burdened those before us. Our Lord, do not impose on us more than we have the strength to bear; and pardon us, and forgive us, and have mercy on us. You are our Master, so help us against the disbelieving people.”"
  ]
}