{
  "id": 20,
  "name": "طه",
  "transliteration": "Ta-Ha",
  "translation": "Ta-Ha",
  "verses": [
    "Ta. Ha.",
    "We did not reveal the Quran to you to make you suffer.",
    "But only as a reminder for him who fears.",
    "A revelation from He Who created the earth and the high heavens.",
    "The Mercy-Giver; on the Throne He settled.",
    "To Him belongs everything in the heavens, everything on earth, everything between them, and everything beneath the soil.",
    "If you speak aloud—He knows the secret, and what is more hidden.",
    "God—there is no god except He. He has the Most Beautiful Names.",
    "Has the story of Moses reached you?",
    "When he saw a fire, he said to his family, “Stay; I have noticed a fire; perhaps I can bring you a torch from it, or find guidance at the fire.”",
    "Then, when he reached it, he was called: “O Moses!",
    "I. I am your Lord. Take off your sandals. You are in the sacred valley of Tuwa.",
    "And I have chosen you, so listen to what is revealed.",
    "I. I am God. There is no God except Me. So serve Me, and practice the prayer for My remembrance.",
    "The Hour is coming. But I keep it almost hidden, so that every soul is rewarded by what it endeavors.",
    "And do not let him who denies it and follows his desire turn you away from it, or you will fall.",
    "And what is that in your right hand, O Moses?”",
    "He said, “It is my cane. I lean on it, and I herd my sheep with it, and I have other uses for it.”",
    "He said, “Throw it, O Moses.”",
    "So he threw it—and it was a serpent, moving swiftly.",
    "He said, “Take hold of it, and do not fear. We will restore it to its original condition.",
    "And press your hand to your side. It will come out white, without blemish—another sign.",
    "So that We may show you some of Our greatest miracles.",
    "Go to Pharaoh; he has transgressed.”",
    "He said, “My Lord, put my heart at ease for me.",
    "And ease my task for me.",
    "And untie the knot from my tongue.",
    "So that they can understand my speech.",
    "And appoint an assistant for me, from my family.",
    "Aaron, my brother.",
    "And strengthen me with him.",
    "And have him share in my mission.",
    "So that we glorify You much.",
    "And remember You much.",
    "You are always watching over us.”",
    "He said, “You are granted your request, O Moses.",
    "And We have favored you another time.",
    "When We inspired your mother with inspiration.",
    "‘Put him in the chest, then throw it in the river. The river will wash him ashore, where an enemy of Mine and an enemy of his will pick him up.’ And I have bestowed on you love from Me, so that you would be raised under My eye.",
    "When your sister walked along, and said, ‘Shall I direct you to someone who will take care of him?' So We returned you to your mother, so that she may be comforted, and not sorrow. And you killed a person, but We saved you from distress, and We tested you thoroughly. And you stayed for years among the people of Median. Then you came back, as destined, O Moses.",
    "And I made you for Myself.",
    "Go, you and your brother, with My proofs, and do not neglect My remembrance.",
    "Go to Pharaoh. He has tyrannized.",
    "But speak to him gently. Perhaps he will be mindful, or have some fear.”",
    "They said, “Our Lord, we fear he may persecute us, or become violent.”",
    "He said, “Do not fear, I am with you; I hear and I see.",
    "Approach him, and say, `We are the messengers of your Lord, so let the Children of Israel go with us, and do not torment them. We have come to you with a message from your Lord, and peace is upon whoever follows the guidance.",
    "It was revealed to us that punishment falls upon whoever rejects and turns away.'”",
    "He said, “Who is your Lord, O Moses?”",
    "He said, “Our Lord is He who gave everything its existence, then guided it.”",
    "He said, “What about the first generations?”",
    "He said, “Knowledge thereof is with my Lord in a Record. My Lord never errs, nor does He forget.”",
    "He who made the earth a habitat for you, and traced in it pathways for you, and sent down rain from the sky, with which We produce pairs of diverse plants.",
    "Eat and pasture your livestock. In this are signs for those possessed of sound judgment.",
    "From it, We created you. And into it, We will return you. And from it, We will bring you out another time.",
    "And We showed him Our miracles, all of them, but he denied and refused.",
    "He said, “Did you come to us to expel us from our land with your magic, O Moses?",
    "We will produce for you magic like it. So make an appointment between us and you, at a central place, which neither we nor you will fail to keep.”",
    "He said, “Your appointment is on the Day of the Festival, so let the people assemble before noon.”",
    "Pharaoh then withdrew, put together his plan, then came back.",
    "Moses said to them, “Woe to you! Do not fabricate lies against God, or He will destroy you with a punishment. Whoever fabricates lies will be disappointed.”",
    "So they disputed the matter among themselves, conversing privately.",
    "They said, “These two are magicians who want to expel you from your land with their magic, and to abolish your exemplary way of life.",
    "So settle your plan, and come as one front. Today, whoever gains the upper-hand will succeed.”",
    "They said, “O Moses! Either you throw, or we will be the first to throw.”",
    "He said, “No, you throw.” And suddenly, their ropes and their sticks appeared to him, because of their magic, to be crawling swiftly.",
    "So Moses conceived a fear within himself.",
    "We said, “Do not fear! You are the uppermost.",
    "Now throw what is in your right hand, and it will swallow what they have crafted. What they have crafted is only a magician’s trickery. But the magician will not succeed, wheresoever he may go.”",
    "And the magicians fell down in prostration. They said, “We have believed in the Lord of Aaron and Moses.”",
    "He said, “Did you believe in him before I have given you permission? He must be your master, who taught you magic. I will cut off your hands and your feet on alternate sides, and I will crucify you on the trunks of the palm-trees. Then you will know whose punishment is more severe and more lasting.”",
    "They said, “We will never prefer you over the proofs that have come to us, nor over He who originated us. So issue whatever judgment you wish to issue. You can rule only in this lowly life.",
    "We have believed in our Lord, so that He may forgive us our sins, and the magic you compelled us to practice. God is better and more Lasting.”",
    "Whoever comes to his Lord guilty, for him is Hell, where he neither dies nor lives.",
    "But whoever comes to Him as a believer, having worked righteousness, theirs will be the highest ranks.",
    "The Gardens of Eden, under which rivers flow, where they will stay forever. That is the reward for whoever purifies himself.",
    "And We inspired Moses: “Travel by night with My worshipers, and strike for them a dry path through the sea, and do not fear being overtaken, and do not worry.”",
    "Pharaoh pursued them with his troops, but the sea overwhelmed them, and completely engulfed them.",
    "Pharaoh misled his people, and he did not guide them.",
    "O Children of Israel! We saved you from your enemy, and We promised you by the right side of the Mount, and We sent down to you manna and quails.",
    "Eat of the good things We have provided for you, but do not be excessive in it, lest My wrath descends upon you. He upon whom My wrath descends has fallen.",
    "And I am Forgiving towards whoever repents, believes, acts righteously, and then remains guided.",
    "“And what made you rush ahead of your people, O Moses?”",
    "He said, “They are following in my footsteps. And I hurried on to You, my Lord, so that you may be pleased.”",
    "He said, “We have tested your people in your absence, and the Samarian led them astray.”",
    "So Moses returned to his people, angry and disappointed. He said, “O my people! Did your Lord not promise you a good promise? Was time too long for you? Or did you want wrath from your Lord to descend upon you, so you broke your promise to me?”",
    "They said, “We did not break our promise to you by our choice, but we were made to carry loads of the people’s jewelry, and we cast them in. That was what the Samarian recommended.”",
    "So he produced for them a calf—a body that lowed. And they said, “This is your god and the god of Moses, but he forgot.”",
    "Have they not considered that it cannot return a word to them, and has no power to harm them or benefit them?",
    "Aaron had told them beforehand, “O my people, you are being tested by this, and your Lord is the Beneficent. So follow me, and obey my command.”",
    "They said, “We will not give up our devotion to it—until Moses returns to us.”",
    "He said, “O Aaron, what prevented you—when you saw them going astray.",
    "From following after me? Did you disobey my command?”",
    "He said, “Son of my mother! Do not seize me by my beard or my head. I feared that you would say, `You have caused division between the Children of Israel, and did not observe my word.'”",
    "He said, “What do you have to say, O Samarian?”",
    "He said, “I saw what they did not see, so I grabbed a handful from the Messenger’s traces, and I flung it away. Thus my soul prompted me.”",
    "He said, “Begone! Your lot in this life is to say, ‘No contact.’ And you have an appointment that you will not miss. Now, look at your god, to whom you remained devoted: we will burn it up, then scatter it in the sea, completely.”",
    "Your God is God, the One besides whom there is no other god. He encompasses all things in knowledge.",
    "Thus We narrate to you reports of times gone by. And We have given you a Reminder from Our Presence.",
    "Whoever turns away from it will carry on the Day of Resurrection a burden.",
    "Abiding in it forever. Evil is their burden on the Day of Resurrection.",
    "On the Day when the Trumpet is blown—We will gather the criminals on that Day, blue.",
    "Murmuring among themselves: “You have lingered only for ten.”",
    "We are fully aware of what they say—when the most exemplary of them in conduct will say, “You have lingered only a day.”",
    "And they ask you about the mountains. Say, “My Lord will pulverize them, utterly.",
    "And reduce them into a desolate waste.",
    "You will see in them neither dip nor elevation.”",
    "On that Day, they will follow the Caller, without any deviation. Voices will be hushed before the Merciful, and you will hear nothing but murmur.",
    "On that Day, mediation will be of no benefit, except for someone permitted by the Gracious, and whose words He has approved.",
    "He knows what is ahead of them, and what is behind them, and they cannot encompass Him in their knowledge.",
    "Faces will be humbled before the Living, the Eternal. Whoever carries injustice will despair.",
    "But whoever has done righteous deeds, while being a believer—will fear neither wrong nor grievance.",
    "Thus We revealed it an Arabic Quran, and We diversified the warnings in it, so perhaps they will become righteous, or it produces a lesson for them.",
    "So Exalted is God, the True Sovereign. Do not be hasty with the Quran before its inspiration is concluded to you, and say, “My Lord, increase me in knowledge.”",
    "And We covenanted with Adam before, but he forgot, and We found in him no resolve.",
    "And when We said to the angels: “Prostrate yourselves before Adam.” They prostrated, except for Iblis—he refused.",
    "We said, “O Adam, this is an enemy to you and to your wife. So let him not drive you out of Paradise, for then you will suffer.",
    "In it, you will never go hungry, nor go naked.",
    "Nor will you be thirsty in it, nor will you swelter.”",
    "But Satan whispered to him. He said, “O Adam, shall I show you the Tree of Everlastingness and a kingdom that never decays?”",
    "And so they ate from it, and their nakedness became exposed to them, and they began covering themselves with the leaves of the Garden. Adam disobeyed his Lord, and so became misled.",
    "But then his Lord recalled him, pardoned him, and guided him.",
    "He said, “Descend from it, all together, some of you enemies of others. But whenever guidance comes to you from Me, whoever follows My guidance, will neither go astray nor suffer.",
    "But whoever turns away from My remembrance, for him is a confined life, and We will raise him on the Day of Resurrection blind.”",
    "He will say, “My Lord, why did You raise me blind, although I was seeing?”",
    "He will say, “Just as Our revelations came to you, and you forgot them, so today you will be forgotten.”",
    "Thus We repay whoever transgresses and does not believe in the revelations of his Lord. The punishment of the Hereafter is more severe and more lasting.",
    "Does it not serve as guidance for them, how many generations We destroyed before them, in whose settlements they walk? Surely in this are signs for those of sound judgment.",
    "Were it not for a prior Word from your Lord, and an appointed term, it would have been necessary.",
    "So bear patiently what they say, and celebrate your Lord’s praises before the rising of the sun, and before its setting, and during the hours of the night glorify Him, and at the borders of the day, so that you may be content.",
    "And do not extend your glance towards what We have given some classes of them to enjoy—the flower of this life—so that We may test them thereby. But your Lord’s provision is better and more lasting.",
    "And exhort your people to pray, and patiently adhere to it. We ask of you no sustenance, but it is We who sustain you. And the end belongs to reverence.",
    "And they say, “If only he would bring us a miracle from his Lord.” Were they not given enough clear proofs in the former scriptures?",
    "Had We destroyed them with a punishment before this, they would have said, “Our Lord, if only You had sent us a messenger, we would have followed Your revelations before being humiliated and disgraced.”",
    "Say, “Everyone is waiting, so wait. You will know who the people of the sound path are, and who is guided.”"
  ]
}