{
  "id": 22,
  "name": "الحج",
  "transliteration": "al-Hajj",
  "translation": "The Pilgrimage",
  "verses": [
    "O, people! Be conscious of your Lord: the quaking of the Hour is something tremendous.",
    "On the Day when you see it: every nursing mother will abandon what she nurses, and every pregnant female will abort her load. And you will see the people drunk, even though they are not drunk—but the punishment of God is severe.",
    "And among the people are those who argue about God without knowledge, and follow every defiant devil.",
    "It was decreed for him, that whoever follows him: he will misguide him, and lead him into the suffering of the Blaze.",
    "O, people! If you are in doubt about the Resurrection: We created you from dust, then from a drop, then from a clinging clot, then from a lump—developed and undeveloped. To clarify things for you. And We settle in the wombs what We will, for a designated term, and then We bring you out as infants. Then you may reach your maturity. Some of you will pass away, and some of you will reach the vilest age, so that after having known he may not know. And you see the earth still, but when We send down water on it, it vibrates and swells, and grows every delightful pair.",
    "That is because God is the Truth, and He gives life to the dead, and He is capable of everything.",
    "And the Hour is coming, there is no doubt about it, and God will resurrect those in the graves.",
    "And among the people are those who argue about God without knowledge, without guidance, and without an enlightening book.",
    "Turning aside in contempt, to lead away from God’s path. For him is humiliation in this life; and on the Day of Resurrection, We will make him taste the agony of burning.",
    "That is because of what your hands have advanced, and God is not unjust to the servants.",
    "And among the people are some who worship God on edge. If something good befalls him, he is content with it. But if an ordeal strikes him, he makes a turnaround, losing this world and the next. That is the obvious loss.",
    "He calls, apart from God, upon what neither harms him nor benefits him. That is the far straying.",
    "He calls upon one whose harm is closer than his benefit. What a miserable master, and what an evil companion.",
    "God will admit those who believe and do righteous deeds into Gardens beneath which rivers flow. God does whatever He wills.",
    "Whoever thinks that God will not help him in this life and in the Hereafter: let him stretch to the sky, then sever, then see if his cunning eliminates what enrages.",
    "And so We revealed it as Clear Verses, and God guides whomever He wills.",
    "Those who believe, and those who are Jewish, and the Sabeans, and the Christians, and the Zoroastrians, and the Associators—God will judge between them on the Day of Resurrection. God is Witness over everything.",
    "Do you not realize that to God prostrates everyone in the heavens and everyone on earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and the animals, and many of the people? But many are justly deserving of punishment. Whomever God shames, there is none to honor him. God does whatever He wills.",
    "Here are two adversaries feuding about their Lord. As for those who disbelieve: garments of fire will be tailored for them, and boiling water will be poured over their heads.",
    "Melting their insides, and their skins.",
    "And they will have maces of iron.",
    "Every time they try to escape the gloom, they will be returned into it: “Taste the suffering of burning!”",
    "But God will admit those who believe and do good deeds into Gardens beneath which rivers flow, where they will be adorned with bracelets of gold and pearls—and their clothing will be of silk.",
    "They were guided to the purity of speech. They were guided to the path of the Praised.",
    "As for those who disbelieve and repel from God’s path and from the Sacred House—which We have appointed for all people, residents and visitors alike. Whoever seeks to commit sacrilege in it: We will make him taste of a painful punishment.",
    "And We showed Abraham the location of the House: “Do not associate anything with Me. And purify My House for those who go around, and those who stand, and those who bow and prostrate.”",
    "And call the people to the pilgrimage. They will come to you on foot, and on every transport. They will come from every distant point.",
    "So that they may witness benefits for them, and celebrate God’s Name during the appointed days—for providing them with the livestock animals. So eat from it, and feed the suffering poor.",
    "Then let them perform their acts of purification, and fulfill their pledges, and circle the Ancient House.",
    "Thus it is. Whoever magnifies the sanctities of God—It is better for him in the sight of their Lord. Livestock is permitted to you, except what was recited to you. So shun the abomination of idols, and shun false speech.",
    "Being faithful to God, not associating with Him. Whoever ascribes partners to God—it is as though he has fallen from the sky, and is snatched by the birds, or is swept away by the wind to a distant abyss.",
    "So it is. Whoever magnifies the sacraments of God—it is from the reverence of the hearts.",
    "In them are benefits for you, until a specified time. Then their place is at the Ancient House.",
    "For every community, We have appointed a rite, so that they may pronounce God’s Name over the livestock He has provided them. Your God is One God, so to Him submit, and give good news to the humble.",
    "Those whose hearts tremble when God is mentioned, and those who endure what has befallen them, and those who perform the prayer and spend from what We have provided for them.",
    "And We made animal offerings among God’s rituals for you. There is good for you in them. So pronounce God’s Name over them when they line up. Then, when they have fallen on their sides: eat of them, and feed the needy who solicit and those who do not. Thus We subjected them to you, so you may give thanks.",
    "Neither their flesh nor their blood ever reaches God. What reaches Him is the reverence from you. Thus He subdued them to you, so that you may glorify God for having guided you. And give good news to the charitable.",
    "God defends those who believe. God does not love any ungrateful traitor.",
    "Permission is granted to those who are fought—because they were wronged. And God is able to give them victory.",
    "Those who were unjustly evicted from their homes, only for saying: “Our Lord is God.” Were it not for God’s repelling people, some by means of others, monasteries, churches, synagogues, and mosques, where God’s Name is commemorated much, would have been demolished. God supports those who stand up for Him. God is Strong, Honorable.",
    "Those who, when We establish them in the land, perform the prayer, and give regular charity, and command what is right, and forbid what is wrong. With God rests the outcome of events.",
    "And if they deny you—the people of Noah denied before them, as did Aad and Thamood.",
    "And the people of Abraham, and the people of Lot.",
    "And the residents of Median. And Moses was called a liar. Then I indulged the unbelievers. Then I seized them. So how was My rejection?",
    "How many a town have We destroyed while it did wrong? It has fallen in ruin, with stilled wells, and lofty mansions.",
    "Have they not journeyed through the earth, and had hearts to reason with, or ears to listen with? It is not the eyes that go blind, but it is the hearts, within the chests, that go blind.",
    "And they challenge you to hurry up the punishment. And God will never break His promise. But a day with your Lord is as a thousand years of your count.",
    "How many a town did I indulge, while it was unjust? Then I seized it. To Me is the destination.",
    "Say, “O people, I am a clear warner to you.”",
    "Those who believe and work righteousness: for them is forgiveness and a generous provision.",
    "But those who strive to discredit Our revelations: these are the inmates of the Blaze.",
    "We never sent a messenger before you, or a prophet, but when he desired, Satan interfered in his wishes. But God nullifies what Satan interjects, then God affirms His revelations. God is Knowing and Wise.",
    "To make Satan’s suggestions a trial for those whose hearts are diseased, and those whose hearts are hardened. The wrongdoers are in deep discord.",
    "So that those gifted with knowledge would know that it is the truth from your Lord, and thus believe in it, and so that their hearts soften to it. God guides those who believe to a straight path.",
    "Those who disbelieve will remain in doubt about it—until the Hour takes them by surprise, or there comes upon them the suffering of a desolate day.",
    "The authority on that Day will be God’s. He will judge between them. Those who believe and do good works will be in the Gardens of Delight.",
    "But as for those who disbelieve and reject Our revelations, for them will be a humiliating punishment.",
    "Those who emigrate in God’s way, and then get killed, or die, God will grant them a good provision. God is the Best of Providers.",
    "He will admit them an admittance they will be pleased with. God is Knowing and Clement.",
    "Thus it is. Whoever retaliates in equivalence to the injury he received, but then he is wronged again, God will assist him. God is Pardoning and Forgiving.",
    "That is because God merges the night into the day, and merges the day into the night, and because God is Hearing and Seeing.",
    "That is because God is the Reality, and what they call upon besides Him is vanity, and because God is the Sublime, the Grand.",
    "Do you not see that God sends down water from the sky, and the land becomes green? God is Kind and Aware.",
    "To Him belongs whatever is in the heavens and whatever is on earth. God is the Rich, the Praised.",
    "Do you not see that God has subjected to you whatever is on earth? And the ships sailing through the sea by His command? And He keeps the sky from falling down on earth, except by His permission. God is Gentle towards the people, Most Merciful.",
    "It is He who gave you life, then makes you die, then revives you. The human being is ever ungrateful.",
    "For every community, We have appointed rites that they fulfill. So let them not dispute with you over the matter. And invite to your Lord. You are on Straight Guidance.",
    "And if they argue with you, say, “God fully knows what you do.”",
    "God will judge between you on the Day of Resurrection concerning what you used to differ about.",
    "Do you not know that God knows everything in the heavens and on earth? This is in a Record. That is easy for God.",
    "Yet they worship, besides God, what He never authorized, and of which they have no knowledge. There is no helper for the wrongdoers.",
    "And when Our Clear Verses are read to them, you will recognize denial on the faces of those who disbelieve, as they nearly assault those who read Our revelations to them. Say, “Shall I inform you of something far worse than that? The Fire! God has promised it to those who disbelieve. What a miserable outcome!”",
    "O, people! A parable is presented, so listen to it: those you call upon besides God will never create a fly, even if they came together for that purpose. And if the fly snatches anything from them, they cannot recover it from it. Weak is the pursuer and the pursued.",
    "They do not appreciate God as He should be appreciated. God is Strong, Mighty.",
    "God selects messengers from among the angels, and from among the people. God is Hearing and Seeing.",
    "He knows what is ahead of them, and what is behind them. And to God, all matters will be returned.",
    "O you who believe! Bow down, and prostrate, and worship your Lord, and do good deeds, so that you may succeed.",
    "And strive for God, with the striving due to Him. He has chosen you, and He has not burdened you in religion—the way of your father Abraham. It is he who named you Muslims before, and in this. So that the Messenger may be a witness over you, and you may be witnesses over the people. So pray regularly, and give regular charity, and adhere to God. He is your Guardian. What an excellent Master, and what an excellent Helper."
  ]
}