{
  "id": 25,
  "name": "الفرقان",
  "transliteration": "al-Furqan",
  "translation": "The Criterion",
  "verses": [
    "Blessed is He who sent down the Criterion to His servant, that he may be a warner to humanity.",
    "He to whom belongs the kingdom of the heavens and the earth, who took to Himself no son, who never had a partner in His sovereignty, who created everything and determined its measure.",
    "And yet, instead of Him, they produce for themselves gods that create nothing, but are themselves created; that have no power to harm or benefit them; that have no control over death, or life, or resurrection.",
    "Those who disbelieve say, “This is nothing but a lie he fabricated, and others have helped him at it.” They have committed injustice and perjury.",
    "And they say, “Legends of the ancients; he wrote them down; they are dictated to him morning and evening.”",
    "Say, “It was revealed by He who knows the secret in the heavens and the earth. He is always Forgiving and Merciful.”",
    "And they say, “What sort of a messenger is this, who eats food, and walks in the marketplaces? If only an angel was sent down with him, to be alongside him a warner.”",
    "Or, “If only a treasure was dropped on him.” Or, “If only he had a garden from which he eats.” The unjust also say, “You are only following a man under a spell.”",
    "Look how they invent examples for you. They have gone astray, and cannot find a way.",
    "Blessed is He, who, if He wills, can give you better than that: gardens beneath which rivers flow, and He will give you palaces.",
    "But they deny the Hour, and We have prepared for those who deny the Hour a Blaze.",
    "When it sees them from a distant place, they will hear it raging and roaring.",
    "And when they are thrown into it, into a narrow place, shackled, they will plead there for death.",
    "“Do not plead for one death today, but plead for a great many deaths.”",
    "Say, “Is this better, or the Garden of Eternity promised to the cautious?” It is for them a reward and a destination.",
    "They will have there whatever they desire, forever. This is upon your Lord a binding promise.",
    "On the Day when He gathers them, along with what they worshiped besides God, He will say, “Was it you who misled these servants of Mine, or was it they who lost the way?”",
    "They will say, “Glory be to You. It was not for us to take any lords besides You. But you gave them enjoyments, and their ancestors, until they forgot the Remembrance and became ruined people.”",
    "They have denied you because of what you say; so you can neither avert, nor help. Whoever among you commits injustice, We will make him taste a horrible punishment.",
    "We sent no messengers before you, but they ate food and walked in the marketplaces. And We made some of you a trial for one another—will you be patient? Your Lord is always Observing.",
    "Those who do not expect to meet Us, say, “If only the angels were sent down to us, or we could see our Lord.” They have grown proud within themselves, and they have become excessively defiant.",
    "On the Day when they see the angels—there will be no good news for the guilty on that Day; and they will say, “A forbidden ban!”",
    "And We will proceed to their deeds, and We will reduce them to scattered dust.",
    "The inhabitants of Paradise on that Day will be better lodged, and most beautifully accommodated.",
    "On the Day when the sky will burst with clouds, and the angels are sent down in streams.",
    "On that Day, true sovereignty will belong to the Compassionate. And that will be a difficult Day for the unbelievers.",
    "On that Day, the wrongdoer will bite his hands, and say, “If only I had followed a way with the Messenger.",
    "Woe to me; I wish I never took so-and-so for a friend.",
    "He led me away from the Message after it came to me, and Satan has always been a betrayer of man.”",
    "And the Messenger will say, “My Lord, my people have abandoned this Quran.”",
    "Likewise, to every prophet We assign enemies from among the guilty. But your Lord suffices as a Guide and Helper.",
    "Those who disbelieve say, “Why was the Quran not revealed to him at once?” Thus to strengthen your heart with it, and We revealed it in stages.",
    "Whatever argument they come to you with, We provide you with the truth, and a better explanation.",
    "Those who are herded into Hell on their faces—these are in a worse position, and further astray from the way.",
    "We gave Moses the Scripture, and We appointed his brother Aaron as a helper.",
    "We said, “Go to the people who rejected Our signs.” Then We destroyed them completely.",
    "And the people of Noah: when they rejected the messengers, We drowned them, and We made them a lesson for humanity. And We have prepared for the wrongdoers a painful punishment.",
    "And Aad, and Thamood, and the inhabitants of Arras, and many generations in between.",
    "To each, We presented the parables, and each We devastated utterly.",
    "And they came upon the town that was drenched by the terrible rain. Did they not see it? But they do not hope for resurrection.",
    "And when they see you, they take you for nothing but a joke: “Is this the one God sent as a messenger?”",
    "“He almost led us away from our gods, had we not adhered to them.” But they will know, when they see the suffering, who is further away from the way.",
    "Have you considered him who took his desire as his god? Would you be an agent for him?",
    "Or do you assume that most of them hear or understand? They are just like cattle, but even more errant in their way.",
    "Do you not see how your Lord extends the shade? Had He willed, He could have made it stationary. And We made the sun a pointer to it.",
    "Then We withdraw it towards Us, a gentle withdrawal.",
    "And it is He who made the night a covering for you—and sleep for rest. And He made the day a revival.",
    "And it is He who sends the winds, ushering His mercy; and We send down from the sky pure water.",
    "To revive dead lands thereby, and to provide drink for the multitude of animals and humans We created.",
    "We have circulated it among them, so that they may reflect, but most people persist in thanklessness.",
    "Had We willed, We could have sent a warner to every town.",
    "So do not obey the unbelievers, but strive against them with it, a grand struggle.",
    "And it is He who merged the two seas: this one sweet and drinkable, and the other salty and bitter. And He placed between them a barrier and an impassable boundary.",
    "And it is He who created the human being from a fluid, and made of him relationships through marriage and mating. Your Lord has always been Capable.",
    "And yet, instead of God, they serve what can neither benefit them nor harm them. The unbeliever has always turned his back on his Lord.",
    "We sent you only as a deliverer of good news and a warner.",
    "Say, “I ask of you no payment for this—only that whoever wills may take a path to his Lord.”",
    "And put your trust in the Living, Who never dies; and celebrate His praises. Sufficient is He as the All-Informed Knower of the faults of His servants.",
    "He who created the heavens and the earth and everything between them in six stages—then He settled on the Throne. The Most Merciful. Ask about Him a well-informed.",
    "And when it is said to them, “Prostrate before the Compassionate,” they say, “And what is the Compassionate? Are we to prostrate before whatever you command us?” And it increases them in aversion.",
    "Blessed is He who placed constellations in the sky—and placed in it a lamp, and a luminous moon.",
    "And it is He who made the night and the day successive—for whoever desires to reflect, or desires to show gratitude.",
    "The worshipers of the Gracious are those who walk on the earth modestly, and when the ignorant address them, they say, “Peace.”",
    "And those who pass the night before their Lord, prostrating and standing.",
    "And those who say, ‘‘Our Lord! Avert the suffering of Hell from us! Its suffering is continuous.",
    "It is a miserable residence and destination.”",
    "And those who, when they spend, are neither wasteful nor stingy, but choose a course in between.",
    "And those who do not implore besides God any other god, and do not kill the soul which God has made sacred—except in the pursuit of justice—and do not commit adultery. Whoever does that will face penalties.",
    "The punishment will be multiplied for him on the Day of Resurrection, and he will remain in it forever, humiliated.",
    "Except for those who repent, and believe, and perform righteous deeds. These—God will replace their bad deeds with good deeds. God is ever Forgiving, Most Merciful.",
    "Whoever repents and acts righteously—has returned to God in repentance.",
    "And those who do not bear false witness, and when they come across indecencies, they pass by with dignity.",
    "And those who, when reminded of their Lord’s revelations, do not fall against them deaf and blind.",
    "And those who say, “Our Lord! Give us comfort in our spouses and offspring. And make us a good example for the righteous.”",
    "It is they who will be awarded the Chamber for having persevered—and will be greeted there with salutations and peace.",
    "Remaining in there forever—it is an excellent residence and destination.",
    "Say, “What weight would my Lord give you, were it not for your prayer? But you have denied, and it will be inevitable.”"
  ]
}