{
  "id": 30,
  "name": "الروم",
  "transliteration": "ar-Rum",
  "translation": "The Romans",
  "verses": [
    "Alif. Lam. Meem.",
    "The Romans were defeated.",
    "In a nearby territory. But after their defeat, they will be victorious.",
    "Within a few years. The matter is up to God, in the past, and in the future. On that day, the believers will rejoice.",
    "In God’s victory. He gives victory to whom He wills. He is the Almighty, the Merciful.",
    "The promise of God—God never breaks His promise, but most people do not know.",
    "They know an outer aspect of the worldly life. But of the Hereafter, they are heedless.",
    "Do they not reflect within themselves? God did not create the heavens and the earth, and what is between them, except in truth, and for a specific duration. But most people, regarding meeting their Lord, are in denial.",
    "Have they not traveled the earth, and observed how those before them ended up? They were more powerful than them, and they cultivated the land and developed it more than they developed it, and their messengers came to them with clear proofs. God would never wrong them, but they used to wrong themselves.",
    "Then, evil was the end of those who committed evil. That is because they rejected God’s revelations and ridiculed them.",
    "God originates creation, then He repeats it. Then to Him, you will be returned.",
    "On the Day when the Hour takes place, the guilty will despair.",
    "They will have no intercessors from among their partners, and they will disown their partners.",
    "On the Day when the Hour takes place—on that Day, they will separate.",
    "As for those who believed and did good works—they will be delighted in meadows.",
    "But as for those who disbelieved, and rejected Our signs and the meeting of the Hereafter—these will be hauled into the suffering.",
    "So praise God when you retire at night, and when you rise in the morning.",
    "His is the praise in the heavens and on earth, and in the evening, and when you reach midday.",
    "He brings the living from the dead, and He brings the dead from the living, and He revives the land after its death. Likewise, you will be resurrected.",
    "And among His signs is that He created you from dust—then—you are human beings spreading out.",
    "And among His signs is that He created for you spouses from among yourselves, so that you may find tranquility in them; and He planted between you love and compassion. In this are signs for people who think.",
    "And among His signs is the creation of the heavens and the earth, and the diversity of your languages and colors. In this are signs for the learned.",
    "And among His signs is your sleep by night and day, and your pursuit of His bounties. In this are signs for people who listen.",
    "And among His signs is that He shows you the lightning, causing fear and hope. And He sends down rain from the sky, and with it, He revives the earth after its death. In this are signs for people who understand.",
    "And among His signs is that the sky and the earth persist by His command. And then, when He calls you from the earth, you will emerge at once.",
    "And to Him belongs whoever is in the heavens and on earth—all are devoutly obedient to Him.",
    "And it is He who starts the creation and then reproduces it—something easy for Him. And to Him belong the finest attributes in the heavens and on earth; and He is the Powerful, the Wise.",
    "He illustrates an example for you, from your own selves: would you make your servants equal partners in the wealth We have given you? Do you revere them as you revere one another? Thus We explain the revelations for a people who understand.",
    "Yet those who do wrong follow their desires without knowledge. But who can guide whom God leaves astray? And there are no helpers for them.",
    "So devote yourself to the faith of monotheism—the natural way God has instilled in people. There is no change in God’s creation. This is the upright religion, but most people do not know.",
    "Turning to Him. And be conscious of Him, and perform the prayer, and do not be of the polytheists.",
    "Of those who divided their religion and became factions—each party rejoicing in what they have.",
    "When harm touches the people, they call on their Lord, turning to Him in repentance. But then, when He lets them taste of His mercy, some of them attribute partners to their Lord.",
    "To show ingratitude for what We have given them. Indulge yourselves—you will soon know.",
    "Or have We sent down to them an authority which speaks of what they associated with Him?",
    "And when We give people a taste of mercy, they rejoice in it. But when adversity befalls them, because of what their hands have perpetrated, they begin to despair.",
    "Do they not consider that God expands the provision for whom He wills, or restricts it? Surely in this are signs for people who believe.",
    "So give the relative his rights, and the destitute, and the wayfarer. That is best for those who seek God’s attention. It is they who are the successful.",
    "The usury you practice, seeking thereby to increase people’s wealth, will not increase with God. But what you give in charity, desiring God’s attention—these are the multipliers.",
    "God is He who created you, then provides for you, then makes you die, then brings you back to life. Can any of your partners do any of this? Glorified is He and Exalted above what they associate.",
    "Corruption has appeared on land and sea, because of what people’s hands have earned, to make them taste some of what they have done, so they may return.",
    "Say, “Travel through the earth, and observe the final fate of those who came before. Most of them were polytheists.”",
    "So devote yourself to the lasting religion, before the coming of a Day from God that cannot be repelled. On that Day, they will be shocked.",
    "Whoever disbelieves, his disbelief falls upon him. And whoever acts righteously—they are preparing for themselves.",
    "So that He may reward those who believe and do good deeds, out of His grace. He does not love the unbelievers.",
    "And of His signs is that He sends the winds, ushering in good news, to give you a taste of His mercy, and so that ships may sail by His command, and so that you may seek of His bounty, and so that you may give thanks.",
    "We sent messengers to their people before you, and they brought them clear proofs. Then We took revenge on those who were guilty. It is incumbent on Us to help the believers.",
    "God is He who sends the winds. They stir up clouds. Then He spreads them in the sky as He wills. And He breaks them apart. Then you see raindrops issuing from their midst. Then, when He makes it fall upon whom He wills of His servants, then they become cheerful.",
    "Although, they were before this—before it was sent down on them—in despair.",
    "So observe the impact of God’s mercy: how He revives the earth after its death. That is the Reviver of the dead, and He is capable of all things.",
    "But if We send a wind, and they see it turning things yellow, they would continue thereafter to disbelieve.",
    "You cannot make the dead hear, nor can you make the deaf hear the call when they turn away.",
    "Nor can you lead the blind out of their misguidance. You can make none hear, except those who believe in Our messages and are submitters.",
    "God is He Who created you weak, then after weakness, He gave you strength, then after strength, He gave you weakness and gray hair. He creates whatever He wills. He is the Knowing, the Able.",
    "On the Day when the Hour takes place, the guilty will swear they had stayed for only an hour. Thus they were deluded.",
    "But those endowed with knowledge and faith will say, “You remained in God’s Book until the Day of Resurrection. This is the Day of Resurrection, but you did not know.”",
    "On that day, the excuses of those who did wrong will not benefit them, nor can they make amends.",
    "We have cited in this Quran for people every sort of parable. And even if you were to bring them a miracle, those who disbelieve would say, “You are nothing but falsifiers.”",
    "Thus God seals the hearts of those who do not know.",
    "So be patient. The promise of God is true. And let not those who lack certainty belittle you."
  ]
}