{
  "id": 34,
  "name": "سبإ",
  "transliteration": "Saba'",
  "translation": "Sheba",
  "verses": [
    "Praise be to God, to Whom belongs everything in the heavens and the earth. And His is the praise in the Hereafter. And He is the Wise, the Expert.",
    "He knows what penetrates into the earth, and what comes out of it, and what descends from the sky, and what ascends to it. He is the Merciful, the Forgiving.",
    "Those who disbelieve say, “The Hour will not come upon us.” Say, “Yes, by my Lord, it will come upon you. The Knower of the unseen.” Not an atom’s weight evades Him in the heavens or on earth, nor smaller than that, nor larger, but is in a clear Record.",
    "So that He may reward those who believe and do good deeds. These will have forgiveness and a generous provision.",
    "As for those who strive against Our revelations, trying to undermine them—for them is a punishment of a painful plague.",
    "Those gifted with knowledge see that what was revealed to you from your Lord is the truth; and it guides to the path of the Majestic, the Praiseworthy.",
    "Those who disbelieved said, “Shall we show you a man, who will inform you, that once torn into shreds, you will be in a new creation?",
    "Did he invent a lie about God, or is he insane?” In fact, those who do not believe in the Hereafter are in torment and extensive error.",
    "Have they not looked at what is ahead of them and what is behind them, of the sky and the earth? If We willed, We could make the ground cave in beneath them, or make pieces of the sky fall on them. In this is a sign for every devout worshiper.",
    "We bestowed upon David favor from Us: “O mountains! Echo his hymns. And the birds.” And We softened iron for him.",
    "“Make coats of armor. And measure the links well. And work righteousness. I am Observant of everything you do.”",
    "And for Solomon, the wind—its outward journey was one month, and its return journey was one month. And We made a spring of tar flow for him. And there were sprites that worked of him, by the leave of his Lord. But whoever of them deviated from Our command, We made him taste of the punishment of the Inferno.",
    "They made for him whatever he desired: sanctuaries, statues, basins like reservoirs, and heavy cauldrons. “O House of David, work with appreciation,” but a few of My servants are thankful.",
    "Then, when We decreed death for him, nothing indicated his death to them except an earthworm eating at his staff. And when he collapsed, it became clear to the sprites: that had they known the unseen, they would not have remained in the humiliating punishment.",
    "In Sheba’s homeland, there was a sign for them: two gardens, on the right, and on the left. “Eat of your Lord’s provision, and give thanks to Him.” A good land, and a forgiving Lord.",
    "But they turned away. So We unleashed against them the flood of the dam, and We substituted their two gardens with two gardens of bitter fruits, fruitless bushes, and a few thorny shrubs.",
    "We thus penalized them for their ingratitude. Would We penalize any except the ungrateful?",
    "And We placed between them and the towns that We blessed prominent towns, and We made the travel between them easy. “Travel between them by night and day, safely.”",
    "But they said, “Our Lord, lengthen the distances of our journeys.” They wronged themselves. So We made them history, and We scattered them in every direction. In this are lessons for every patient, appreciative person.",
    "Iblis was correct in his assessment of them. They followed him, except for a group among the believers.",
    "He has no authority over them. But We wanted to know who believes in the Hereafter, and who is in doubt about it. Your Lord is Guardian over all things.",
    "Say, “Call upon those you claim besides God. They do not possess an atom's weight in the heavens or the earth, nor do they possess any partnership in them. And He has no backers from among them.”",
    "Intercession with Him is of no benefit, except for someone He has permitted. Until, when fear has subsided from their hearts, they will say, “What did your Lord say?” They will say, “The truth, and He is the High, the Great.”",
    "Say, “Who provides for you from the heavens and the earth?” Say, “God. And either you, or we, are upon guidance, or in evident error.”",
    "Say, “You will not be asked about our misdeeds, nor will we be asked about what you do.”",
    "Say, “Our Lord will bring us together. Then He will judge between us equitably. He is the All-Knowing Arbiter.”",
    "Say, “Show me those you have attached to Him as associates. No indeed! In fact, He is God, the Powerful and the Wise.”",
    "We did not send you, except as a deliverer of good news and a warner—to all of humanity. But most people do not know.",
    "And they say, “When will this promise come true—if you are truthful?”",
    "Say, “You have an appointment for a Day which you cannot postpone by one hour, nor bring forward.”",
    "Those who disbelieve say, “We will never believe in this Quran, nor in what came before it.” If only you could see the wrongdoers, captive before their Lord, throwing back allegations at one another. Those who were oppressed will say to those who were arrogant, “Were it not for you, we would have been believers.”",
    "Those who were arrogant will say to those who were oppressed, “Was it us who turned you away from guidance when it came to you? No indeed, you yourselves were guilty.”",
    "And those who were oppressed will say to those who were arrogant, “It was your scheming by night and by day, ordering us to reject God, and to set up rivals to Him.” But they will hide their remorse when they see the punishment. We will put yokes around the necks of those who disbelieved. Will they be repaid except for what they used to do?",
    "We sent no warner to any town without its affluent saying, “We reject what you are sent with.”",
    "And they say, “We have more wealth and children, and we will not be punished.”",
    "Say, “My Lord spreads out His bounty to whom He wills, or restricts it. But most people do not know.”",
    "It is neither your wealth nor your children that bring you closer to Us, but those who believe and work righteousness—these will have a double reward for what they did, and they will be secure in lofty chambers.",
    "As for those who endeavor to undermine Our revelations—these will be summoned to the punishment.",
    "Say, “My Lord gives abundantly to whom He wills of His servants—or withholds it. Whatever you spend, He will replace it; and He is the Best of providers.”",
    "On the Day when He gathers them all together, then say to the angels, “Was it you these used to worship?”",
    "They will say, “Be You glorified; You are our Master, not them. In fact, they used to worship the jinn, and most of them had faith in them.”",
    "“So today, none of you has the power to benefit or harm the other.” And We will say to those who did wrong, “Taste the agony of the Fire, which you used to deny.”",
    "And when Our enlightening Verses are recited to them, they say, “This is nothing but a man who wants to prevent you from what your ancestors worshiped.” And they say, “This is nothing but a fabricated lie.” And those who disbelieve say of the Truth when it has come to them, “This is nothing but plain magic.”",
    "Although We had never given them any scriptures to study, nor did We ever send them a warner before you.",
    "Those before them also denied. And they have not attained even one-tenth of what We had given them. They denied My messengers, so how was My rejection?",
    "Say, “I offer you a single advice: devote yourselves to God, in pairs, or individually. Then think. Your friend is not crazy. He is just a warner to you, before the advent of severe punishment.”",
    "Say, “Had I ever asked you for a reward, it is yours. My reward is only from God, and He is Witness over all things.”",
    "Say, “My Lord projects the truth, Knower of the Unseen.”",
    "Say, “The Truth has come; while falsehood can neither originate, nor regenerate.”",
    "Say, “If I go astray, I go astray only to my own loss. And if I am guided, it is through what my Lord inspires me. He is Hearing and Near.”",
    "And if only you could see, when they will be horrified, and there is no escape, and they are seized from a nearby place.",
    "And they say, “We have believed in it.” But how can they attain it from a distant place?",
    "They have disbelieved it in the past. And they made allegations from a distant place.",
    "And a barrier will be placed between them and what they desire, as was done with their counterparts before. They are confounded by doubt."
  ]
}