{
  "id": 36,
  "name": "يس",
  "transliteration": "Ya-Seen",
  "translation": "Ya Sin",
  "verses": [
    "Ya. Seen.",
    "By the Wise Quran.",
    "You are one of the messengers.",
    "On a straight path.",
    "The revelation of the Almighty, the Merciful.",
    "To warn a people whose ancestors were not warned, so they are unaware.",
    "The word has been justified against most of them—for they do not believe.",
    "We placed shackles upon their necks, up to their chins, so they are forced up.",
    "And We placed a barrier in front of them, and a barrier behind them, and We enshrouded them; so they cannot see.",
    "And it is the same for them, whether you warn them, or do not warn them—they will not believe.",
    "You only warn whoever follows the Message and fears the Compassionate unseen. So give him the good news of forgiveness and a generous reward.",
    "It is We who give life to the dead. And We write what they have forwarded, and their traces. We keep track of all things in a Clear Registry.",
    "And give them the example of the inhabitants of the town, when the messengers came to it.",
    "We sent to them two messengers, but they denied both, so We reinforced them with a third. They said, “We are sent to you.”",
    "They said, “You are only humans like us, and the Compassionate did not reveal anything. You are only lying.”",
    "They said, “Our Lord knows that we are sent to you.",
    "And our only duty is clear delivery.”",
    "They said, “We see a bad omen in you. If you do not give up, we will stone you, and a painful punishment from us will befall you.”",
    "They said, “Your bad omen is within yourselves. Is it because you were reminded? In fact, you are excessive people.”",
    "And a man came running from the outskirts of the city. He said, “O my people, follow the messengers.",
    "Follow those who ask of you no payment—and are themselves guided.",
    "“And why should I not worship Him Who originated me, and to Whom you will be returned?",
    "Shall I take gods apart from Him? If the Beneficent intends harm for me, their intercession would not avail me at all, nor would they save me.",
    "In that case, I would be completely lost.",
    "I have believed in your Lord, so listen to me.”",
    "It was said, “Enter Paradise.” He said, “If only my people knew.",
    "How my Lord has forgiven me, and made me of the honored.”",
    "After him, We sent down no hosts from heaven against his people, nor would We send down.",
    "It was just a single Shout, and they were extinguished.",
    "Alas for the servants! Never did a messenger come to them, but they ridiculed him.",
    "Have they not considered how many generations We destroyed before them? How none of them returned to them?",
    "All of them, every single one of them, will be summoned before Us.",
    "And there is a sign for them in the dead earth: We give it life, and We produce from it grains from which they eat.",
    "And We placed in it gardens of date-palms and grapevines, and We caused springs to gush out of it.",
    "So that they may eat of its fruit—although their hands did not make it. Will they not be thankful?",
    "Glory be to He, who created all the pairs, of whatever the earth grows, and of themselves, and of what they do not know.",
    "Another sign for them is the night: We strip the day from it—and they are in darkness.",
    "And the sun runs its course towards its destined point. That is the design of the Almighty, the All-Knowing.",
    "And the moon: We have disposed it in phases—until it returns like the old twig.",
    "The sun is not to overtake the moon, nor is the night to outpace the day. Each glides in an orbit.",
    "Another sign for them is that We carried their ancestors in the loaded Ark.",
    "And We created for them the like of it, in which they ride.",
    "If We willed, We could drown them—with no screaming to be heard from them, nor will they be saved.",
    "Except by mercy from Us, and enjoyment for a while.",
    "Yet when it is said to them, “Beware of what is ahead of you, and what is behind you, so you may receive mercy .”",
    "Never came to them a sign of their Lord’s signs, but they turned away from it.",
    "And when it is said to them, “Donate from what God has provided for you,” those who disbelieve say to those who believe, “Should we feed someone whom God could have fed if He wanted to? You are clearly astray.”",
    "And they say, “When will this promise come about—if you are truthful?”",
    "All they can expect is a single blast, which will seize them while they feud.",
    "They will be unable to make a will. And they will not return to their families.",
    "And the Trumpet will be blown: and at once, they will rush from the graves to their Lord.",
    "They will say, “Woe to us! Who resurrected us from our resting-place?” This is what the Mercy-Giver had promised; the messengers have told the truth.”",
    "It will be but a single Scream: and at once, they will all be arraigned before Us.",
    "On that Day, no soul will be wronged in the least, and you will be rewarded only for what you used to do.",
    "The inhabitants of Paradise, on that Day, will be happily engaged.",
    "They and their spouses, in shades, reclining on couches.",
    "There they will have fruits. They will have whatever they ask for.",
    "Peace—a saying from a Most Merciful Lord.",
    "But step aside today, you criminals.",
    "Did I not covenant with you, O Children of Adam, that you shall not worship Satan? That he is your sworn enemy?",
    "And that you shall worship Me? This is a straight path.",
    "He has misled great multitudes of you. Did you not reason?",
    "This is Gehenna that you were promised.",
    "Roast in it today, for having disbelieved.",
    "On that Day, We will seal their mouths, and their hands will speak to Us, and their feet will testify to what they used to earn.",
    "And had We willed, We would have blotted out their eyes. Then they would race to the path; yet how would they see?",
    "And had We willed, We would have transformed them in their place. Then they could neither advance, nor go back.",
    "Whomever We give long life, We decline his development. Do they not understand?",
    "We did not teach him poetry, nor is it suitable for him. It is only a reminder and a Clear Quran.",
    "To warn whoever is alive, and to prove the Word against the faithless.",
    "Have they not considered that We created for them, of Our Handiwork, livestock that they own?",
    "And We subdued them for them. Some of them they ride, and some they eat.",
    "And they have in them other benefits—and beverages. Will they not give thanks?",
    "Yet they have taken to themselves gods other than God, that perhaps they may be helped.",
    "They cannot help them, although they are arrayed as troops for them.",
    "So do not let their words sadden you. We know what they conceal, and what they disclose.",
    "Does the human being not consider that We created him from a drop? Yet he becomes a fierce adversary.",
    "And he produces arguments against Us, and he forgets his own creation. He says, “Who will revive the bones when they have decayed?”",
    "Say, “He who initiated them in the first instance will revive them. And He knows every creation.”",
    "He who produced for you fuel from the green trees, with which you kindle fire.",
    "Is not He who created the heavens and the earth able to create the like of them? Certainly. He is the All-Knowing Creator.",
    "His command, when He wills something, is to say to it, “Be,” and it comes to be.",
    "So glory be to Him, in whose hand is the dominion of all things, and to Him, you will be returned."
  ]
}