{
  "id": 37,
  "name": "الصافات",
  "transliteration": "as-Saffat",
  "translation": "Those who set the Ranks",
  "verses": [
    "By the aligners aligning.",
    "And the drivers driving.",
    "And the reciters of the Reminder.",
    "Your God is certainly One.",
    "Lord of the heavens and the earth, and everything between them, and Lord of the Easts.",
    "We have decorated the lower heaven with the beauty of the planets.",
    "And protection from every defiant devil.",
    "They cannot eavesdrop on the Supernal Elite, for they get bombarded from every side.",
    "Repelled—they will have a lingering torment.",
    "Except for him who snatches a glimpse—he will be pursued by a piercing flare.",
    "Inquire of them, “Are they more difficult to create, or those We created?” We created them from sticky clay.",
    "But you wonder, and they ridicule.",
    "And when reminded, they pay no attention.",
    "And when they see a sign, they ridicule.",
    "And they say, “This is nothing but obvious magic.",
    "When we have died and become dust and bones, are we to be resurrected?",
    "And our ancestors of old?”",
    "Say, “Yes indeed, and you will be subdued.”",
    "It will be a single nudge, and they will be staring.",
    "And they will say, “Woe to us, this is Judgement Day.”",
    "“This is the Day of Separation that you used to deny.",
    "Gather those who did wrong, and their types, and what they used to worship.",
    "Besides God, and lead them to the path of Hell.",
    "And stop them. They are to be questioned.”",
    "What is the matter with you? Why do you not help one another?",
    "In fact, on that Day, they will be submissive.",
    "They will turn to one another, questioning one another.",
    "They will say, “You used to approach us from the right.”",
    "They will say, “You yourselves were not believers.",
    "We had no authority over you. You yourselves were oppressive people.",
    "So the Word of our Lord is justified against us. We are tasting it.",
    "We seduced you. We were seducers.”",
    "On that Day, they will share in the punishment.",
    "Thus We deal with the guilty.",
    "When it was said to them, “There is no god except God,” they became arrogant.",
    "And said, “Are we to give up our gods for a mad poet?”",
    "In fact, he came with the truth, and he confirmed the messengers.",
    "Most certainly, you will taste the painful punishment.",
    "And you will be repaid only for what you used to do.",
    "Not so for God’s chosen worshipers.",
    "For them is a known provision.",
    "Fruits—and they will be honored.",
    "In the Gardens of Bliss.",
    "On furnishings, facing one another.",
    "A cup from a flowing spring will be circulated among them.",
    "White and delicious to the drinkers.",
    "Never polluted—and never intoxicating.",
    "With them will be maidens of modest gaze with lustrous eyes.",
    "As if they were guarded pearls.",
    "And they will approach one another, questioning.",
    "One of them will say, “I used to have a close friend.",
    "Who used to say, “Are you among those who believe?",
    "That after we die and become dust and bones, we will be called to account?”",
    "He will say, “Will you have a look?”",
    "So he will look, and He will see him in the midst of Hellfire.",
    "He will say, “By God, you almost ruined me.",
    "Were it not for my Lord’s favor, I would have been among the arraigned.”",
    "“We will not die.",
    "Except for our first death, and we will not be punished.”",
    "This is the great victory.",
    "For the like of this let the workers work.",
    "Is this a better hospitality, or the Tree of Bitterness?",
    "We made it an ordeal for the unjust.",
    "It is a tree that grows from the depths of Hellfire.",
    "Its sprouts are like the devils’ heads.",
    "They will eat from it, and fill their bellies with it.",
    "Then, on top of it, they will have a boiling brew.",
    "Then their return will be to the Blaze.",
    "They had found their parents astray.",
    "And they rushed along in their footsteps.",
    "And most of the ancients before them went astray.",
    "Although We had sent warners among them.",
    "So observe the final fate of those who were warned.",
    "Not so for God’s devoted servants.",
    "And Noah called out to Us, and We are the Best of responders.",
    "And We saved him and his family from the great calamity.",
    "And We made his descendants the survivors.",
    "And We left mention of him among later generations.",
    "Peace be upon Noah, among all people.",
    "Thus We reward the good-doers.",
    "He was one of Our believing servants.",
    "Then We drowned the others.",
    "And of his kind was Abraham.",
    "When he came to his Lord with a sound heart.",
    "When he said to his father and his people, “What are you worshiping?",
    "Is it falsified gods, instead of God, that you want?",
    "What is your opinion about the Lord of the Worlds?”",
    "Then he took a glance at the stars.",
    "And said, “I am sick.”",
    "But they turned their backs on him, and went away.",
    "Then he turned to their gods, and said, “Will you not eat?",
    "What is wrong with you, that you do not speak?”",
    "Then he turned on them, striking with the right hand.",
    "And they came to him rushing.",
    "He said, “Do you worship what you carve?",
    "When it is God Who created you, and what you manufacture?”",
    "They said, “Construct a pyre for him, and throw him into the furnace.”",
    "They desired to scheme against him, so We made them the lowest.",
    "And he said, “I am going to my Lord—He will guide me.”",
    "“My Lord, grant me one of the righteous.”",
    "So We gave him the good news of a gentle boy.",
    "Then, when he became old enough to work with him, he said, “O My son, I see in a dream that I am slaughtering you; so see what you think.” He said, “O my father, do as you are commanded; you will find me, God willing, patient.”",
    "Then, when they submitted, and he put his forehead down.",
    "We called to him, “O Abraham!",
    "You have fulfilled the vision.” Thus We reward the doers of good.",
    "That was clearly an obvious test.",
    "And We redeemed him with a great sacrifice.",
    "And We left with him for later generations.",
    "Peace be upon Abraham.",
    "Thus We reward the good-doers.",
    "He was one of Our believing servants.",
    "And We gave him the good news of Isaac, a prophet from the righteous.",
    "And We blessed him, and Isaac. And among their descendants are good-doers. And others who clearly wrong themselves.",
    "And We have favored Moses and Aaron.",
    "And We saved them and their people from the terrible disaster.",
    "And We supported them, so they became the victors.",
    "And We gave them the Clarifying Scripture.",
    "And We guided them on the straight path.",
    "And We left with them for later generations.",
    "Peace be upon Moses and Aaron.",
    "Thus We reward the righteous.",
    "They were of Our believing servants.",
    "Also, Elijah was one of the messengers.",
    "He said to his people, “Do you not fear?",
    "Do you call on Baal, and forsake the Best of creators?",
    "God is your Lord, and the Lord of your forefathers.”",
    "But they called him a liar, so they will be brought.",
    "Not so for God’s chosen servants.",
    "And We left with him for later generations.",
    "Peace be upon the House of Elijah.",
    "Thus We reward the virtuous.",
    "He was one of Our faithful servants.",
    "And Lot was one of the messengers.",
    "When We saved him and his family, all together.",
    "Except for an old woman, who was among the laggards.",
    "Then We annihilated the others.",
    "You pass by them in the morning.",
    "And at night. Will you not understand?",
    "And Jonah was one of the messengers.",
    "When he fled to the overloaded ship.",
    "He gambled and lost.",
    "Then the whale swallowed him, and he was to blame.",
    "Had he not been among those who praised.",
    "He would have remained in its belly until the Day they are raised.",
    "Then We threw him into the open, and he was worn out.",
    "And We made a grout tree grow over him.",
    "Then We sent him to a hundred thousand, or more.",
    "And they believed, so We gave them enjoyment for a while.",
    "Ask them, “Are the daughters for your Lord, and the sons for them?”",
    "Or did We create the angels females, and they were witnesses?”",
    "No indeed! It is of their perversions when they say.",
    "“God has begotten.” They are certainly liars.",
    "So He preferred girls over boys?",
    "What is the matter with you? How do you judge?",
    "Do you not reflect?",
    "Or do you have some compelling proof?",
    "Then bring your book, if you are truthful.",
    "And they invented a relationship between Him and the jinn. But the jinns know that they will be summoned.",
    "God be glorified, far above what they describe.",
    "Not so for God’s sincere worshipers.",
    "You and whatever you worship.",
    "Cannot seduce away from Him.",
    "Except for him who will roast in Hell.",
    "“There is not one of us but has an assigned position.",
    "And we are the arrangers.",
    "And we are the glorifiers.”",
    "Even though they used to say.",
    "“Had we received advice from the ancients.",
    "We would have been of God's faithful worshipers.”",
    "But they rejected it, so they will soon know.",
    "And Our word already went out to Our servants, the messengers.",
    "That it is they who will be helped.",
    "And Our forces will be the victors.",
    "So turn away from them for a while.",
    "And watch them—they will soon see.",
    "Do they want Our punishment in a hurry?",
    "When it descends on their courtyard, miserable will be the morning of those forewarned.",
    "So turn away from them for a while.",
    "And watch—they will soon see.",
    "Glorified is your Lord—the Lord of Glory—above what they claim!",
    "And peace be upon the Messengers.",
    "And praise be to God, Lord of the Universes."
  ]
}