{
  "id": 39,
  "name": "الزمر",
  "transliteration": "az-Zumar",
  "translation": "The Troops",
  "verses": [
    "The revelation of the Book is from God, the Mighty and Wise.",
    "We sent down to you the Book with the truth: so worship God, devoting your religion to Him.",
    "Is not to God that sincere faith is due? As for those who take other lords beside Him, “We serve them only so that they may bring us closer to God.” God will judge between them regarding what they differ about. God does not guide the lying blasphemer.",
    "If God wanted to have a child, He would have selected anyone He willed from what He created. Glory be to Him. He is God, the One, the Irresistible.",
    "He created the heavens and the earth with truth. He wraps the night around the day, and He wraps the day around the night. And He regulated the sun and the moon, each running along a specific course. He is the Almighty, the Forgiver.",
    "He created you from a single soul. Then from it, He made its mate. And He brought down for you livestock—eight kinds in pairs. He creates you in your mothers’ wombs, in successive formations, in triple darknesses. That is God, your Lord. Sovereignty belongs to Him. There is no god but He. So what made you deviate?",
    "If you disbelieve, God does not need you, yet He does not approve disbelief by His servants. And if you are thankful, He will approve that in you. No bearer of burdens can bear the burdens of another. Then to your Lord is your return, and He will inform you of what you used to do. He knows what is inside the hearts.",
    "When some adversity touches the human being, he prays to his Lord, turning to Him. But then, when He gives him a favor from Himself, he forgets what he was praying for previously, and he attributes equals to God, to lead away from His way. Say, “Enjoy your disbelief for a little while; you are among the inmates of the Fire.”",
    "What of him who is devoutly obedient during the watches of the night, prostrating and standing, mindful of the Hereafter, and hoping for his Lord’s Mercy? Say, “Are those who know and those who do not know equal?” Only the people of understanding take notice.",
    "Say, “O My devotees who have believed, keep your duty to your Lord. For those who do good in this world, there is goodness; and God’s earth is vast.” Those who are patient will be given their reward without reckoning.”",
    "Say, “I was commanded to worship God, dedicating my faith entirely to Him.",
    "And I was commanded to be of the first of those who submit.”",
    "Say, “I fear, should I disobey my Lord, the punishment of a tremendous day.”",
    "Say, “It is God I worship, being sincere in my devotion to Him.”",
    "“So worship whatever you want besides Him.” Say, “The losers are those who will lose themselves and their families on the Day of Resurrection.” That is the obvious loss.",
    "They will have layers of Fire above them, and layers beneath them. This is how God strikes fear into His servants. “O My servants, reverence Me.”",
    "As for those who shun the worship of false gods, and turn to God—theirs is the good news. So give good news to My worshipers.",
    "Those who listen to the Word, and follow the best of it. It is they whom God has guided, and it is they who are the possessors of intellect.",
    "What about someone who has deserved the sentence of punishment? Is it you who can save those in the Fire?",
    "But those mindful of their Lord will have mansions upon mansions, built high, with streams flowing beneath them. The promise of God—God never breaks a promise.",
    "Have you not considered that God sends down water from the sky, conducts it as springs in the earth, then He produces with it vegetation of various colors, which later withers, and you see it yellowing, then He turns it into debris? Surely in this is a reminder for possessors of understanding.",
    "What about someone whose chest God has expanded for Submission, so he is enlightened by his Lord? So woe to those whose hearts are hardened against the remembrance of God. These are in obvious error.",
    "God sent down the best of messages: A Book consistent and paired. The skins of those who fear their Lord shiver from it. Then their skins and their hearts soften up to God’s remembrance. That is God’s guidance; He guides with it whom He wills. But whomever God leads astray, for him there is no guide.",
    "What about someone who shields his face against the terrible misery of the Day of Resurrection? To the evildoers, it will be said, “Taste what you used to earn.”",
    "Those before them denied the truth, so the torment came upon them from where they did not perceive.",
    "So God made them taste humiliation in the worldly life, but far worse is the punishment of the Hereafter, if they only knew.",
    "We have cited in this Quran for people every kind of example, so they may be mindful.",
    "A Quran in Arabic, with no distortion, so they may be righteous.",
    "God cites the example of a man shared by partners at odds, and a man belonging exclusively to one man. Are they equal in condition? Praise be to God, but most of them do not know.",
    "You will die, and they will die.",
    "Then, on the Day of Resurrection, you will quarrel before your Lord.",
    "Who is more unjust than he who lies against God, and denies the truth when it has come to him? Is there not in Gehenna room for the ungrateful?",
    "But whoever promotes the truth and testifies to it—it is they who are the reverent.",
    "They will have whatever they desire with their Lord. That is the reward of the good-doers.",
    "So that God may acquit them of the worst of their deeds, and reward them according to the best of what they used to do.",
    "Is God not enough for His servant? And they frighten you with those besides Him. Whomever God sends astray, for him there is no guide.",
    "And whomever God guides, for him there is no misleader. Is God not Powerful, Possessor of Vengeance?",
    "And if you asked them, “Who created the heavens and the earth?” they would say, “God.” Say, “Have you considered those you call upon, apart from God? If God desires some harm for me, could they remove His harm, or if He desires some mercy for me, could they withhold His Mercy?” Say, “God is enough for me. On Him, the reliant rely.”",
    "Say: “O my people! Work according to your ability, and so will I. You will soon know.",
    "Upon whom comes a punishment that disgraces him, and upon whom falls lasting suffering.”",
    "We sent down to you the Book for humanity in truth. Whoever is guided—it is for the sake of his own soul. And whoever strays, he strays only to its detriment. And you are not a keeper over them.",
    "God takes the souls at the moment of their death, and those that have not died, during their sleep. Then He keeps those for whom He has ordained death, and He releases the others until a predetermined time. Surely in this are signs for people who reflect.",
    "Or have they taken intercessors apart from God? Say, Even though they have no power over anything, and are devoid of reason?”",
    "Say, “All intercession belongs to God. To Him belongs the kingdom of the heavens and the earth. Then to Him, you will be returned.”",
    "And when God alone is mentioned: the hearts of those who do not believe in the Hereafter shrink with disgust. But when those apart from Him are mentioned: they suddenly rejoice.",
    "Say, “Our God, Originator of the heavens and the earth, Knower of secrets and declarations. You will judge between Your servants regarding what they differed about.”",
    "If those who work evil possessed all that is on earth, and the like of it besides, they would offer it to redeem themselves from the awful suffering of the Day of Resurrection. And there will appear to them from God what they never expected.",
    "And the evils of their deeds will unfold before them, and they will be besieged by what they used to ridicule.",
    "When adversity touches the human being, he calls on Us. But then, when We favor him with a blessing from Us, he says, “I have attained this because of my knowledge.” However, it is a test, but most of them do not know.",
    "Those before them said the same, but their gains were of no benefit to them.",
    "The evils of their deeds caught up with them. And the wrongdoers among these will be overtaken by the evils of their deeds, and they cannot prevent it.",
    "Do they not know that God extends the provision to whomever He wills—and restricts it? Surely in this are signs for people who believe.",
    "Say, “O My servants who have transgressed against their souls: do not despair of God’s mercy, for God forgives all sins. He is the Forgiving, the Merciful.”",
    "And turn to your Lord in repentance, and submit to Him, before the punishment comes upon you, and you will not be helped.",
    "And follow the best of what was revealed to you from your Lord, before the punishment comes upon you suddenly, while you are unaware.",
    "So that a soul may not say, “How sorry I am, for having neglected my duty to God, and for having been of the scoffers.”",
    "Or say, “Had God guided me, I would have been of the reverent.”",
    "Or say, upon seeing the punishment, “If only I had a second chance, I would be of the virtuous.”",
    "Yes indeed. My Verses came to you, but you called them lies, turned arrogant, and were of the faithless.",
    "On the Day of Resurrection, you will see those who told lies about God with their faces blackened. Is Hell not the proper place for the arrogant?",
    "And God will save those who maintained righteousness to their place of salvation. No harm will touch them, nor will they grieve.",
    "God is the Creator of all things, and He is the Maintainer of all things.",
    "To Him belong the keys of the heavens and the earth. But those who reject God’s Verses—it is they who are the losers.",
    "Say, “Is it other than God you urge me to worship, you ignorant ones?”",
    "It was revealed to you, and to those before you, that if you ascribe partners, your deeds will be in vain, and you will be among the losers.",
    "Rather, worship God, and be of the appreciative.",
    "They have not esteemed God as He ought to be esteemed. The entire earth will be in His Grip on the Day of Resurrection, and the heavens will be folded in His Right. Immaculate is He, and Transcendent is He beyond the associations they make.",
    "And the Trumpet will be blown, and everyone in the heavens and the earth will be stunned, except those whom God wills. Then it will be blown another time, and they will rise, looking on.",
    "And the earth will shine with the Light of its Lord, and the Record will be set in place, and the prophets and the witnesses will be brought in, and Judgment will be made between them equitably, and they will not be wronged.",
    "And every soul will be fully compensated for what it had done. He is well aware of what they do.",
    "Those who disbelieved will be driven to Hell in crowds. Until, when they have reached it, and its gates are opened, its keepers will say to them, “Did messengers not come to you from among you, reciting to you the Verses of your Lord, and warning you of the meeting of this Day of yours?” They will say, “Yes, but the verdict of punishment is justified against the unbelievers.”",
    "It will be said, “Enter the gates of Hell, to stay there forever.” What an evil home for the arrogant.",
    "And those who were mindful of their Lord will be led to Paradise in crowds. Until, when they have reached it, and its gates are opened, its keepers will say to them, “Peace be upon you, you have done well, so enter it, to reside in it eternally.”",
    "And they will say, “Praise be to God, who has fulfilled His promise to us, and made us inherit the land, enjoying Paradise as we please.” How excellent is the reward of the workers!",
    "And you will see the angels hovering around the Throne, glorifying their Lord with praise. And judgment will be made between them in truth, and it will be said, “Praise be to God, Lord of the Worlds.”"
  ]
}