{
  "id": 4,
  "name": "النساء",
  "transliteration": "an-Nisa'",
  "translation": "The Women",
  "verses": [
    "O, people! Be conscious of your Lord, who created you from a single soul, and created its mate from it, and propagated from them countless men and women. And revere God whom you ask about, and family relations. God is Watchful over you.",
    "And give orphans their properties, and do not substitute the bad for the good, nor consume their properties by combining them with yours, for that would be a grave sin.",
    "If you fear you cannot act fairly towards the orphans—then marry the women you like—two, or three, or four. But if you fear you will not be fair, then one, or what you already have. That makes it more likely that you avoid bias.",
    "And give women their dowries graciously. But if they willingly forego some of it, then consume it with enjoyment and pleasure.",
    "And do not give the immature your money which God has assigned to you for support. But provide for them from it, and clothe them, and speak to them with kind words.",
    "And test the orphans until they reach the age of marriage. If you find them to be mature enough, hand over their wealth to them. And do not consume it wastefully or recklessly before they grow up. The rich should not receive compensation, but the poor may charge fairly. When you hand over their wealth to them, have it witnessed for them. God suffices as a Reckoner.",
    "Men receive a share of what the parents and relatives leave behind, and women receive a share of what the parents and relatives leave behind—be it little or much—a legal share.",
    "If the distribution is attended by the relatives, the orphans, and the needy: offer them something from it, and speak to them kindly.",
    "Those who are concerned about the fate of their weak children, in case they leave them behind, should fear God, and say appropriate words.",
    "Those who consume the orphans’ wealth illicitly consume fire into their bellies, and they will roast in a Blaze.",
    "God instructs you regarding your children: the male receives the equivalent share of two females. If they are daughters, more than two, they get two-thirds of what he leaves. If there is only one, she gets one-half. As for the parents, each gets one-sixth of what he leaves, if he had children. If he had no children, and his parents inherit from him, his mother gets one-third. If he has siblings, his mother gets one-sixth. After fulfilling any will or debt. Your parents and your children: you don’t know which of them are nearer to you in benefit. This is God's Law. God is Knowing and Judicious.",
    "And you get one-half of what your wives leave: if they had no children. If they had children, you get one-fourth of what they leave. After fulfilling any will or debt. They get one-fourth of what you leave: if you have no children. If you have children, they get one-eighth of what you leave. After fulfilling any will or debt. If a man or woman leaves neither parents nor children, but has a brother or sister, each of them gets one-sixth. If there are more siblings, they share one-third. After fulfilling any will or debt, without prejudice. This is a will from God. God is Knowing and Clement.",
    "These are the limits set by God. Whoever obeys God and His Messenger, He will admit him into Gardens beneath which rivers flow, to stay there forever. That is the ultimate attainment.",
    "But whoever disobeys God and His Messenger, and oversteps His limits, He will cast him into a Fire, to stay there forever, and he will suffer a humiliating punishment.",
    "Those of your women who commit lewdness—you must have four witnesses against them, from among yourselves. If they testify, confine them to the homes until death claims them, or God makes a way for them.",
    "And if two men among you commit it, punish them both. But if they repent and reform, then leave them alone. God is Redeemer, Mercy-Giver.",
    "God accepts the repentance of those who commit evil in ignorance, then repent soon after. These—God will relent towards them. God is Knowing and Wise.",
    "But repentance is not accepted from those who commit evils, until when death approaches one of them, he says, “Now I repent,” nor from those who die as unbelievers. These—We have prepared for them a painful punishment.",
    "O you who believe! It is not lawful for you to inherit women against their will. And do not coerce them to take away some of what you had given them—unless they commit a proven adultery. And live with them in kindness. If you happen to dislike them, it may be that you dislike something in which God has placed much good.",
    "And if you desire to take one wife in place of another, even if you have given one of them a fortune, take nothing back from it. Would you take it back fraudulently and sinfully?",
    "And how could you take it back, when you have been intimate with one another, and they have received from you a firm commitment?",
    "And do not marry women that your fathers married, except what previously took place. It is improper, indecent, and a bad practice.",
    "Forbidden for you are your mothers, your daughters, your sisters, your paternal aunts, your maternal aunts, your brother's daughters, your sister's daughters, your foster-mothers who nursed you, your sisters through nursing, your wives' mothers, and your stepdaughters in your guardianship—born of wives you have gone into—but if you have not gone into them, there is no blame on you. And the wives of your genetic sons, and marrying two sisters simultaneously—except what previously took place. God is Oft-Forgiving, Most Merciful.",
    "And all married women, except those you rightfully possess. This is God’s decree, binding upon you. Permitted for you are those that lie outside these limits, provided you seek them in legal marriage, with gifts from your property, seeking marriage, not prostitution. If you wish to enjoy them, then give them their dowry—a legal obligation. You commit no error by agreeing to any change to the dowry. God is All-Knowing, All-Wise.",
    "If any of you lacks the means to marry free believing women, he may marry one of the believing maids under your control. God knows all about your faith. You are from one another. Marry them with the consent of their guardians, and give them their rightful compensations—to be protected—neither committing adultery nor taking secret lovers. When they are married, if they commit adultery, their punishment shall be half that of free women. That is for those among you who fear falling into decadence. But to practice self-control is better for you. God is Most Forgiving, Most Merciful.",
    "God intends to make things clear to you, and to guide you in the ways of those before you, and to redeem you. God is Most Knowing, Most Wise.",
    "God intends to relent towards you, but those who follow their lusts desire you to turn away utterly.",
    "God intends to lighten your burden—the human being was created weak.",
    "O you who believe! Do not consume each other’s wealth illicitly, but trade by mutual consent. And do not kill yourselves, for God is Merciful towards you.",
    "Whoever does that, out of hostility and wrongdoing, We will cast him into a Fire. And that is easy for God.",
    "If you avoid the worst of what you are forbidden, We will remit your sins, and admit you through a Gate of Honor.",
    "And do not desire what God has favored some of you above others. For men is a share of what they have earned, and for women is a share of what they have earned. And ask God of His favor. God has knowledge of all things.",
    "To each, We have appointed beneficiaries for what parents and relatives leave behind. Those to whom you have given your oath, give them their share. God is Witness over all things.",
    "Men are the caretakers of women, as God has given some of them an advantage over others, and because they spend from their wealth. The good women are loyal; guarding what God would have them guard. As for those from whom you fear treason: advise them, then abandon them in their beds, then discipline them. But if they obey you, seek no way against them. God is Sublime, Great.",
    "If you fear a breach between the two, appoint an arbitrator from his family and an arbitrator from her family. If they desire reconciliation, God will restore harmony between them. God is Knowledgeable, Expert.",
    "And worship God, and ascribe no partners to Him, and be good to the parents, and the relatives, and the orphans, and the poor, and the close neighbor, and the distant neighbor, and close friends, and the traveler, and your servants. God does not love the arrogant showoff.",
    "Those who are stingy, and exhort people to stinginess, and conceal what God has given them from His grace. We have prepared for the unbelievers a humiliating punishment.",
    "And those who spend their money to be seen by people, and believe neither in God nor in the Last Day. Whoever has Satan as a companion—what a bad companion.",
    "What would they have lost, had they believed in God and the Last Day, and donated from what God has given them? God knows them well.",
    "God never commits an atom's weight of injustice. And if there is a good deed, He multiplies it. And He gives, from His Presence, a grand compensation.",
    "Then how will it be, when We bring a witness from every community, and We bring you as a witness against these?",
    "On that Day, those who disbelieved and disobeyed the Messenger will wish that the earth was leveled with them. They will not be able to hide a single fact from God.",
    "O you who believe! Do not approach the prayer while intoxicated, until you know what you say; nor after sexual orgasm—unless you are traveling—until you have bathed. If you are sick or traveling, or one of you has relieved himself, or you had intercourse with women, and cannot find any water, then purify yourselves with clean sand—wiping your faces and hands. God is Pardoning, Forgiving.",
    "Have you not considered those who were given a portion of the Scripture? They buy misguidance, and they wish you would lose the way.",
    "But God best knows your enemies. God is a sufficient Protector, and God is a sufficient Supporter.",
    "Among the Jews are some who take words out of context, and say, “We hear and we disobey,” and, “Hear without listening,” and, “Observe us.” Twisting with their tongues, and slandering the religion. Had they said, “We hear and we obey”, and “Listen”, and “Give us your attention,” it would have been better for them, and more appropriate. But God has cursed them for their disbelief. They do not believe, except a few.",
    "O you who were given the Scripture! Believe in what We revealed, confirming what you have, before We obliterate faces and turn them inside out, or curse them as We cursed the Sabbath-breakers. The command of God is always done.",
    "God does not forgive associating with Him, but He forgives anything less than that to whomever He wills. Whoever associates others with God has devised a monstrous sin.",
    "Have you considered those who claim purity for themselves? Rather, God purifies whom He wills, and they will not be wronged a bit.",
    "See how they fabricate lies about God. This in itself is a blatant sin.",
    "Have you considered those who were given a portion of the Scripture? They believe in superstition and evil powers, and they say of those who disbelieve: “These are better guided on the way than the believers.”",
    "Those are they whom God has cursed. Whomever God curses, you will find no helper for him.",
    "Or do they have a share in sovereignty? If that was the case, they would not give people a speck.",
    "Or do they envy people for what God has given them from His grace? We have given the House of Abraham the Book and Wisdom, and We have given them a great kingdom.",
    "Among them are those who believed in it, and among them are those who held back from it. Hell is a sufficient Inferno.",
    "Those who reject Our communications—We will scorch them in a Fire. Every time their skins are cooked, We will replace them with other skins, so that they taste the suffering. God is Most Powerful, Most Wise.",
    "As for those who believe and do righteous deeds, We will admit them into Gardens beneath which rivers flow, remaining there forever. They will have purified spouses, and We will admit them into abundant shade.",
    "God instructs you to return trusts to their owners, and when you judge between people, to judge with justice. Excellent are God’s instructions to you. God is Hearing, Seeing.",
    "O you who believe! Obey God, and obey the Messenger, and those in authority among you. If you dispute about anything, refer it to God and the Messenger, if you believe in God and the Last Day. That is best, and a most excellent resolution.",
    "Have you not observed those who claim that they believe in what was revealed to you, and in what was revealed before you, yet they seek tyrannical sources of legislation, despite being commanded to reject them? Satan wants to mislead them far away.",
    "And when it is said to them, “Come to what God has revealed, and to the Messenger,” you see the hypocrites shunning you completely.",
    "How about when a disaster strikes them because of what their hands have put forward, then they come to you, swearing by God: “We intended nothing but goodwill and reconciliation”?",
    "They are those whom God knows what is in their hearts. So turn away from them, and counsel them, and say to them concerning themselves penetrating words.",
    "We did not send any messenger except to be obeyed by God’s leave. Had they, when they wronged themselves, come to you, and prayed for God's forgiveness, and the Messenger had prayed for their forgiveness, they would have found God Relenting and Merciful.",
    "But no, by your Lord, they will not believe, until they call you to arbitrate in their disputes, and then find within themselves no resentment regarding your decisions, and submit themselves completely.",
    "Had We decreed for them, “Lay down your lives,” or, “Leave your homes,” they would not have done it, except for a few of them. Had they done what they were instructed to do, it would have been better for them, and a firmer confirmation.",
    "And We would have given them, from Our presence, a rich compensation.",
    "And We would have guided them on a straight path.",
    "Whoever obeys God and the Messenger—these are with those whom God has favored—among the prophets, and the sincere, and the martyrs, and the upright. Excellent are these as companions.",
    "This is the grace from God. God suffices as Knower.",
    "O you who believe! Take your precautions, and mobilize in groups, or mobilize all together.",
    "Among you is he who lags behind. Then, when a calamity befalls you, he says, “God has favored me, that I was not martyred with them.”",
    "But when some bounty from God comes to you, he says—as if no affection existed between you and him—“If only I had been with them, I would have achieved a glorious victory.”",
    "Let those who sell this life for the Hereafter fight in God’s way. Whoever fights in God’s way, and then is killed, or achieves victory, We will grant him an excellent compensation.",
    "And why would you not fight in the way of God, and helpless men, and women, and children cry out, “Our Lord, save us from this town whose people are oppressive, and appoint for us from Your Presence a Protector, and appoint for us from Your Presence a Victor.”",
    "Those who believe fight in God’s way, while those who disbelieve fight in the way of the rebellious. So fight Satan’s allies. Satan’s tactics are always weak.",
    "Have you not considered those who were told, “Restrain your hands, and perform the prayer, and give charity regularly?” But when fighting was ordained for them, a faction of them feared people as God ought to be feared, or even more. And they said, “Our Lord, why did You ordain fighting for us? If only You would postpone it for us for a short while.” Say, “The enjoyment of this life is brief, but the Hereafter is better for the righteous, and you will not be wronged one bit.”",
    "Wherever you may be, death will catch up with you, even if you were in fortified towers. When something good comes their way, they say, “This is from God.” But when something bad befalls them, they say, “This is from you.” Say, “All is from God.” What is the matter with these people, that they hardly understand a thing?",
    "Whatever good befalls you, is from God. And whatever bad befalls you, is from yourself. We sent you to humanity as a messenger, and God is enough as Witness.",
    "Whoever obeys the Messenger is obeying God. And whoever turns away—We did not send you as their keeper.",
    "They profess obedience. But when they leave your presence, some of them conspire something different from what you said. But God records what they conspire. So avoid them, and put your trust in God. God is enough as Trustee.",
    "Do they not ponder the Quran? Had it been from anyone other than God, they would have found in it many inconsistencies.",
    "And when some news of security or alarm comes their way, they broadcast it. Had they referred it to the Messenger, and to those in authority among them, those who can draw conclusions from it would have understood it. Were it not for God’s blessing and mercy upon you: you would have followed Satan, except for a few.",
    "So fight in the way of God; you are responsible only for yourself. And rouse the believers. Perhaps God will restrain the strength of those who disbelieve. God is Superior in Might, and More Punishing.",
    "Whoever intercedes for a good cause, shares in it. And whoever intercedes for an evil cause, shares in its burdens. God is Controller over all things.",
    "When you are greeted with a greeting, respond with a better greeting, or return it. God keeps count of all things.",
    "God—there is no god except He. He will gather you on the Day of Resurrection—about which there is no doubt. And who is truer in speech than God?",
    "What is the matter with you, divided into two groups regarding the hypocrites, when God Himself overwhelmed them because of what they did? Do you want to guide those whom God has misguided? Whomever God misguides—you will never find a path for him.",
    "They would love to see you disbelieve, just as they disbelieve, so you would become equal. So do not befriend any of them, unless they emigrate in God’s way. If they turn away, seize them and execute them wherever you may find them; and do not take from among them allies or supporters.",
    "Except those who join a people with whom you have a treaty, or those who come to you reluctant to fight you, or fight their own people. Had God willed, He would have empowered them, and they would have fought you. If they withdraw from you, and do not fight you, and offer you peace, then God assigns no excuse for you against them.",
    "You will find others who desire to be secure from you, and secure from their own people. But whenever they are tempted into civil discord, they plunge into it. If they do not withdraw from you, nor offer you peace, nor restrain their hands, then seize them and execute them wherever you find them. Against these, We have given you explicit authorization.",
    "Never should a believer kill another believer, unless by mistake. Anyone who kills a believer by mistake must set free a believing slave, and pay compensation to the victim’s family—unless they remit it as a charity. If the victim belonged to a people hostile to you, but is a believer, then the compensation is to free a believing slave. If he belonged to a people with whom you have a treaty, then compensation should be handed over to his family, and a believing slave set free. Anyone who lacks the means must fast for two consecutive months, by way of repentance to God. God is Knowing and Wise.",
    "And whoever kills a believer intentionally, his penalty is Hell, where he will remain indefinitely. And God is angry with him, and has cursed him, and has prepared for him horrible suffering.",
    "O you who believe! When you journey in God’s way, investigate, and do not say to him who offers you peace, “You are not a believer,” aspiring for the goods of this world. With God are abundant riches. You yourselves were like this before, and God bestowed favor on you—so investigate. God is aware of what you do.",
    "Not equal are the inactive among the believers—except the disabled—and the strivers in God’s way with their wealth and their lives. God favors the strivers with their wealth and their lives above the inactive, by a degree. But God has promised good to both. Yet God favors the strivers, over the inactive, with an excellent reward.",
    "Ranks from Him, and forgiveness, and mercy. God is Forgiving and Merciful.",
    "While the angels are removing the souls of those who have wronged themselves, they will say, “What was the matter with you?” They will say, “We were oppressed in the land.” They will say, “Was God’s earth not vast enough for you to emigrate in it?” These—their refuge is Hell—a horrible destination.",
    "Except for the weak among men, and women, and children, who have no means to act, and no means to find a way out.",
    "These—God may well pardon them. God is Pardoning, Forgiving.",
    "Whoever migrates in God’s way will find on earth many places of refuge and plentitude. Whoever leaves his home, emigrating to God and His Messenger, and is overtaken by death, his compensation falls on God. God is Forgiving and Merciful.",
    "When you travel in the land, there is no blame on you for shortening the prayer, if you fear that the unbelievers may attack you. The unbelievers are your obvious enemies.",
    "When you are among them, and you stand to lead them in prayer, let a group of them stand with you, and let them hold their weapons. Then, when they have done their prostrations, let them withdraw to the rear, and let another group, that have not prayed yet, come forward and pray with you; and let them take their precautions and their weapons. Those who disbelieve would like you to neglect your weapons and your equipment, so they could attack you in a single assault. You commit no error if you are hampered by rain or are sick, by putting down your weapons, but take precautions. God has prepared for the unbelievers a demeaning punishment.",
    "When you have completed the prayer, remember God—standing, or sitting, or on your sides. Then, when you feel secure, perform the prayer. The prayer is a duty on believers at appointed times.",
    "And do not falter in the pursuit of the enemy. If you are aching, they are aching as you are aching, but you expect from God what they cannot expect. God is Knowledgeable and Wise.",
    "We revealed to you the Book, in truth, so that you judge between people according to what God has shown you. And do not be an advocate for the traitors.",
    "And ask God for forgiveness. God is Forgiving and Merciful.",
    "And do not argue on behalf of those who betray their own selves. God does not love the deceitful sinner.",
    "They hide from people, but they cannot hide from God. He is with them, while they plot by night with words He does not approve. God comprehends what they do.",
    "Here you are, arguing on their behalf in the present life, but who will argue with God on their behalf on the Day of Resurrection? Or who will be their representative?",
    "Whoever commits evil, or wrongs his soul, then implores God for forgiveness, will find God Forgiving and Merciful.",
    "And whoever commits a sin, earns it against himself. God is Knowing and Wise.",
    "And whoever commits a mistake, or a sin, and then blames it on an innocent person, has taken a slander and a blatant sin.",
    "Were it not for God’s grace towards you, and His mercy, a group of them would have misled you. But they mislead only themselves, and they cannot harm you in any way. God revealed to you the Scripture and Wisdom, and He taught you what you never knew. God’s favor upon you is great.",
    "There is no good in much of their secret talks, except for whoever advocates charity, or kindness, or reconciliation between people. Whoever does this, seeking God’s approval, We will grant him an excellent compensation.",
    "Whoever makes a breach with the Messenger, after guidance has become clear to him, and follows other than the believers’ path, We will direct him in the direction he has chosen, and commit him to Hell—a terrible destination.",
    "God does not forgive associating others with Him, but He forgives anything less than that, to whomever He wills. Whoever ascribes partners to God has gone far astray.",
    "They invoke in His stead only females. They invoke none but a defiant devil.",
    "God has cursed him. And he said, “I will take to myself my due share of Your servants.”",
    "“And I will mislead them, and I will entice them, and I will prompt them to slit the ears of livestock, and I will prompt them to alter God’s creation.” Whoever takes Satan as a master, instead of God, has suffered an obvious loss.",
    "He promises them, and he raises their expectations, but Satan promises them nothing but delusions.",
    "These—their housing is Hell, and they will find no escape from it.",
    "But as for those who believe and do righteous deeds, We will admit them into Gardens beneath which rivers flow, where they will dwell forever. The promise of God is true—and who is more truthful in speech than God?",
    "It is not in accordance with your desires, nor in accordance with the desires of the People of the Scripture. Whoever works evil will pay for it, and he will find no protector or helper for himself apart from God.",
    "But whoever works righteousness, whether male or female, and is a believer—these will enter Paradise, and will not be wronged a bit.",
    "And who is better in religion than he who submits himself wholly to God, and is a doer of good, and follows the faith of Abraham the Monotheist? God has chosen Abraham for a friend.",
    "To God belongs whatever is in the heavens and whatever is on earth, and God surrounds all things.",
    "They ask you for a ruling about women. Say, “God gives you a ruling about them, and so does what is stated to you in the Book about widowed women from whom you withhold what is decreed for them, yet you desire to marry them, and about helpless children: that you should treat the orphans with fairness.” Whatever good you do, surely God knows it.",
    "If a woman fears maltreatment or neglect from her husband, there is no blame on them if they reconcile their differences, for reconciliation is best. Souls are prone to greed. But if you are virtuous and reverent—God is Cognizant of what you do.",
    "You will never be able to treat women with equal fairness, no matter how much you desire it. Do not be so biased as to leave another suspended. If you make amends and act righteously—God is Forgiving and Merciful.",
    "And if they separate, God will enrich both from His abundance. God is Bounteous and Wise.",
    "To God belongs whatever is in the heavens, and whatever is on earth. We have instructed those who were given the Scripture before you, and you, to be conscious of God. But if you refuse—to God belongs whatever is in the heavens, and whatever is on earth. God is Beyond need, Praiseworthy.",
    "To God belongs whatever is in the heavens, and whatever is on earth. God suffices as Manager.",
    "If He so wills, He can do away with you, O people, and bring others, and God is capable of that.",
    "Whoever desires the reward of this world—with God is the reward of this world and the next. God is Hearing, Seeing.",
    "O you who believe! Stand firmly for justice, witnesses for God, even if against yourselves, or your parents, or your relatives. Whether one is rich or poor, God takes care of both. So do not follow your desires, lest you swerve. If you deviate or turn away—God is Aware of what you do.",
    "O you who believe! Believe in God and His Messenger, and the Book He revealed to His Messenger, and the Book He revealed before. Whoever rejects God, His angels, His Books, His messengers, and the Last Day, has clearly gone far astray.",
    "Those who believe, and then disbelieve, and then believe, and then disbelieve, and then increase in disbelief: God will not forgive them, nor will He guide them to a way.",
    "Inform the hypocrites that they will have a painful punishment.",
    "Those who take disbelievers as allies instead of believers. Do they seek glory in them? All glory belongs to God.",
    "And He has revealed to you in the Book, that when you hear God’s revelations being rejected or ridiculed, do not sit with them until they engage in some other subject. Otherwise, you would be like them. God will gather the hypocrites and the unbelievers, into Gehenna, altogether.",
    "Those who lie in wait for you: if you attain victory from God, they say, “Were we not with you?” But if the unbelievers get a turn, they say, “Did we not side with you, and defend you from the believers?” God will judge between you on the Day of Resurrection, and God will give the unbelievers no means of overcoming the believers.",
    "The hypocrites seek to deceive God, but He is deceiving them. And when they rise for prayer, they rise reluctantly, only to be seen by people, and seldom remembering God.",
    "Wavering in between: neither with these nor with those. Whomever God sends astray—you will never find for him a way.",
    "O you who believe! Do not take the disbelievers as protectors instead of believers. Do you want to give God a clear case against you?",
    "The hypocrites will be in the lowest depths of the Fire, and you will find no helper for them.",
    "Except those who repent, reform, and hold fast to God, and devote their faith entirely to God. These are with the believers, and God will grant the believers a magnificent reward.",
    "What would God accomplish by your punishment, if you are thankful and faithful? God is Appreciative, Cognizant.",
    "God does not like the public uttering of bad language—unless someone was wronged. God is Hearing and Knowing.",
    "If you let a good deed be shown, or conceal it, or pardon an offense—God is Pardoning and Capable.",
    "Those who deny God and His messengers, and wish to differentiate between God and His messengers, and say, “We believe in some, and we reject some,” and wish to pursue a path in between.",
    "These are the unbelievers, truly. We have prepared for the unbelievers a humiliating punishment.",
    "As for those who believe in God and His messengers, and make no distinction between any of them—He will give them their rewards. God is Forgiving and Merciful.",
    "The People of the Scripture challenge you to bring down to them a book from the sky. They had asked Moses for something even greater. They said, “Show us, God, plainly.” So the thunderbolt struck them for their wickedness. Then they took up the calf, even after the clear proofs came to them. Yet We pardoned that, and We gave Moses compelling proof.",
    "And We raised the Mount above them in accordance with their covenant, and We said to them, “Enter the gate with humility,” and We said to them, “Do not violate the Sabbath”, and We received from them a solemn pledge.",
    "But for their violation of their covenant, and their denial of God’s revelations, and their killing of the prophets unjustly, and for their saying, “Our minds are closed.” In fact, God has sealed them for their disbelief—so they do not believe, except for a few.",
    "And for their faithlessness, and their saying against Mary a monstrous slander.",
    "And for their saying, “We have killed the Messiah, Jesus, son of Mary, the Messenger of God.” In fact, they did not kill him, nor did they crucify him, but it appeared to them as if they did. Those who differ about him are in doubt about it. They have no knowledge of it, except the following of assumptions. They certainly did not kill him.",
    "But God raised him up to Himself. God is Mighty and Wise.",
    "There is none among the People of the Scripture but will believe in him before his death. And on the Day of Resurrection, he will be a witness against them.",
    "Because of wrongdoing by the Jews, We denied them good things that were permitted for them; and for their deterring many from God’s path.",
    "And for their taking usury, although they were forbidden it; and for their consuming people's wealth dishonestly. We have prepared for the faithless among them a painful punishment.",
    "But those among them firmly rooted in knowledge, and the believers, believe in what was revealed to you, and in what was revealed before you; and the observers of prayers, and the givers of charity, and the believers in God and the Last Day—upon these We will bestow an immense reward.",
    "We inspired you, as We inspired Noah and the prophets after him. And We inspired Abraham, and Ishmael, and Isaac, and Jacob, and the Patriarchs, and Jesus, and Job, and Jonah, and Aaron, and Solomon. And to David, We gave the Psalms.",
    "Some messengers We have already told you about, while some messengers We never told you about. And God spoke to Moses in a conversation.",
    "Messengers delivering good news, and bringing warnings, so that people may have no excuse before God after the coming of the messengers. God is Powerful and Wise.",
    "But God Himself testifies to what He revealed to you. He revealed it with His knowledge. And the angels testify. And God suffices as Witness.",
    "Those who disbelieve, and repel from God’s path, have gone far astray.",
    "Those who disbelieve and transgress—God is not about to forgive them, nor will He guide them to any path.",
    "Except to the path to Hell, where they will dwell forever. And that is easy for God.",
    "O, people! The Messenger has come to you with the truth from your Lord, so believe: it is better for you. But if you disbelieve, to God belongs whatsoever is in the heavens and the earth. And God is Knowledgeable and Wise.",
    "O People of the Scripture! Do not exaggerate in your religion, and do not say about God except the truth. Jesus Christ, son of Mary, is the Messenger of God, and His Word which He conveyed to Mary, and a Spirit from Him. So believe in God and His messengers, and do not say, “Trinity.” Refrain, for your own good. God is only One God. Glory be to Him—that He should have a child. To Him belongs everything in the heavens and on earth, and God is a sufficient Protector.",
    "The Messiah did not refuse to be a servant of God, nor did the near angels. Whoever refuses His worship, and is too arrogant—He will gather them to Himself, all together.",
    "But as for those who believe and perform righteous deeds, He will pay them their rewards in full, and He will increase them out of His bounty. But as for those who refuse and are too proud, He will punish them with agonizing punishment, and they will find no protector or helper for themselves apart from God.",
    "O, people! Conclusive evidence has come to you from your Lord, and We sent down to you a brilliant light.",
    "As for those who believe in God, and hold fast to Him, He will admit them into mercy and bounty from Him, and He will guide them to Himself along a straight path.",
    "They ask you for a ruling. Say, “God gives you a ruling regarding the person who has neither parents nor children. If a man dies and leaves no children, and he had a sister, she receives one-half of his estate. And he inherits from her if she leaves no children. But if there are two sisters, they receive two-thirds of the estate. If the siblings are men and women, the male receives the share of two females.” God makes things clear for you, lest you err. God has knowledge of all things."
  ]
}