{
  "id": 40,
  "name": "غافر",
  "transliteration": "Ghafir",
  "translation": "The Forgiver",
  "verses": [
    "Ha. Meem.",
    "The sending down of the Scripture is from God the Almighty, the All-Knowing.",
    "Forgiver of sins, Acceptor of repentance, Severe in punishment, Infinite in bounty. There is no god except He. To Him is the final return.",
    "None argues against God’s revelations except those who disbelieve. So be not impressed by their activities in the land.",
    "Before them, the people of Noah rejected the truth, as did the Confederates after them. Every community plotted against its messenger, to capture him. And they argued with falsehood, to discredit with it the truth. But I seized them. What a punishment it was!",
    "And so your Lord’s decree was justified against those who disbelieve—that they are the inmates of the Fire.",
    "Those who carry the Throne, and those around it, glorify their Lord with praise, and believe in Him, and ask forgiveness for those who believe: “Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who repent and follow Your path, and protect them from the agony of the Blaze.",
    "And admit them, Our Lord, into the Gardens of Eternity, which You have promised them, together with the righteous among their parents, and their spouses, and their descendants. You are the Mighty, the Wise.",
    "And shield them from evil deeds. Whomever You shield from evil deeds on that Day, upon him You had mercy. That is the supreme achievement.”",
    "Those who disbelieved will be addressed, “God’s loathing is greater than your loathing of yourselves—for you were invited to faith, but you refused.”",
    "They will say, “Our Lord, twice You made us die, and twice you gave us life. Now we confess our sins. Is there a way out?”",
    "That is because when God alone was called upon, you disbelieved; but when others were associated with Him, you believed. Judgment rests with God the Sublime, the Majestic.",
    "It is He who shows you His wonders and sends down sustenance from the sky for you. But none will be mindful except the repentant.",
    "So call upon God, with sincere devotion to Him, even though the disbelievers hate it.",
    "Exalted in rank, Possessor of the Throne. He conveys the Spirit, by His command, upon whom He wills of His servants, to warn of the Day of Encounter.",
    "The Day when they will emerge, nothing about them is hidden from God. “To whom does sovereignty belong today?” “To God, the One, the Irresistible.”",
    "On that Day: every soul will be rewarded for what it had done. There will be no injustice on that Day. God is quick to settle accounts.",
    "And warn them of the Day of Imminence, when the hearts are at the throats, choking them. The wrongdoers will have no dependable friend, and no mediator to be obeyed.",
    "He knows the eyes’ deception, and what the hearts conceal.",
    "God judges with justice, while those whom they invoke besides Him cannot judge with anything. It is God who is the Hearer, the Seer.",
    "Have they not journeyed through the earth, and seen the fate of those before them? They were superior to them in might, and they left more impact on earth. But God seized them for their sins, and they had no defender against God.",
    "That is because their messengers used to come to them with clear proofs, but they persisted in disbelief, so God seized them. He is All-Powerful, Severe in retribution.",
    "We sent Moses with Our signs—and a clear authorization.",
    "To Pharaoh, Hamaan, and Korah. But they said, “A lying magician.”",
    "Then, when he came to them with the truth from Us, they said, “Kill the sons of those who believe with him, and spare their women.” But the schemes of the unbelievers can only fail.",
    "Pharaoh said, “Leave me to kill Moses, and let him appeal to his Lord. I fear he may change your religion, or spread disorder in the land.”",
    "Moses said, “I have sought refuge in my Lord and your Lord, from every arrogant who does not believe in the Day of Account.”",
    "A believing man from Pharaoh's family, who was hiding his faith, said, “Will you kill a man for saying, `My Lord is God,’ although he has come to you with clear proofs from your Lord? If he is a liar, his lie will be upon him. But if he is truthful, then some of what he promises you will befall you. God does not guide the extravagant liar.",
    "O, my people! Authority is yours today, prominent on the land. But who will help us against God’s might, should it come upon us?” Pharaoh said, “I do not show you except what I see, and I do not guide you except to the path of prudence.”",
    "And he who believed said, “O my people, I fear for you the like of the day of the Confederates.",
    "Like the plight of the people of Noah, and Aad, and Thamood, and those after them. God intends no injustice for the servants.",
    "O, my people! I fear for you the Day of Calling.",
    "The Day you will turn away to flee, having none to protect you from God. Whomever God leaves to stray, has no guide.”",
    "Joseph already came to you with clear revelations, but you never ceased to doubt what he came to you with. Until, when he perished, you said, “God will never send a messenger after him.” Thus God leaves the outrageous skeptic to stray.",
    "Those who argue against God’s revelations, with no proof having come to them—grievous and despised it is by God and those who believe. Thus God seals the heart of every arrogant bully.",
    "And Pharaoh said, “O Hamaan, build me a tower, that I may reach the pathways.",
    "The pathways of the heavens, so that I may look at the God of Moses, although I think he is a liar.” Thus Pharaoh’s evil deeds were made to appear good to him, and he was averted from the path. Pharaoh's guile was only in defeat.",
    "And the one who believed said, “O my people, follow me, and I will guide you to the path of rectitude.”",
    "“O my people, this worldly life is only enjoyment, but the Hereafter is the Home of Permanence.",
    "Whoever commits a bad deed will be repaid only with its equivalent. And whoever works righteousness—whether male or female, and is a believer—these will enter Paradise, where they will be provided for without account.",
    "O my people, how is it that I invite you to salvation, while you invite me to the Fire?",
    "You invite me to reject God, and to associate with Him what I have no knowledge of, while I invite you to the Almighty, the Forgiver.",
    "Without a doubt, what you invite me to has no say in this world, nor in the Hereafter. And our turning back is to God. And the transgressors are the inmates of the Fire.",
    "You will remember what I am telling you, and I commit my case to God. God is Observant of the servants.”",
    "So God protected him from the evils of their scheming, and a terrible punishment besieged Pharaoh’s clan.",
    "The Fire, to which they are exposed morning and evening. And on the Day the Hour takes place: “Admit Pharaoh’s clan to the most intense suffering.”",
    "As they quarrel in the Fire, the meek will say to those who were arrogant, “We were your followers, will you give us some relief from the Fire?”",
    "Those who were arrogant will say, “We are all in it—God has judged between the servants.”",
    "And those in the Fire will say to the keepers of Hell, “Call upon your Lord to lessen our suffering for one day.”",
    "They will say, “Did your Messengers not come to you with clear evidence?” They will say, “Yes.” They will say, “Then pray, but the prayer of the unbelievers is only in vain.”",
    "Most certainly, We will support Our messengers and those who believe, in this life, and on the Day when the witnesses arise.",
    "The Day when the wrongdoers’ excuses will not benefit them, and they will have the curse, and they will have the worst home.",
    "We gave Moses the guidance, and We made the Children of Israel inherit the Scripture.",
    "A guide and a reminder for those endowed with understanding.",
    "So persevere. The promise of God is true. And ask forgiveness for your sin. And proclaim your Lord’s praises evening and morning.",
    "Those who dispute God’s revelations with no authority having come to them: there is nothing in their hearts except the feeling of greatness, which they will never attain. So seek refuge in God. He is the All-Hearing, the All-Seeing.",
    "The creation of the heavens and the earth is greater than the creation of humanity, but most people do not know.",
    "Not equal are the blind and the seeing, nor are those who believe and work righteousness equal to the sinners. Little do you reflect!",
    "The Hour is certainly coming: there is no doubt about it. But most people do not believe.",
    "And your Lord has proclaimed, “Pray to Me, and I will respond to you. But those who are too proud to worship Me will enter Hell forcibly.”",
    "It is God Who made the night for you, to rest in it; and the day allowing sight. God is gracious towards people, but most people are not thankful.",
    "That is God, your Lord, Creator of all things. There is no god but He. So how can you be deluded?",
    "Thus are deluded those who oppose God’s revelations.",
    "It is God who made the earth a habitat for you, and the sky a structure. And He designed you, and He designed you well, and He provided you with good things. That is God, your Lord. So Blessed is God, Lord of the Worlds.",
    "He is the Living. There is no god except He. So call upon Him, devoting your religion entirely to Him. Praise be to God, Lord of the Worlds.",
    "Say, “I was prohibited from worshiping those you call upon besides God, now that clear proofs have come to me from my Lord. And I was commanded to submit to the Lord of the Universe.”",
    "It is He who created you from dust, then from a drop, then from a clot, then He brings you out as infants, so that you may reach your prime, then you become elderly—although some of you die sooner—so that you may reach a predetermined age, so that you may understand.",
    "It is He who gives life and causes death. And when He decides on an issue, He says to it, “Be,” and it comes to be.",
    "Have you not considered those who dispute God's revelations, how they are turned away?",
    "Those who call the Book a lie, and what We sent Our messengers with—they will surely know.",
    "With shackles around their necks. And dragged by the chains.",
    "Into the boiling water. Then in the Fire, they will be consumed.",
    "Then it will be said to them, “Where are those you used to deify?",
    "Instead of God?” They will say, “They abandoned us. In fact, we were praying to nothing.” Thus God leads the unbelievers to stray.",
    "That is because you used to rejoice on earth in other than the truth, and because you used to behave with vanity.",
    "Enter the gates of Hell, to stay there forever. How evil is the dwelling of the arrogant!",
    "So be patient. The promise of God is true. Whether We show you some of what We have promised them, or take you, to Us they will be returned.",
    "We sent messengers before you: some of them We told you about, and some We did not tell you about. No messenger can bring a sign, except with God’s permission. So when God’s command comes, judgment will be passed in fairness, and there and then the seekers of falsehood will lose.",
    "God is He who created the domestic animals for you: some for you to ride, and some you eat.",
    "And in them, you have other benefits. And through them, you satisfy your needs. And on them, and on the ships, you are transported.",
    "And He shows you His signs. So which of God’s signs will you deny?",
    "Have they not journeyed through the earth, and seen the outcome for those before them? They were more numerous than they, and they had greater power and influence on earth. But what they had achieved availed them nothing.",
    "When their messengers came to them with clear proofs, they rejoiced in the knowledge they had, and so the very things they used to ridicule besieged them.",
    "Then, when they witnessed Our might, they said, “We believe in God alone, and we reject what we used to associate with Him.”",
    "But their faith did not benefit them when they witnessed Our punishment. This has been God’s way of dealing with His servants. There and then the disbelievers lost."
  ]
}