{
  "id": 41,
  "name": "فصلت",
  "transliteration": "Fussilat",
  "translation": "Explained in Detail",
  "verses": [
    "Ha. Meem.",
    "A revelation from the Compassionate, the Merciful.",
    "A Scripture whose Verses are detailed. A Quran in Arabic for people who know.",
    "Delivering good news and bringing warnings. But most of them turn away, so they do not listen.",
    "And they say, “Our hearts are screened from what you call us to, and there is deafness in our ears, and there is a veil between us and you. So do whatever you want, and so will we.”",
    "Say, “I am only a human being like you. It is inspired in me that your God is One God. So be upright towards Him. And seek forgiveness from Him.” And woe to the idolaters.",
    "Those who do not give the alms; and regarding the Hereafter, they are in denial.",
    "As for those who believe and do righteous deeds—for them is an unending reward.",
    "Say, “Do you reject the One who created the earth in two stages? And you attribute equals to Him? That is the Lord of the Universe.”",
    "He placed stabilizers over it, and He blessed it, and He assigned its foods in four stages—equally for the seekers.",
    "Then He turned towards the sky, and it was smoke, and He said to it and to the earth, “Come, willingly or unwillingly.” They said, “We come willingly.”",
    "Then He completed them seven universes, in two Days. And He assigned to each universe its law. And We decorated the lower universe with lamps, and for protection. That is the design of the Almighty, the All-Knowing.",
    "If they turn away, say, “I have warned you of a thunderbolt, like the thunderbolt of Aad and Thamood.”",
    "When their messengers came to them, from the front of them, and from behind them: “Worship none but God.” They said, “Had our Lord willed, He would have sent down angels; so we reject what you are sent with.”",
    "As for Aad, they acted arrogantly on earth, and opposed justice, and said, “Who is more powerful than us?” Have they not considered that God, Who created them, is more powerful than them? And they went on denying Our revelations.",
    "So We unleashed upon them a screaming wind, for a few miserable days, to make them taste the punishment of shame in this life. But the punishment of the Hereafter is more shameful—and they will not be helped.",
    "As for Thamood, We guided them, but they preferred blindness over guidance. So the thunderbolt of the humiliating punishment overtook them, because of what they used to do.",
    "And We saved those who believed and were cautious.",
    "On the Day when God’s enemies are herded to the Fire, forcibly.",
    "Until, when they have reached it, their hearing, and their sight, and their skins will testify against them regarding what they used to do.",
    "And they will say to their skins, “Why did you testify against us?” They will say, “God, Who made everything speak, made us speak. He who created you the first time; and to Him, you will be returned.”",
    "You were unable to hide yourselves from your hearing, and your sight, and your skins, to prevent them from testifying against you. And you imagined that God was unaware of much of what you were doing.",
    "It is that thought of yours about your Lord that led you to ruin—so you became among the losers.",
    "If they endure patiently, the Fire is their residence. And if they make up excuses, they will not be pardoned.",
    "We had assigned companions for them, who glamorized for them what was in front of them, and what was behind them. And the Word proved true against them in communities of jinn and humans that have passed away before them. They were lost.",
    "And those who disbelieve say, “Do not listen to this Quran, and talk over it, so that you may prevail.”",
    "We will make those who disbelieve taste an intense agony, and We will recompense them according to the worst of what they used to do.",
    "Such is the repayment for God’s enemies—the Fire—they have the eternal home in it, in return for having disregarded Our revelations.",
    "Those who disbelieved will say, “Our Lord, show us those who misguided us—among jinn and humans—and we will trample them under our feet, so they become of the lowliest.”",
    "Those who say: “Our Lord is God,” and then go straight, the angels descend upon them: “Do not fear, nor grieve, and rejoice in the Garden which you were promised.",
    "We are your allies in this life and in the Hereafter; where you will have whatever your souls desire, and there you will have whatever you ask for.",
    "Hospitality from a Merciful Forgiver.”",
    "And who is better in speech than someone who invites to God, acts with integrity, and says, “I am of those who submit”?",
    "Good and evil are not equal. Repel by what is better, and the person who was your enemy will become like an intimate friend.",
    "But none will attain it except those who are patient. And none will attain it except the very fortunate.",
    "And when a temptation from Satan provokes you, seek refuge in God; He is the Hearer, the Knower.",
    "Among His signs are the night and the day, and the sun and the moon. Do not bow down to the sun, nor to the moon, but bow down to God, Who created them both, if it is Him that you worship.",
    "But if they are too proud—those in the presence of your Lord praise Him night and day, and without ever tiring.",
    "And among His signs is that you see the land still. But when We send down water on it, it stirs and grows. He Who revived it will revive the dead. He is capable of all things.",
    "Those who distort Our Verses are not hidden from Us. Is he who is hurled into the Fire better? Or he who arrives safely on the Day of Resurrection? Do as you will; He is Seeing of everything you do.",
    "Those who reject the Reminder when it has come to them—it is an invincible Book.",
    "Falsehood cannot approach it—neither from its front, nor from its back. A revelation from a Wise and Praised.",
    "Nothing is said to you but was said to the Messengers before you: your Lord is Possessor of Forgiveness, and Possessor of painful repayment.",
    "Had We made it a Quran in a foreign language, they would have said, “If only its verses were made clear.” In a Foreign language, and an Arab? Say, “For those who believe, it is guidance and healing. But as for those who do not believe: there is a deafness in their ears, and it is blindness for them. These are being called from a faraway place.”",
    "We gave Moses the Book, but disputes arose concerning it. Were it not for a prior decree from your Lord, their differences would have been settled. But they are in serious doubt about it.",
    "Whoever acts righteously, does so for his own soul. And whoever works evil, does so to its detriment. Your Lord is not unjust to the servants.",
    "To Him is referred the knowledge of the Hour. No fruit emerges from its husk, and no female conceives or delivers, except with His knowledge. And on the Day when He calls to them, “Where are My associates?” They will say, “We admit to you, none of us bears witness.”",
    "What they used to call on before will abandon them, and they will realize that they have no refuge.",
    "The human being never tires of praying for good. But when adversity afflicts him, he despairs and loses hope.",
    "And when We let him taste mercy from Us, after the adversity that had afflicted him, he will say, “This is mine, and I do not think the Hour is coming. And even if I am returned to my Lord, I will have the very best with Him.” We will inform those who disbelieve of what they did, and We will make them taste a harsh punishment.",
    "And when We provide comfort for the human being, he withdraws and distances himself; but when adversity befalls him, he starts lengthy prayers.",
    "Say, “Have you considered? If it is from God and you reject it—who is more misguided  than he who is cut-off and alienated?”",
    "We will show them Our signs on the horizons, and within themselves—until it becomes clear to them that it is the truth. Is it not enough that your Lord is a witness over everything?",
    "Surely, they are in doubt about the meeting with their Lord. Surely, He surrounds everything."
  ]
}