{
  "id": 46,
  "name": "الأحقاف",
  "transliteration": "al-Ahqaf",
  "translation": "The Wind-Curved Sandhills",
  "verses": [
    "Ha. Meem.",
    "The revelation of the Scripture is from God—the Honorable, the Wise.",
    "We did not create the heavens and the earth and what lies between them except with reason, and for a finite period. Yet those who disbelieve turn away from the warnings they receive.",
    "Say, “Have you considered those you call upon besides God? Show me which portion of the earth they created. Or do they own a share of the heavens? Bring me a scripture prior to this one, or some shred of knowledge, if you are truthful.”",
    "And who is more misguided than he who calls upon others besides God—who cannot respond to him until Resurrection Day? And they are unaware of their prayers.",
    "And when humanity is gathered, they will be enemies to them, and they will renounce their worship of them.",
    "And when Our revelations are recited to them, plain and clear, those who disbelieve say of the truth when it has come to them, “This is obviously magic.”",
    "Or do they say, “He made it up”? Say, “If I made it up, there is nothing you can do to protect me from God. He knows well what you are engaged in. He is enough as a witness between me and you. He is the Forgiving, the Merciful.”",
    "Say, “I am no different from the other messengers, nor do I know what will be done with me or with you. I only follow what is inspired in me, and I am only a clear warner.”",
    "Say, “Have you considered, if it is from God, and you disbelieve in it, although a witness from the Children of Israel testified to its like, and has believed, while you turned arrogant? Surely God does not guide the unjust people.”",
    "Those who disbelieve say to those who believe, “If it were anything good, they would not have preceded us to it.” And since they were not guided by it, they will say, “This is an old lie.”",
    "And before it, the Book of Moses—a guide and mercy. And this is a confirming Book, in the Arabic language, to warn those who do wrong—and good news for the doers of good.",
    "Those who say, “Our Lord is God,” then lead a righteous life—they have nothing to fear, nor shall they grieve.",
    "These are the inhabitants of the Garden, where they will remain forever—a reward for what they used to do.",
    "We have instructed the human being to kindness to his parents. His mother carried him with difficulty, and she delivered him with difficulty. His bearing and weaning take thirty months. Until, when he has reached his prime at the age of forty, he says, “My Lord, enable me to appreciate the blessings You have bestowed upon me and upon my parents, and to act with righteousness, pleasing You. And improve my children for me. I have sincerely repented to You, and I am of those who submit.”",
    "Those are they from whom We accept the best of their deeds, and We overlook their misdeeds—among the inhabitants of Paradise—the promise of truth which they are promised.",
    "As for him who says to his parents, “Enough of you! Are you warning me that I will be raised up—when generations before me have passed away?” While they cry to God for help, “Woe to you! Believe! The promise of God is true!” But he says, “These are nothing but tales of the ancients.”",
    "Those are they upon whom the verdict is justified, among communities that passed away before them, of jinn and humans. They are truly losers.",
    "There are ranks for everyone, according to what they did, and He will repay them for their works in full, and they will not be wronged.",
    "On the Day when the faithless are paraded before the Fire: “You have squandered your good things in your worldly life, and you took pleasure in them. So today you are being repaid with the torment of shame, because of your arrogance on earth with no right, and because you used to sin.”",
    "And mention Aad’s brother, when he warned his people at the dunes. While other warners have passed before him and after him: “Worship none but God; I fear for you the punishment of a tremendous Day.”",
    "They said, “Did you come to us to divert us from our gods? Then bring us what you threaten us with—if you are truthful.”",
    "He said, “Knowledge is only with God, and I convey to you what I was sent with, but I see that you are ignorant people.”",
    "And when they saw a cloud approaching their valleys, they said, “This is a cloud bringing us rain.” In fact, it is what you were impatient for: a wind in which is grievous suffering.",
    "It will destroy everything by the command of its Lord. And when the morning came upon them, there was nothing to be seen except their dwellings. Thus We repay the criminal people.",
    "We had empowered them in the same way We empowered you. And We gave them hearing, sight, and minds. But neither their hearing, nor their sight, nor their minds availed them in any way. That is because they disregarded God’s revelations. And what they used to ridicule surrounded them.",
    "We have destroyed many societies around you, and We diversified the signs, so that they may return.",
    "Then why did the idols, whom they worshiped as means of nearness to God, not help them? In fact, they failed them. It was their lie—a fabrication of their own making.",
    "And when We dispatched towards you a number of jinns, listening to the Quran. When they came in its presence, they said, “Pay attention!” Then, when it was concluded, they went back to their people, warning them.",
    "They said, “O, our people! We have heard a Scripture, revealed after Moses, confirming what came before it. It guides to the Truth, and to a straight road.",
    "O, our people! Answer the caller to God, and believe in Him, and He will forgive you some of your sins, and He will protect you from a painful punishment.”",
    "Whoever does not answer God’s caller will have no escape on earth, and there is no protector for him other than Him. These are in obvious error.",
    "Do they not realize, that God, who created the heavens and the earth, and was never tired by creating them, is able to revive the dead? Yes, indeed—He is Capable of everything.",
    "On the Day when those who disbelieved are presented to the Fire: “Is this not real?” They will say, “Yes indeed, by our Lord.” He will say, “Then taste the suffering for having disbelieved.”",
    "So be patient, as the messengers with resolve were patient, and do not be hasty regarding them. On the Day when they witness what they are promised: as if they only stayed for an hour of a day. A proclamation! Will any be destroyed, except the sinful people?"
  ]
}