{
  "id": 47,
  "name": "محمـد",
  "transliteration": "Muhammad",
  "translation": "Muhammad",
  "verses": [
    "Those who disbelieve and repel from God’s path—He nullifies their works.",
    "While those who believe, and work righteousness, and believe in what was sent down to Muhammad—which is the truth from their Lord—He remits their sins, and He relieves their concerns.",
    "That is because those who disbelieve follow falsehoods, while those who believe follow the truth from their Lord. Thus God gives the people their examples.",
    "When you encounter those who disbelieve, strike at their necks. Then, when you have subdued them, tighten the bond. Then, either free them graciously, or by ransom. Until the war lays down its burdens. Had God willed, He would have taken vengeance upon them, but so that He tests some of you through others. As for those who are killed in God’s way, He will not let their deeds go to waste.",
    "He will guide them and improve their condition.",
    "And He will admit them to Paradise, which He has identified to them.",
    "O you who believe! If you stand up for God, He will support you, and He will strengthen your foothold.",
    "As for those who disbelieve: for them is perdition, and He will waste their deeds.",
    "That is because they disliked what God revealed, so He nullified their works.",
    "Have they not traveled through the earth, and seen the fate of those before them? God poured destruction on them—and for the unbelievers is something comparable.",
    "That is because God is the Master of those who believe, while the disbelievers have no master.",
    "God will admit those who believe and do good deeds into Gardens under which rivers flow. While those who disbelieve enjoy themselves, and they eat as cattle eat; and the Fire will be a dwelling for them.",
    "How many a town was more powerful than your town which evicted you? We destroyed them, and there was no helper for them.",
    "Is he who stands upon evidence from his Lord, like someone whose bad deed is made to appear attractive to him? And they follow their own desires?",
    "The likeness of the Garden promised to the righteous: in it are rivers of pure water, and rivers of milk forever fresh, and rivers of wine delightful to the drinkers, and rivers of strained honey. And they will have in it of every fruit, and forgiveness from their Lord. Like someone remaining in the Fire forever, and are given to drink boiling water, that tears apart their bowels?",
    "And among them are those who listen to you. But when they leave your presence, they say to those given knowledge, “What did he just say?” These are they whose hearts God has sealed, and who follow their own desires.",
    "As for those who are guided: He increases them in guidance, and He grants them their reverence.",
    "Are they just waiting for the Hour to take them by surprise? Its tokens have already arrived. But when it has come upon them, what will their remembrance do for them?",
    "Know that there is no god but God, and ask forgiveness for your sin, and for the believing men and believing women. God knows your movements and your resting-place.",
    "Those who believe say, “If only a chapter was sent down.” Yet when a decisive chapter is sent down, and fighting is mentioned in it, you see those in whose hearts is sickness staring at you like someone fainting at death. More suitable for them.",
    "Obedience and upright speech. Then, when the matter is decided, being true to God would have been better for them.",
    "If you turn away, you are likely to make mischief on earth, and sever your family ties.",
    "Those are they whom God has condemned. He made them deaf, and He blinded their sight.",
    "Do they not contemplate the Quran? Or do hearts have their locks upon them?",
    "Those who relapsed after guidance became clear to them—Satan has enticed them, and he has given them latitude.",
    "That is because they said to those who hated what God revealed, “We will obey you in some issues.” But God knows their secret thoughts.",
    "How about when the angels take their souls, beating their faces and their backs?",
    "That is because they pursued what displeases God, and they disliked His approval, so He nullified their works.",
    "Or do those in whose hearts is a disease think that God will not expose their malice?",
    "Had We willed, We would have shown them to you, and you would have recognized them by their features. And you will recognize them by their tone of speech. And God knows your actions.",
    "And We will test you—until We prove those among you who strive, and those who persevere—and We will test your assertions.",
    "Those who disbelieve, and hinder from God’s path, and defy the Messenger after guidance became clear to them: they will not harm God in the least, but He will render their deeds worthless.",
    "O you who believe! Obey God, and obey the Messenger, and let not your deeds go to waste.",
    "Those who disbelieve, and hinder from God’s path, and then die as disbelievers: God will not forgive them.",
    "So do not waver and call for peace while you have the upper hand. God is with you, and He will not deprive you of your efforts.",
    "The life of this world is nothing but play and pastime. But if you believe and are reverent, He will grant you your rewards, and He will not ask you for your possessions.",
    "Were He to ask you for them, and pressure you, you would withhold, and He would expose your unwillingness.",
    "Here you are, being invited to donate in God’s cause. Among you are those who withhold. But whoever withholds is withholding against himself. God is the Rich, while you are the needy. And if you turn away, He will replace you with another people, and they will not be like you."
  ]
}