{
  "id": 48,
  "name": "الفتح",
  "transliteration": "al-Fath",
  "translation": "The Victory",
  "verses": [
    "We have opened the way for you to a notable victory.",
    "So that God may forgive you your sins—past and future—and complete His favor upon you, and guide you along a straight path.",
    "And so that God may help you with unwavering support.",
    "It is He who sends down tranquility into the hearts of believers, to add faith to their faith. To God belong the Forces of the heavens and the earth, and God is Knowing and Wise.",
    "So that He may admit the believers, male and female, into Gardens beneath which rivers flow, to remain there forever, and that He may remit their offenses. That, with God, is a great triumph.",
    "And so that He may punish the hypocrites, male and female, and the associators, male and female—those who harbor evil thoughts about God. They are surrounded by evil, and God is angry with them, and has cursed them, and has prepared for them Hell—a miserable destination.",
    "To God belong the Forces of the heavens and the earth. God is Mighty and Wise.",
    "We sent you as a witness, and a deliverer of good news, and a warner.",
    "So you may believe in God and His Messenger, and assist him, and respect him, and praise Him morning and evening.",
    "Those who pledge allegiance to you, are pledging allegiance to God. God’s hand is above their hands. Whoever breaks his pledge, breaks it against himself. And whosoever fulfills what He promised God, He will give him a great reward.",
    "The Nomadic-Arabs, who stayed behind, will say to you, “Our belongings and our families have preoccupied us, so ask forgiveness for us.” They say with their tongues what is not in their hearts. Say, “Who can avail you anything against God, if He intends harm for you, or intends benefit for you?” But God is well informed of what you do.",
    "But you assumed that the Messenger and the believers would not return to their families, ever, and this seemed fine to your hearts, and you harbored bad thoughts, and you became doomed people.",
    "Whoever does not believe in God and His Messenger—We have prepared for the unbelievers a Blaze.",
    "To God belongs the kingdom of the heavens and the earth. He forgives whom He wills, and He punishes whom He wills. And God is Forgiving and Merciful.",
    "Those who lagged behind will say when you depart to collect the gains, “Let us follow you.” They want to change the Word of God. Say, “You will not follow us; God has said so before.” Then they will say, “But you are jealous of us.” In fact, they understand only a little.",
    "Say to the Nomadic-Arabs who stayed behind, “You will be called to face a people of great strength. You will fight them—unless they submit. If you obey, God will give you a good reward. But if you turn away, as you turned away before, He will punish you a painful punishment.”",
    "There is no blame on the blind, nor any blame on the disabled, nor any blame on the sick. Whoever obeys God and His Messenger: He will admit him into Gardens beneath which rivers flow. But whoever turns away: He will punish him a painful punishment.",
    "God was pleased with the believers: when they pledged allegiance to you under the tree. He knew what was in their hearts, so He sent down Serenity upon them, and He rewarded them with an imminent conquest.",
    "And abundant gains that they will capture. God is Mighty and Wise.",
    "God has promised you abundant gains, that you will capture. He has expedited this for you, and He has restrained the people’s hands from you; so that it becomes a sign for the believers, and so that He may guide you to a straight path.",
    "And others of which you were incapable, God has surrounded them. God is Capable of all things.",
    "If those who disbelieve had fought you, they would have turned their backs, then they would have found neither protector nor helper.",
    "It is the pattern of God, ongoing since the past. You will find no change in God’s pattern.",
    "It is He Who restrained their hands from you, and your hands from them, in the valley of Mecca, after having given you the upper hand over them. God is Observer of whatever you do.",
    "It is they who disbelieved, and barred you from the Sacred Mosque, and prevented the offering from reaching its destination. Were it not for believing men and believing women, whom you did not know, you were about to hurt them, and become guilty unintentionally. Thus God admits into His mercy whom He wills. Had they dispersed, We would have punished those who disbelieved among them with a painful punishment.",
    "Those who disbelieve filled their hearts with prejudice—the prejudice of the age of ignorance. But God sent down His Tranquility upon His Messenger, and upon the believers, and He made binding on them the words of righteousness—to which they were most entitled and most deserving. God is Knower of all things.",
    "God has fulfilled His Messenger’s vision in truth: “You will enter the Sacred House, God willing, in safety, heads shaven, or hair shortened, not fearing. He knew what you did not know, and has granted besides this an imminent victory.”",
    "It is He who sent His Messenger with the guidance and the Religion of Truth, to make it prevail over all religion. And God is enough as Witness.",
    "Muhammad is the Messenger of God. Those with him are firm against the unbelievers, yet kind amongst themselves. You see them kneeling, prostrating, seeking God’s blessings and His approval. Their marks are on their faces from the effects of prostration. Such is their example in the Torah, and their example in the Gospel: like a seed that sprouts, becomes strong, grows thick, and rises on its stem, delighting the planters. Through them, He infuriates the unbelievers. God has promised those among them who believe and do good works forgiveness and a splendid reward."
  ]
}