{
  "id": 52,
  "name": "الـطور",
  "transliteration": "at-Tur",
  "translation": "The Mount",
  "verses": [
    "By the Mount.",
    "And a Book inscribed.",
    "In a published scroll.",
    "And the frequented House.",
    "And the elevated roof.",
    "And the seething sea.",
    "Your Lord’s punishment will occur.",
    "There is none to prevent it.",
    "On the Day when the sky sways in agitation.",
    "And the mountains go into motion.",
    "Woe on that Day to the deniers.",
    "Those who play with speculation.",
    "The Day when they are shoved forcefully into the Fire of Gehenna.",
    "“This is the Fire that you used to deny.",
    "Is this magic, or do you not see?",
    "Burn in it. Be patient, or impatient, it is the same for you. You are only being penalized for what you used to do.”",
    "The righteous will be amid Gardens and bliss.",
    "Enjoying what their Lord has given them, and their Lord has spared them the suffering of Hell.",
    "Eat and drink joyfully, because of what you used to do.",
    "Relaxing on arrayed furniture, We will couple them with gorgeous spouses.",
    "Those who believed and whose descendants followed them in faith: We will unite them with their descendants, and We will not deprive them of any of their works. Every person is a hostage to what he has earned.",
    "And We will supply them with fruit, and meat, as they desire.",
    "They will pass around a cup which leads to no-nonsense, nor sinfulness.",
    "Circulating among them to serve them will be youths, like hidden pearls.",
    "They will approach one another, inquiring.",
    "They will say, “Before this, we were fearful for our families.",
    "But God has blessed us, and He spared us the suffering of the Fiery Winds.",
    "Before this, we used to pray to Him. He is the Good, the Merciful.”",
    "So remind. By the grace of your Lord, you are neither an oracle nor a madman.",
    "Or do they say, “A poet—we anticipate for him a calamity of time.”",
    "Say, “Go on waiting; I am waiting with you.”",
    "Or is it their dreams compelling them to this? Or are they transgressing people?",
    "Or do they say, “He made it up”? In fact, they have no faith.",
    "So let them produce a discourse like it—if they are truthful.",
    "Or were they created from nothing? Or are they the creators?",
    "Or did they create the heavens and the earth? In fact, they are not certain.",
    "Or do they possess the treasuries of your Lord? Or are they the controllers?",
    "Or do they have a stairway by means of which they listen? Then let their listener produce a clear proof.",
    "Or for Him the daughters, and for you the sons?",
    "Or do you demand payment from them, and they are burdened by debt?",
    "Or do they know the future, and they write it down?",
    "Or are they plotting a conspiracy? The conspiracy will fall back on the unbelievers.",
    "Or do they have a god other than God? Glory be to God, above the partners they ascribe.",
    "And were they to see a piece of the sky falling, they would say, “A heap of clouds.”",
    "So leave them until they meet their Day when they will be stunned.",
    "The Day when their ploys will avail them nothing, and they will not be helped.",
    "For those who do wrong, there is a punishment besides that, but most of them do not know.",
    "So patiently await your Lord’s decision—you are before Our Eyes. And proclaim your Lord’s praises when you arise.",
    "And glorify Him during the night, and at the receding of the stars."
  ]
}