{
  "id": 57,
  "name": "الحـديد",
  "transliteration": "al-Hadid`",
  "translation": "The Iron",
  "verses": [
    "Whatsoever is in the heavens and the earth glorifies God. And He is the Mighty, the Wise.",
    "To Him belongs the kingdom of the heavens and the earth. He gives life and causes death, and He has Power over everything.",
    "He is the First and the Last, and the Outer and the Inner, and He has knowledge of all things.",
    "It is He who created the heavens and the earth in six stages, then settled on the Throne. He knows what penetrates into the earth, and what comes out of it, and what descends from the sky, and what ascends to it. And He is with you wherever you may be. And God sees whatever you do.",
    "To Him belongs sovereignty over the heavens and the earth. And to God, all matters are returned.",
    "He merges the night into the day, and He merges the day into the night. And He knows what the hearts contain.",
    "Believe in God and His Messenger, and donate from what He has entrusted you with. Those among you who believe and donate will have a great reward.",
    "And what is the matter with you, that you don’t believe in God, while the Messenger is calling you to believe in your Lord, and He received a pledge from you—if you are believers?",
    "It is He who sends down clear revelations upon His servant, to bring you out of darkness into light. And God is Kind towards you, Most Merciful.",
    "And what is the matter with you, that you do not spend in God’s way—when to God belongs the inheritance of the heavens and the earth? Not equal among you are those who spent and fought before the conquest. These are higher in rank than those who spent and fought afterward. But God has promised each goodness. God is Aware of whatever you do.",
    "And who is he who will lend God a loan of goodness, so that He multiplies it for him, and there is a generous reward for him?",
    "On the Day when you see the believing men and believing women—their light shining ahead of them, and to their right: “Good news for you today: gardens beneath which rivers flow, remaining in there forever. This is the ultimate success.”",
    "On the Day when the hypocrite men and the hypocrite women say to those who believed, “Wait for us; let us absorb some of your light.” It will be said, “Go back behind you, and seek a light.” A wall will be raised between them, in which is a door; within it is mercy, and outside it is agony.",
    "They will call to them, “Were we not with you?” They will say, “Yes, but you cheated your souls, and waited, and doubted, and became deluded by wishful thinking—until the command of God arrived—and the Deceiver deceived you about God.”",
    "“So today, no ransom will be accepted from you, nor from those who disbelieved. Your housing is the Fire. It is most worthy of you—what a miserable destination!”",
    "Is it not the time for those who believe to surrender their hearts to God’s remembrance, and to the truth that has come down, and not be like those who were given the Scripture before, but time became prolonged for them, so their hearts hardened, and many of them are sinful?",
    "Know that God revives the earth after its death. We made the signs clear for you, so you may understand.",
    "Charitable men and charitable women, who have loaned God a good loan—it will be multiplied for them, and for them is a generous reward.",
    "Those who believe in God and His messengers—it is they who are the truthful and the witnesses before their Lord. They have their reward and their light. As for those who disbelieve and deny Our revelations—these are the inhabitants of the Blaze.",
    "Know that the worldly life is but play, and distraction, and glitter, and boasting among you, and rivalry in wealth and children— the likeness of rainfall that produces plants and delights the disbelievers. But then it withers, and you see it yellowing, and then it becomes debris. And in the Hereafter, there is severe agony, and forgiveness from God, and acceptance. The life of this world is nothing but the enjoyment of delusion.",
    "Race to forgiveness from your Lord, and a Garden as vast as the heavens and the earth, prepared for those who believe in God and His messengers. That is the grace of God, He bestows it on whomever He wills. And God has Immense Grace.",
    "No calamity occurs on earth, or within yourselves, unless it is in a Book, even before We make it happen. That is easy for God.",
    "So that you may not sorrow over what eludes you, nor exult in what He has given you. God does not love the proud snob.",
    "Those who are stingy, and direct people to stinginess. Whoever turns away—God is the Independent, the Praiseworthy.",
    "We sent Our messengers with clear proofs, and We sent down with them the Scripture and the Balance, so that people would uphold justice. And We sent down iron: in which is a violent force, and benefits for humanity. So that God may know those who will support Him and His messenger in secret. God is Strong and Powerful.",
    "We sent Noah and Abraham, and We established in their line Prophethood and Scripture. Some of them are guided, but many of them are sinners.",
    "Then We sent Our messengers to follow in their footsteps. And We followed up with Jesus son of Mary, and We gave him the Gospel. And We instilled in the hearts of those who followed him compassion and mercy. But as for the monasticism which they invented—We did not mandate it to them—only to seek God’s approval. But they did not observe it with its due observance. So We gave those among them who believed their reward, but many of them are sinful.",
    "O you who believe! Be conscious of God, and believe in His Messenger: He will give you a double portion of His mercy, and He will give you a light, by which you walk, and He will forgive you. God is Forgiving and Merciful.",
    "So that the People of the Scripture may know that they have no control whatsoever over God’s grace, and that all grace is in God’s hand. He gives it to whomever He wills. And God has enormous grace."
  ]
}