{
  "id": 58,
  "name": "الـمجادلـة",
  "transliteration": "al-Mujadilah",
  "translation": "The Pleading Woman",
  "verses": [
    "God has heard the statement of she who argued with you about her husband, as she complained to God. And God heard your conversation. God is Hearing and Seeing.",
    "Those among you who estrange their wives by equating them with their mothers—they are not their mothers. None are their mothers except those who gave birth to them. What they say is wrong, and a blatant lie. But God is Pardoning, Forgiving.",
    "Those who estrange their wives by equating them with their mothers, then go back on what they said, must set free a slave before they may touch one another. To that, you are counseled. God is aware of what you do.",
    "But whoever cannot find the means must fast for two consecutive months before they may touch one another. But if he is unable, then the feeding of sixty needy people. This is to affirm your faith in God and His Messenger. These are the limits set by God. And the unbelievers will have a painful punishment.",
    "Those who oppose God and His Messenger will be subdued, just like those before them were subdued. We have revealed explicit messages, and the unbelievers will have a demeaning punishment.",
    "On the Day when God resurrects them all together, and He informs them of what they did. God has kept count of it, but they have forgotten it. God is Witness over all things.",
    "Do you not realize that God knows everything in the heavens and everything on earth? There is no secret conversation between three, but He is their fourth; nor between five, but He is their sixth; nor less than that, nor more, but He is with them wherever they may be. Then, on the Day of Resurrection, He will inform them of what they did. God has knowledge of all things.",
    "Have you not noticed those who were prohibited from conspiring secretly, but then reverted to what they were prohibited from? They conspire to commit wrongdoing, aggression, and disobedience of the Messenger. And when they come to you, they greet you with a greeting God never greeted you with. And they say within themselves, “Why does God not punish us for what we say?” Hell is enough for them. They will roast in it. What a miserable destination.",
    "O you who believe! When you converse privately, do not converse in wrongdoing, aggression, or disobedience of the Messenger; but converse in virtue and piety. And fear God, to Whom you will be gathered.",
    "Conspiracies are from Satan, so that he may dishearten those who believe. But he cannot harm them whatsoever, except with God’s permission. So in God, let the believers put their trust.",
    "O you who believe! When you are told to make room in gatherings, make room; God will make room for you. And when you are told to disperse, disperse. God elevates those among you who believe and those given knowledge, many steps. And God is Aware of what you do.",
    "O you who believe! When you consult the Messenger privately, give something in charity before your consultation. That is better for you, and purer. But if you lack the means—God is Forgiving and Merciful.",
    "Are you reluctant to offer charity before your private consultations? Since you are unable to do so, and God has pardoned you, then perform the prayers, and give charitable gifts, and obey God and His Messenger. God is Aware of what you do.",
    "Have you considered those who befriend a people with whom God has become angry? They are not of you, nor of them. And they knowingly swear to lies.",
    "God has prepared for them a terrible punishment. Evil is what they used to do.",
    "They took their oaths as a cover-up, and they prevented others from God’s path. They will have a humiliating punishment.",
    "Neither their wealth nor their children will avail them anything against God. These are the residents of the Fire, where they will remain forever.",
    "On the Day when God will resurrect them all. They will swear to Him, as they swear to you, thinking that they are upon something. They themselves are the liars.",
    "Satan has taken hold of them, and so has caused them to forget the remembrance of God. These are the partisans of Satan. Unquestionably, it is Satan’s partisans who are the losers.",
    "Those who oppose God and His Messenger are among the lowliest.",
    "God has written: “I will certainly prevail, I and My messengers.” God is Strong, Mighty.",
    "You will not find a people who believe in God and the Last Day, loving those who oppose God and His Messenger, even if they were their parents, or their children, or their siblings, or their close relatives. These: He has instilled faith in their hearts, and He has supported them with a Spirit from Him. And He will admit them into Gardens under which rivers flow, where they will dwell forever. God is pleased with them, and they are pleased with Him. These are the partisans of God. Unquestionably, it is God’s partisans who are the successful."
  ]
}