{
  "id": 61,
  "name": "الـصـف",
  "transliteration": "as-Saff",
  "translation": "The Ranks",
  "verses": [
    "Whatsoever is in the heavens and whatsoever is on earth praises God. He is the Almighty, the Wise.",
    "O you who believe! Why do you say what you do not do?",
    "It is most hateful to God that you say what you do not do.",
    "God loves those who fight in His way, in ranks, as if they were a solid structure.",
    "When Moses said to his people, “O my people, why do you hurt me, although you know that I am God’s Messenger to you?” And when they deviated, God deviated their hearts. God does not guide the sinful people.",
    "And when Jesus son of Mary said, “O Children of Israel, I am God’s Messenger to you, confirming what preceded me of the Torah, and bringing the good news of a Messenger who will come after me, whose name is Ahmad.” But when he brought them the miracles, they said, “This is obvious magic.”",
    "And who is more unjust than he who attributes falsehoods to God, while he is being called to Submission? God does not guide the wrongdoing people.",
    "They want to extinguish God’s Light with their mouths, but God will complete His Light, even though the disbelievers hate it.",
    "It is He who sent His Messenger with the guidance and the Religion of Truth, to make it prevail over all religion, even though the associators hate it.",
    "O you who believe! Shall I direct you to a trade that will save you from a painful punishment?",
    "Believe in God and His Messenger, and you strive in God’s path with your wealth and yourselves. That is best for you—if you only knew.",
    "He will forgive you your sins, and He will admit you into Gardens under which rivers flow, and into beautiful mansions in the Gardens of Eternity. That is the supreme success.",
    "And another thing you love: support from God, and imminent victory. So give good news to the believers.",
    "O you who believe! Stand up for God, as Jesus son of Mary said to the disciples, “Who will stand up with me for God?” The disciples said, “We will stand up for God.” Then a faction of the Children of Israel believed, while another faction disbelieved. And We supported those who believed against their enemies, and they became dominant."
  ]
}