{
  "id": 63,
  "name": "الـمنافقون",
  "transliteration": "al-Munafiqun",
  "translation": "The Hypocrites",
  "verses": [
    "When the hypocrites come to you, they say, “We testify that you are God’s Messenger.” Yet God knows that you are His Messenger, and God testifies that the hypocrites are liars.",
    "They have taken their oaths as a shield, hindering others from God’s path. Evil is what they do.",
    "That is because they believed and then disbelieved. So a seal was set upon their hearts, so they do not understand.",
    "And when you see them, their appearance impresses you. And when they speak, you listen to what they say. They are like propped-up timber. They think that every shout is aimed at them. They are the enemy, so beware of them. God destroy them; how deluded they are!",
    "And when it is said to them, “Come, the Messenger of God will ask forgiveness for you,” they turn their heads, and you see them turning away arrogantly.",
    "It is the same for them, whether you ask forgiveness for them, or you do not ask forgiveness for them, God will not forgive them. God does not guide the disobedient people.",
    "It is they who say: “Do not spend on those who are with God’s Messenger, unless they have dispersed.” Yet to God belong the treasuries of the heavens and the earth, but the hypocrites do not comprehend.",
    "They say, “If we return to Medina, the stronger will expel the weaker therefrom.” Yet might belongs to God, His Messenger, and the believers, but the hypocrites do not know.",
    "O you who believe! Let neither your possessions nor your children divert you from God’s remembrance. Whoever does that—these are the losers.",
    "And donate from what We have provided for you—before death approaches one of you, and he says, “My Lord: if only You would postpone me for a short while, so that I may be charitable, and be of the righteous.”",
    "But God will not postpone a soul when its appointed time has come. And God is Aware of whatever you do."
  ]
}