{
  "id": 66,
  "name": "الـتحريم",
  "transliteration": "at-Tahrim",
  "translation": "The Prohibition",
  "verses": [
    "O prophet! Why do you prohibit what God has permitted for you, seeking to please your wives? God is Forgiving and Merciful.",
    "God has mandated for you the dissolution of your oaths. And God is your Master. And He is the Knower, the Wise.",
    "The Prophet had confided something to one of his wives. But when she disclosed it, and God made it known to him: he confirmed part of it, and he avoided another part. Then, when he informed her of it, she said, “Who informed you of this?” He said, “The Knower, the Aware informed me.”",
    "If you repent to God, then your hearts have inclined. But if you collaborate against him, then God is his Protector, as are Gabriel and the righteous believers. In addition, the angels will support him.",
    "Perhaps, if he divorces you, his Lord will give him in exchange wives better than you: submissive, believing, obedient, penitent, dedicated to worship, and given to wayfaring—previously married, or virgins.",
    "O you who believe! Protect yourselves and your families from a Fire, whose fuel is people and stones. Overseeing it are angels, fierce and severe. They never disobey God in anything He has commanded them, and they carry out whatever they are commanded.",
    "O you who disbelieved! Make no excuses today. You are being penalized for what you used to do.",
    "O you who believe! Repent to God with sincere repentance. Perhaps your Lord will remit your sins, and admit you into Gardens under which rivers flow—on the Day when God will not disappoint the Prophet and those who believed with him. Their light streaming ahead of them, and to their right, and they say, “Our Lord, complete our light for us, and forgive us; You are capable of all things.”",
    "O prophet! Strive hard against the unbelievers and the hypocrites, and be stern with them. Their dwelling is Gehenna. What a miserable destination.",
    "God illustrates an example for those who disbelieve: the wife of Noah and the wife of Lot. They were under two of Our righteous servants, but they betrayed them. They availed them nothing against God, and it was said, “Enter the Fire with those who are entering.”",
    "And God illustrates an example for those who believe: the wife of Pharaoh, when she said, “My Lord! Build for me a house in Paradise near You, and rescue me from Pharaoh and his works, and rescue me from the wrongdoing people.”",
    "And Mary, the daughter of Imran, who guarded her womb, and so We blew into her of Our Spirit, and she testified to the Words of her Lord and His Scriptures—and was among the devout."
  ]
}