{
  "id": 69,
  "name": "الـحاقـة",
  "transliteration": "al-Haqqah",
  "translation": "The Reality",
  "verses": [
    "The Reality.",
    "What is the Reality?",
    "What will make you understand what the Reality is?",
    "Thamood and Aad denied the Catastrophe.",
    "As for Thamood, they were annihilated by the Overwhelming.",
    "And as for Aad, they were annihilated by a furious, roaring wind.",
    "He unleashed it against them for seven nights and eight days, in succession. You could see the people tossed around, as if they were hollow palm trunks.",
    "Can you see any remnant of them?",
    "Then came Pharaoh, and those before him, and the Overturned Cities indulged in sin.",
    "They disobeyed their Lord's messenger, so He seized them with a devastating grip.",
    "When the waters overflowed, We carried you in the cruising Ark.",
    "To make it a lesson for you—and so that retaining ears may retain it.",
    "Then, when the Trumpet is blown, a single blow.",
    "And the earth and the mountains are lifted, and crushed with a single blow.",
    "On that Day, the Inevitable will come to pass.",
    "And the sky will crack. On that Day, it will be frail.",
    "And the angels will be ranged around its borders, while on that day eight will be carrying your Lord’s throne above them.",
    "On that Day, you will be exposed, and no secret of yours will remain hidden.",
    "As for him who is given his book in his right hand, he will say, “Here, take my book and read it.",
    "I knew I would be held accountable.”",
    "So he will be in pleasant living.",
    "In a lofty Garden.",
    "Its pickings are within reach.",
    "“Eat and drink merrily for what you did in days gone by.”",
    "But as for him who is given his book in his left hand, he will say, “I wish I was never given my book.",
    "And never knew what my account was.",
    "I wish it was the end.",
    "My money did not avail me.",
    "My power has vanished from me.”",
    "“Take him and shackle him.",
    "Then scorch him in the Blaze.",
    "Then in a chain whose length is seventy cubits, tie him up.",
    "For he would not believe in God, the Great.",
    "Nor would he advocate the feeding of the destitute.",
    "So he has no friend here today.",
    "And no food, except scum.",
    "Which none will eat, except the sinners.”",
    "So I swear by what you see.",
    "And by what you do not see.",
    "It is the speech of a noble messenger.",
    "And it is not the speech of a poet—little do you believe.",
    "Nor is it the speech of a fortune-teller. Little do you reflect.",
    "A revelation from the Lord of the Worlds.",
    "Had he falsely attributed some statements to Us.",
    "We would have seized him by the right arm.",
    "Then slashed his lifeline.",
    "And none of you could have restrained Us from him.",
    "And it is a reminder for the righteous.",
    "And We know that some of you will deny it.",
    "And it is a source of regret for the unbelievers.",
    "Yet it is the truth of certainty.",
    "So glorify the Name of your Lord, the Magnificent."
  ]
}