{
  "id": 70,
  "name": "الـمعارج",
  "transliteration": "al-Ma'arij",
  "translation": "The Ascending Stairways",
  "verses": [
    "A questioner asked about the impending punishment.",
    "For the disbelievers—to be repelled by none.",
    "From God, Lord of the ascending ways.",
    "To Him ascend the angels and the Spirit on a Day whose duration is fifty thousand years.",
    "So be patient, with beautiful patience.",
    "They see it distant.",
    "But We see it near.",
    "On the Day when the sky becomes like molten brass.",
    "And the mountains become like tufted wool.",
    "No friend will ask about a friend.",
    "They will be shown each other. The criminal will wish he could be redeemed from the punishment of that Day by his children.",
    "And his spouse, and his brother.",
    "And his family that sheltered him.",
    "And everyone on earth altogether, just to save him.",
    "By no means! It is a Raging Flame.",
    "It strips away the scalps.",
    "It invites him who once turned his back and fled.",
    "And accumulated and hoarded.",
    "The human being was created anxious.",
    "Touched by adversity, he is fretful.",
    "Touched by good, he is ungenerous.",
    "Except for the prayerful.",
    "Those who are constant in their prayers.",
    "And those in whose wealth is a rightful share.",
    "For the beggar and the deprived.",
    "And those who affirm the Day of Judgment.",
    "And those who dread their Lord’s punishment.",
    "Their Lord’s punishment is not to be taken for granted.",
    "And those who guard their private parts.",
    "Except from their spouses, or those living under their control, for then they are blameless.",
    "But whoever seeks beyond that—these are the transgressors.",
    "And those who observe their trusts and their promises.",
    "And those who uphold their testimony.",
    "And those who are dedicated to their prayers.",
    "These will be honored in Gardens.",
    "What is with those who disbelieve, scrambling towards you?",
    "From the right, and from the left, in droves?",
    "Is every one of them aspiring to be admitted into a Garden of Bliss?",
    "No indeed! We created them from what they know.",
    "I swear by the Lord of the Easts and the Wests, that We are Capable.",
    "Of replacing them with what is better than they, and We are not to be surpassed.",
    "So leave them to blunder and play, until they meet their Day which they are promised.",
    "The Day when they will emerge from the graves in a rush, as if they were racing to a target.",
    "Their eyes downcast, overwhelmed by disgrace. This is the Day which they were promised."
  ]
}