{
  "id": 73,
  "name": "الـمـزمـل",
  "transliteration": "al-Muzzammil",
  "translation": "The Enshrouded One",
  "verses": [
    "O you Enwrapped.",
    "Stand vigil at night, except a little.",
    "Half of it, or reduce it a little.",
    "Or add to it—and recite the Quran slowly and rhythmically.",
    "We are about to give you a heavy message.",
    "The vigil of the night is more effective—and more conducive to recitation.",
    "In the daytime, you have long work to do.",
    "So remember the Name of your Lord, and devote yourself to Him wholeheartedly.",
    "Lord of the East and the West. There is no god except He, so take Him as a Trustee.",
    "And patiently endure what they say, and withdraw from them politely.",
    "And leave to Me the deniers—those of luxury—and bear with them for a little while.",
    "With Us are shackles, and a Fierce Fire.",
    "And food that chokes, and painful punishment.",
    "On the Day when the earth and the mountains tremble, and the mountains become heaps of sand.",
    "We sent to you a messenger, a witness over you, as We sent to Pharaoh a messenger.",
    "But Pharaoh disobeyed the Messenger, so We seized him with a crushing seizing.",
    "So how will you, if you persist in unbelief, save yourself from a Day which will turn the children gray-haired?",
    "The sky will shatter thereby. His promise is always fulfilled.",
    "This is a reminder. So whoever wills, let him take a path to his Lord.",
    "Your Lord knows that you stand vigil nearly two-thirds of the night, or half of it, or third of it, along with a group of those with you. God determines the night and the day. He knows that you will be unable to sustain it, so He has relented towards you. So read of the Quran what is easy for you. He knows that some of you may be ill; and others traveling through the land, seeking God’s bounty; and others fighting in God’s way. So read of it what is easy for you, and perform the prayer, and give the purifying charity, and lend God a loan of goodness. Whatever good you advance for yourselves, you will find it with God, improved and greater in reward. And ask God for forgiveness—God is Forgiving and Merciful."
  ]
}