{
  "id": 74,
  "name": "الـمـدثـر",
  "transliteration": "al-Muddathir",
  "translation": "The Cloaked One",
  "verses": [
    "O you covered up.",
    "Arise and warn.",
    "And glorify your Lord.",
    "And purify your clothes.",
    "And abandon abominations.",
    "And show no favor, seeking gain.",
    "And be constant for your Lord.",
    "When the Trumpet is sounded.",
    "That Day will be a difficult day.",
    "For the disbelievers—not easy.",
    "Leave Me alone to him whom I created.",
    "And gave him vast wealth.",
    "And children as witnesses.",
    "And smoothed things for him.",
    "Yet he desires that I should add more.",
    "By no means! He was stubborn towards Our revelations.",
    "I will exhaust him increasingly.",
    "He thought and analyzed.",
    "May he perish, how he analyzed.",
    "Again: may he perish, how he analyzed.",
    "Then he looked.",
    "Then he frowned and whined.",
    "Then he turned his back and was proud.",
    "And said, “This is nothing but magic from the past.",
    "This is nothing but the word of a human being.”",
    "I will roast him in Saqar.",
    "But what will explain to you what Saqar is?",
    "It neither leaves nor spares.",
    "It scorches the skin.",
    "Over it are Nineteen.",
    "We have appointed none but angels as wardens of the Fire; and We caused their number to be a stumbling block for those who disbelieve; so that those given the Scripture may attain certainty; and those who believe may increase in faith; and those given the Scripture and the believers may not doubt; and those in whose hearts is sickness and the unbelievers may say, “What did God intend by this parable?” Thus God leads astray whom He wills, and He guides whom He wills. And none knows the soldiers of your Lord except He. And it is but a reminder to the humans.",
    "But no! By the moon.",
    "And the night as it retreats.",
    "And the morning as it brightens.",
    "It is one of the greatest.",
    "A warning to humans.",
    "To those among you who wish to advance, or lag behind.",
    "Every soul is hostage to what it has done.",
    "Except for those on the Right.",
    "In Gardens, asking one another.",
    "About the guilty.",
    "“What led you into Saqar?”",
    "They will say, “We were not of those who prayed.",
    "Nor did we feed the poor.",
    "And we used to indulge with those who indulge.",
    "And we used to deny Judgement Day.",
    "Until certainty came upon us.”",
    "But the intercession of intercessors will not benefit them.",
    "So what is the matter with them, turning away from the Reminder?",
    "As if they were panicked donkeys.",
    "Fleeing from a lion.",
    "Yet every one of them wants to be given scrolls unrolled.",
    "No indeed! But they do not fear the Hereafter.",
    "Nevertheless, it is a reminder.",
    "So whoever wills, shall remember it.",
    "But they will not remember—unless God wills. He is the Source of Righteousness and the Source of Forgiveness."
  ]
}