{
  "id": 75,
  "name": "الـقـيامـة",
  "transliteration": "al-Qiyamah",
  "translation": "The Resurrection",
  "verses": [
    "I swear by the Day of Resurrection.",
    "And I swear by the blaming soul.",
    "Does the human being think that We will not gather his bones?",
    "Yes indeed! We are able to reconstruct his fingertips.",
    "But the human being wants to deny what lies ahead of him.",
    "He asks, “When is the Day of Resurrection?”",
    "When vision is dazzled.",
    "And the moon is eclipsed.",
    "And the sun and the moon are joined together.",
    "On that Day, man will say, “Where is the escape?”",
    "No indeed! There is no refuge.",
    "To your Lord on that Day is the settlement.",
    "On that Day, man will be informed of what he put forward, and what he left behind.",
    "And man will be evidence against himself.",
    "Even as he presents his excuses.",
    "Do not move your tongue with it, to hurry on with it.",
    "Upon Us are its collection and its recitation.",
    "Then, when We have recited it, follow its recitation.",
    "Then upon Us is its explanation.",
    "Alas! But you love the Fleeting.",
    "And you disregard the Hereafter.",
    "Faces on that Day will be radiant.",
    "Looking towards their Lord.",
    "And faces on that Day will be gloomy.",
    "Realizing that a back-breaker has befallen them.",
    "Indeed, when it has reached the collarbones.",
    "And it is said, “Who is the healer?”",
    "And he realizes that it is the parting.",
    "And the leg is entwined with the leg.",
    "To your Lord on that Day is the drive.",
    "He neither believed nor prayed.",
    "But he denied and turned away.",
    "Then he went to his family, walking proudly.",
    "So nearer to you! And nearer!",
    "Then again: Nearer to you! And nearer!",
    "Does the human being think that he will be left without purpose?",
    "Was he not a fertilized egg from ejaculated semen?",
    "Then he became a clot. And He created and proportioned?",
    "And He made of him the two sexes: the male, and the female?",
    "Is not such able to give life to the dead?"
  ]
}