{
  "id": 78,
  "name": "الـنبإ",
  "transliteration": "an-Naba'",
  "translation": "The Tidings",
  "verses": [
    "What are they asking one another about?",
    "About the Momentous News.",
    "About which they disagree.",
    "Surely, they will know.",
    "Most certainly, they will know.",
    "Did We not make the earth a cradle?",
    "And the mountains pegs?",
    "And created you in pairs?",
    "And made your sleep for rest?",
    "And made the night a cover?",
    "And made the day for livelihood?",
    "And constructed above you seven firmaments?",
    "And placed a blazing lamp?",
    "And sent down from the clouds pouring water?",
    "To produce with it grains and vegetation?",
    "And lush gardens?",
    "The Day of Sorting has been appointed.",
    "The Day when the Trumpet is blown, and you will come in crowds.",
    "And the sky is opened up, and it becomes gateways.",
    "And the mountains are set in motion, and they become a mirage.",
    "Hell is lying in ambush.",
    "For the oppressors, a destination.",
    "Where they will remain for eons.",
    "They will taste in it neither coolness nor drink.",
    "Except boiling water and freezing hail.",
    "An appropriate punishment.",
    "They were not anticipating any reckoning.",
    "And they denied Our signs with utter denial.",
    "And We have recorded everything in a book.",
    "So taste! We will increase you in nothing but suffering.",
    "But for the righteous, there is triumph.",
    "Gardens and vineyards.",
    "And splendid spouses, well-matched.",
    "And overflowing cups.",
    "They will hear in it neither gossip nor lies.",
    "A reward from your Lord, a calculated reward.",
    "Lord of the heavens and the earth, and whatever is between them—The Most Merciful—they will have no authorization from Him to speak.",
    "On the Day when the Spirit and the angels stand in a row. They will not speak, except those granted permission by the Compassionate and whose words are true.",
    "This is the Day of Reality. So whoever wills, let him take a path back to his Lord.",
    "We have warned you of an imminent punishment—the Day when a person will observe what his hands have produced, and the unbeliever will say, “I wish I were dust.”"
  ]
}