{
  "id": 79,
  "name": "الـنازعات",
  "transliteration": "an-Nazi'at",
  "translation": "Those who drag forth",
  "verses": [
    "By those snatching violently.",
    "And those removing gently.",
    "And those gliding smoothly.",
    "And those racing swiftly.",
    "And those regulating events.",
    "On the Day when the Quake quakes.",
    "And is followed by the Successor.",
    "Hearts on that Day will be pounding.",
    "Their sights downcast.",
    "They say, “Are we to be restored to the original condition?",
    "When we have become hollow bones?”",
    "They say, “This is a losing proposition.”",
    "But it will be only a single nudge.",
    "And they will be awake.",
    "Has the story of Moses reached you?",
    "When His Lord called out to him in the sacred valley of Tuwa.",
    "“Go to Pharaoh—he has transgressed.”",
    "And say, “Do you care to be purified?",
    "And I will guide you to your Lord, and you will turn reverent.”",
    "Then he showed him the Great Miracle.",
    "But he denied and disobeyed.",
    "Then he turned his back, and tried.",
    "And gathered and proclaimed.",
    "He said, “I am your Lord, the most high.”",
    "So God seized him with exemplary punishment, in the last and in the first.",
    "In this is a lesson for whoever fears.",
    "Are you more difficult to create, or the sky? He constructed it.",
    "He raised its masses, and He proportioned it.",
    "And He dimmed its night, and He brought out its daylight.",
    "And after that, He spread out the earth.",
    "And from it, He brought out its water and its pasture.",
    "And the mountains, He anchored.",
    "A source of enjoyment for you and your livestock.",
    "But when the Great Cataclysm befalls.",
    "A Day when the human being will remember what he has endeavored.",
    "And the Furnace will be displayed for whoever sees.",
    "As for him who has transgressed.",
    "And preferred the life of this world.",
    "Then the Furnace is the shelter.",
    "But as for him who feared the Standing of his Lord, and restrained the self from desires.",
    "Then Paradise is the shelter.",
    "They ask you about the Hour, “When will it take place?”",
    "You have no knowledge of it.",
    "To your Lord is its finality.",
    "You are only to warn whoever dreads it.",
    "On the Day when they see it—it will be as if they had stayed only an evening or its morning."
  ]
}