{
  "id": 9,
  "name": "التوبة",
  "transliteration": "at-Tawbah",
  "translation": "The Repentance",
  "verses": [
    "A declaration of immunity from God and His Messenger to the associators with whom you had made a treaty.",
    "So travel the land for four months, and know that you cannot escape God, and that God will disgrace the unbelievers.",
    "And a proclamation from God and His Messenger to the people on the day of the Greater Pilgrimage, that God has disowned the polytheists, and so did His Messenger. If you repent, it will be better for you. But if you turn away, know that you cannot escape God. And announce to those who disbelieve a painful punishment.",
    "Except for those among the idolaters with whom you had made a treaty, and have violated none of its terms, nor aided anyone against you. So fulfill your treaty with them to the end of its term. God loves the righteous.",
    "Then, when the Sacred Months have passed, kill the polytheists wherever you find them. And capture them, and besiege them, and lie in wait for them at every ambush. But if they repent, and perform the prayers, and give the alms, then let them go their way. God is Most Forgiving, Most Merciful.",
    "And if any of the associators seek asylum with you, give him asylum, so that he may hear the Word of God; then escort him to his place of safety. That is because they are a people who do not know.",
    "How can the associators have a treaty with God and with His Messenger, except for those with whom you made a treaty at the Sacred Sanctuary? If they remain upright with you, remain upright with them. God loves the reverent.",
    "How? When they overcome you, they respect neither kinship nor treaty with you. They satisfy you with lip service, but their hearts refuse, and most of them are immoral.",
    "They traded away God's revelations for a cheap price, and barred others from His path—evil is what they used to do.",
    "Towards a believer, they respect neither kinship nor treaty. These are the offenders.",
    "But if they repent, and perform the prayers, and give the obligatory charity, then they are your brothers in faith. We detail the revelations for a people who know.",
    "But if they violate their oaths after making a pledge, and attack your faith, then fight the leaders of disbelief—they have no oaths—so that they may cease.",
    "Will you not fight a people who violated their oaths, and intended to expel the Messenger, and initiated hostilities against you? Do you fear them? It is God you should fear—if you are believers.",
    "Fight them. God will punish them at your hands, and humiliate them, and He will help you against them, and will heal the hearts of a believing people.",
    "And He will remove the rage of their hearts. God relents towards whomever He wills. God is Knowledgeable and Wise.",
    "Or did you suppose that you would be left alone, while God has not yet identified those among you who strive and take no friend apart from God, His Messenger, and the believers? God is Expert at what you do.",
    "It is not for the associators to attend God’s mosques while professing their disbelief against themselves. These—their deeds are void; and in the Fire, they will abide.",
    "The only people to attend God’s mosques are those who believe in God and the Last Day, and pray regularly, and practice regular charity, and fear none except God. These are most likely to be guided.",
    "Or do you consider giving drink to the pilgrims and maintaining the Sacred House equal to those who believe in God and the Last Day and strive in God’s way? They are not equal in the sight of God. God does not guide the unjust people.",
    "Those who believe, and migrate, and strive in God’s path with their wealth and their lives, are of higher rank with God. These are the winners.",
    "Their Lord gives them the good news of mercy from Him, and acceptance, and Gardens where they will have lasting bliss.",
    "To stay there forever. With God is a great reward.",
    "O you who believe! Do not take your parents and your siblings for allies, if they prefer disbelief to belief. Whoever of you allies himself with them—these are the wrongdoers.",
    "Say, “If your parents, your children, your siblings, your spouses, your relatives, the wealth you have acquired, business you worry about, and homes you love, are dearer to you than God, and His Messenger, and striving in His way, then wait until God brings about His judgment.” God does not guide the rebellious people.",
    "God has given you victory in many regions; but on the day of Hunayn, your great number impressed you, but it availed you nothing; and the land, as spacious as it was, closed in on you; and you turned back in retreat.",
    "Then God sent down His Tranquility upon His Messenger, and upon the believers. And He sent down forces you could not see, and He punished those who disbelieved. That is the payback of the disbelievers.",
    "Then, after that, God relents towards whomever He wills. God is Forgiving and Merciful.",
    "O you who believe! The associators are polluted, so let them not come near the Sacred House after this year of theirs. And if you fear poverty, God will enrich you from His bounty, if He wills. God is Aware and Wise.",
    "Fight those who do not believe in God and in the Last Day, and who do not forbid what God and His Messenger have forbidden, and who do not follow the Religion of Truth among those who were given the Scripture, until they pay the due tax with a willing hand, being compliant.",
    "The Jews said, “Ezra is the son of God,” and the Christians said, “The Messiah is the son of God.” These are their statements out of their mouths. They emulate the statements of those who disbelieved before. May God fight them! How deluded they are!",
    "They have taken their scholars and their priests as lords instead of God, and the Christ son of Mary. Although they were only commanded to worship one God. There is no god except He! Glory be to Him, above the partners they ascribe.",
    "They want to extinguish God’s light with their mouths, but God refuses except to complete His light, even though the unbelievers hate it.",
    "It is He Who sent His Messenger with the guidance and the religion of truth, to make it prevail over all religions, even though the associators hate it.",
    "O you who believe! Many of the pastors and priests consume people's wealth illicitly and hinder from God’s path. Those who hoard gold and silver, and do not spend it in God’s way, inform them of a painful punishment.",
    "On the Day when they will be heated in the Fire of Hell, then their foreheads, their sides, and their backs will be branded with it: “This is what you hoarded for yourselves; so taste what you used to hoard.”",
    "The number of months, according to God, is twelve months—in the decree of God—the Day He created the heavens and the earth, of which four are sacred. This is the upright religion. So do not wrong yourselves during them. And fight the polytheists collectively, as they fight you collectively, and know that God is with the righteous.",
    "The postponement is an increase in disbelief—by which the unbelievers are misled. They allow it one year, and forbid it another year, in order to conform to the number made sacred by God, thus permitting what God has forbidden. The bad of their deeds was beautified for them. God does not guide the disbelieving people.",
    "O you who believe! What is the matter with you, when it is said to you, “Mobilize in the way of God,” you cling heavily to the earth? Do you prefer the present life over the Hereafter? The enjoyment of the present life, compared to the Hereafter, is only a little.",
    "Unless you mobilize, He will punish you most painfully, and He will replace you with another people; and you will not harm Him at all. God is capable of everything.",
    "If you do not support him, God has already supported him, when those who disbelieved expelled him, and he was the second of two in the cave. He said to his friend, “Do not be sad, God is with us.” Then God made His tranquility descend on him, and He supported him with forces you did not see, and He made the word of those who disbelieve the lowest, while God’s Word is the Highest. God is Mighty and Wise.",
    "Mobilize, light or heavy, and strive with your wealth and your lives in God’s way. That is best for you—if you only knew.",
    "Had the gain been immediate, and the journey shorter, they would have followed you. But the far distance was hard for them. Still, they swear by God: “Had we been able, we would have marched out with you.” They damn their own souls, and God knows that they are lying.",
    "God pardon you! Why did you give them permission before it became clear to you who are the truthful ones, and who are the liars?",
    "Those who believe in God and the Last Day do not ask you for exemption from striving with their wealth and their lives. God is fully aware of the righteous.",
    "Only those who do not believe in God and the Last Day ask you for exemption. Their hearts are full of doubt, so they waver in their doubt.",
    "Had they wanted to mobilize, they would have made preparations for it; but God disliked their participation, so He held them back, and it was said, “Stay with those who stay behind.”",
    "Had they mobilized with you, they would have added only to your difficulties, and they would have spread rumors in your midst, trying to sow discord among you. Some of you are avid listeners to them. God knows the wrongdoers.",
    "They tried to create conflict before, and they turned the issues for you; until the truth prevailed, and God’s command became evident—despite their dislike.",
    "And among them is he who says, “Excuse me, and do not trouble me.” In fact, they have sunk into trouble. In fact, Hell will engulf the disbelievers.",
    "If something good happens to you, it upsets them; and if a misfortune befalls you, they say, “We took our precautions in advance,” and they depart, happy.",
    "Say, “Nothing will happen to us, except what God has destined for us. He is our Protector. So in God, let the believers trust.”",
    "Say, “Are you expecting for us anything other than one of the two excellences? As for us: we are expecting that God will afflict you with a punishment from Him, or at our hands. So wait, we are waiting with you.”",
    "Say, “Donate, willingly or unwillingly, it will not be accepted from you. You are disobedient people.”",
    "What prevents the acceptance of their contributions is nothing but the fact that they disbelieved in God and His Messenger, and that they do not approach the prayer except lazily, and that they do not donate except resentfully.",
    "Let neither their possessions nor their children impress you. God intends to torment them through them in this worldly life, then their souls depart while they are disbelievers.",
    "And they swear by God, that they are of you. But they are not of you. They are a people in fear.",
    "Were they to find a shelter, or a cave, or a hideout, they would rush towards it defiantly.",
    "And among them are those who criticize you regarding charities. If they are given some of it, they become pleased; but if they are not given any, they grow resentful.",
    "If only they were content with what God and His Messenger have given them, and said, “God is sufficient for us. God will give us from His bounty, as will His Messenger. Our desire is for God.”",
    "Charities are for the poor, and the destitute, and those who administer them, and for reconciling hearts, and for freeing slaves, and for those in debt, and in the path of God, and for the homeless—an mandate from God. God is All-Knowing, Most Wise.",
    "And among them are those who harass the Prophet, and say, “He is all ears.” Say, “He listens for your own good. He believes in God, he trusts the believers, and he is a mercy for those among you who believe.” Those who insult God’s Messenger will have a painful punishment.",
    "They swear by God to you, to please you. But God and His Messenger are worthier of being pleased by them: if they are believers.",
    "Do they not know that whoever opposes God and His Messenger, will have the Fire of Hell, remaining in it forever? That is the ultimate disgrace.",
    "The hypocrites dread lest a chapter is revealed against them, informing them of what is in their hearts. Say, “Go on mocking; God will bring out what you dread.”",
    "And if you question them, they will say, “We were just joking and playing.” Say, “Was it God, His revelations, and His Messenger that you ridiculed?”",
    "Do not make excuses. You disbelieved after having believed. If We pardon some of you, We will punish others, because they are guilty.",
    "The hypocrite men and hypocrite women are of one another. They advocate evil, and prohibit righteousness, and withhold their hands. They forgot God, so He neglected them. The hypocrites are the sinners.",
    "God has promised the hypocrite men and hypocrite women, and the disbelievers, the Fire of Hell, remaining in it forever. It is their due. And God has cursed them, and they will have a lasting punishment.",
    "Like those before you. They were superior to you in might, and more abundant in wealth and children. So they enjoyed their share, and you enjoyed your share, just as those before you enjoyed their share. And you indulged, as they indulged. It is they whose works will fail in this world and in the Hereafter. It is they who are the losers.",
    "Did not the story of those before them reach them? The people of Noah, Aad, and Thamood, and the people of Abraham, the inhabitants of Median, and the Overturned Cities? Their messengers came to them with clear proofs. God never wronged them, but they used to wrong their own selves.",
    "The believing men and believing women are friends of one another. They advocate virtue, forbid evil, perform the prayers, practice charity, and obey God and His Messenger. These—God will have mercy on them. God is Mighty and Wise.",
    "God has promised the believers, men and women, Gardens beneath which rivers flow, to stay there forever, and splendid homes in the Gardens of Eden. But approval from God is even greater. That is the supreme achievement.",
    "O Prophet! Strive against the unbelievers and the hypocrites, and be stern with them. Their home is Hell—a miserable destination.",
    "They swear by God that they said nothing, but they did utter the word of blasphemy, and they renounced faith after their submission. And they had ambitions they could not achieve. They were resentful only because God and His Messenger have enriched them out of His grace. If they repent, it will be better for them. But if they turn away, God will afflict them with a painful punishment—in this life and in the Hereafter—and on earth, they will have no protector and no helper.",
    "And among them are those who pledge to God: “If He gives us from His grace, we will donate, and be of the upright.”",
    "But when He gave them from His grace, they withheld it, and they turned away indifferently.",
    "So He penalized them with hypocrisy in their hearts—until the Day they face Him—because they violated their pledge to God, and because they used to lie.",
    "Do they not know that God knows their secrets and their conspiracies? And that God is the Knower of the unseen?",
    "Those who criticize the believers for donating voluntarily, and ridicule those who find nothing to offer except their own efforts—God ridicules them—they will have a painful punishment.",
    "Whether you ask forgiveness for them, or do not ask forgiveness for them. Even if you ask forgiveness for them seventy times, God will not forgive them. That is because they rejected God and His Messenger. God does not guide the immoral people.",
    "Those who stayed behind rejoiced at their staying behind God’s Messenger. And they hated to strive with their wealth and their lives in God’s way. And they said, “Do not venture out in the heat.” Say, “The Fire of Gehenna is much hotter—if they only understood.”",
    "So let them laugh a little, and weep much—in return for what they used to earn.",
    "If God returns you to a group of them, and they ask your permission to go out, say, “You will not go out with me, ever, nor will you ever fight an enemy with me. You were content to sit back the first time, so sit back with those who stay behind.”",
    "You are never to pray over any of them who dies, nor are you to stand at his graveside. They have rejected God and His Messenger, and they died while they were sinners.",
    "Do not let their wealth and their children impress you. God intends to torment them through them in this world, and their souls expire while they are unbelievers.",
    "And when a chapter is revealed: “Believe in God and strive with His Messenger,” the prominent among them ask you for exemption. They say, “Leave us to stay with those who stay behind.”",
    "They prefer to be with those who stay behind. Their hearts were sealed, so they do not understand.",
    "But the Messenger and those who believe with him strive with their possessions and their lives. It is they who will have the good things, and it is they who will prosper.",
    "God has prepared for them Gardens beneath which rivers flow, to stay there forever. That is the ultimate victory.",
    "Some Nomadic-Arabs came with excuses, seeking an exemption. While those who were untrue to God and His Messenger remained behind. A painful punishment will afflict those among them who disbelieved.",
    "There is no blame on the weak, nor on the sick, nor on those who have nothing to contribute, provided they are true to God and His Messenger. In no way can the righteous be blamed. God is Forgiving and Merciful.",
    "Nor on those who approach you, wishing to ride with you, and you said, “I have nothing to carry you on.” So they turned away, with their eyes overflowing with tears, sorrowing for not finding the means to contribute.",
    "Blame lies on those who seek exemption from you, although they have the means. They are content to stay with those who stay behind. God has sealed their hearts, and they do not realize.",
    "They will offer you excuses when you return to them. Say, “Make no excuses; we do not believe you; God has informed us about you. And God will be watching your actions, and so will His Messenger. Then you will be returned to the Knower of the Known and the Unknown, and He will inform you of what you used to do.”",
    "They will swear by God to you, when you return to them, that you may leave them alone. So leave them alone. They are despicable, and their destiny is Hell; a payback for what they used to do.",
    "They swear to you, so that you may accept them. But even if you accept them, God does not accept the wicked people.",
    "The Desert-Arabs are the most steeped in disbelief and hypocrisy, and the most likely to ignore the limits that God has revealed to His Messenger. God is Knowing and Wise.",
    "And among the Desert-Arabs are those who consider their contribution to be a penalty. And they wait for a reversal of your fortunes. Upon them will fall the cycle of misfortune. God is Hearing and Knowing.",
    "Yet among the Desert-Arabs are those who believe in God and the Last Day, and consider their contribution to be means towards God, and the prayers of the Messenger. It will surely draw them closer, and God will admit them into His mercy. God is Forgiving and Merciful.",
    "The Pioneers—the first of the Migrants and the Supporters, and those who followed them in righteousness. God is pleased with them, and they are pleased with Him. He has prepared for them Gardens beneath which rivers flow, where they will abide forever. That is the ultimate triumph.",
    "And among the Desert-Arabs around you, some are hypocrites, and also among the inhabitants of Medina. They have become adamant in hypocrisy. You do not know them, but We know them. We will punish them twice; then they will be returned to severe suffering.",
    "And others have confessed their sins, having mixed righteous deeds with bad deeds. Perhaps God will accept their repentance. God is Forgiving and Merciful.",
    "Accept contributions from their wealth, to purify them and sanctify them with it—and bless them. Your prayer is a comfort for them. God is Hearing and Knowing.",
    "Do they not know that God accepts the repentance of His worshipers, and that He receives the contributions, and that God is the Acceptor of Repentance, the Merciful?",
    "Say, “Act. God will see your actions, as will His Messenger and the believers. Then you will be returned to the Knower of secrets and declarations, and He will inform you of what you used to do.”",
    "And others are held in suspense, awaiting the command of God, as to whether He will punish them, or relent towards them. God is Knowing and Wise.",
    "Then there are those who establish a mosque to create trouble, and disbelief, and disunity among the believers, and as an outpost for those who fight God and His Messenger. And they swear: “Our intentions are nothing but good.” But God testifies that they are liars.",
    "Do not stand in it, ever. A mosque founded upon piety from the first day is worthier of your prayers. In it are men who love to be purified. God loves those who purify themselves.",
    "Is he who establishes his structure upon piety and acceptance from God better, or he who establishes his structure on the brink of a cliff that is about to tumble, and so it tumbles with him into the Fire of Hell? God does not guide the wrongdoing people.",
    "The structure which they built will remain questionable in their hearts—until their hearts are stopped. God is Knowing and Wise.",
    "God has purchased from the believers their lives and their wealth in exchange for Paradise. They fight in God’s way, so they kill and get killed. It is a promise binding on Him in the Torah, and the Gospel, and the Quran. And who is more faithful to his promise than God? So rejoice in making such an exchange—that is the supreme triumph.",
    "Those who repent, those who worship, those who praise, those who journey, those who kneel, those who bow down, those who advocate righteousness and forbid evil, and those who observe the limits of God; and give good news to the believers.",
    "It is not for the Prophet and those who believe to ask forgiveness for the associators, even if they were close relatives—after it has become clear to them that they are the inhabitants of the Blaze.",
    "Abraham asked forgiveness for his father only because of a promise he had made to him. But when it became clear to him that he was an enemy of God, he disowned him. Abraham was caring and patient.",
    "It is not for God to lead a people astray after having guided them—until He clarifies for them what they should guard against. God is Knower of all things.",
    "To God belongs the sovereignty of the heavens and the earth. He gives life, and He causes death. And besides God, you have neither protector nor helper.",
    "God has redeemed the Prophet, and the Emigrants, and the Supporters—those who followed him in the hour of difficulty—after the hearts of some of them almost swerved. Then He accepted their repentance. He is Kind towards them, Compassionate.",
    "Also towards the three who were left behind. Then, when the earth, as vast as it is, closed in on them, and their souls closed in on them, and they realized that there was no refuge from God, except in Him, and He relented towards them, so that they may repent. God is the Acceptor of Repentance, the Most Merciful.",
    "O you who believe! Be mindful of God, and be among the truthful.",
    "It is not for the inhabitants of Medina and the Nomadic-Arabs around them to stay behind God’s Messenger, nor to prefer themselves to him. That is because they suffer no thirst, nor fatigue, nor hunger in the way of God, nor do they take one step that enrages the disbelievers, nor do they receive anything from an enemy, but it is recorded to their credit as a righteous deed. God does not waste the reward of the good-doers.",
    "Nor do they spend an expenditure, small or large, nor do they cross any valley, but it is recorded for them. So that God may reward them in accordance with the best of their deeds.",
    "It is not advisable for the believers to march out altogether. Of every division that marches out, let a group remain behind, to gain understanding in religion, and to notify their people when they have returned to them, so they may beware.",
    "O you who believe! Fight those of the disbelievers who attack you, and let them find severity in you. And know that God is with the reverent.",
    "And whenever a chapter is revealed, some of them say, “Which of you has this increased in faith?” As for those who believe: it increases them in faith, and they rejoice.",
    "But as for those in whose hearts is sickness: it adds disgrace to their disgrace, and they die while they are unbelievers.",
    "Do they not realize that they are tested every year, once or twice? But they do not repent, nor do they learn.",
    "And whenever a chapter is revealed, they look at one another, “Does anyone see you?” Then they slip away. God has diverted their hearts, because they are a people who do not understand.",
    "There has come to you a messenger from among yourselves, concerned over your suffering, anxious over your well-being. Kind and merciful towards the believers.",
    "If they turn away, say, “God is enough for me. There is no god except He. In Him I trust. And He is the Lord of the Magnificent Throne.”"
  ]
}